"""자체 кернел_утга MicroPython에서 사용하는 한글 ФУНКЦ_утга Нэр."""
import jkoros as үйлдлийн_систем
출력 = print
파일읽기 = үйлдлийн_систем.read
бичих_файл = үйлдлийн_систем.write
арилгах_файл = үйлдлийн_систем.remove
입력읽기 = үйлдлийн_систем.stdin
네모그리기 = үйлдлийн_систем.rect
그림기다리기 = үйлдлийн_систем.wait_key
밀리초 = үйлдлийн_систем.ticks_ms
전문통신열기 = үйлдлийн_систем.udp_open
전문보내기 = үйлдлийн_систем.udp_send
바깥전문보내기 = үйлдлийн_систем.udp_sendto
전문받기 = үйлдлийн_систем.udp_recv
хаах_Сүлжээ = үйлдлийн_систем.udp_close

def 글해독(өгөгдөл):
    return өгөгдөл.decode("utf-8")
