#ifndef _include_अंतरजाल_पता
#define _include_अंतरजाल_पता

#include <पूर्णांक_प्रकार.h>
#include <प्रणाली/socket.h>

typedef uint32_t अंतरजाल_पता_मान_प्रकार;
typedef uint16_t संचार_द्वार_संख्या_प्रकार;

struct अंतरजाल_पता {
    अंतरजाल_पता_मान_प्रकार पता_मान;
};

struct अंतरजाल_छोर_पता {
    पता_परिवार_प्रकार अंतरजाल_पता_परिवार;
    संचार_द्वार_संख्या_प्रकार संचार_द्वार_संख्या;
    struct अंतरजाल_पता अंतरजाल_पता_सामग्री;
    unsigned char पता_पूरण[8];
};

#define मूल_अंतरजाल_नियम 0
#define उपयोगकर्ता_आँकड़ा_संदेश_नियम 17
#define कोई_भी_स्थानीय_पता ((अंतरजाल_पता_मान_प्रकार)0x00000000U)
#define स्वयं_वापसी_पता ((अंतरजाल_पता_मान_प्रकार)0x7f000001U)

#endif
