package 지에이티이

import ()

type I인터럽트엔유엠비이알 uint8

const (
	D디아이브이아이디이비와이지이알오	= I인터럽트엔유엠비이알(0)

	N엔엠아이	= I인터럽트엔유엠비이알(2)

	O오브이이알에프엘오더블유	= I인터럽트엔유엠비이알(4)

	B비오유엔디알에이엔지이이엑스시이이디이디	= I인터럽트엔유엠비이알(5)

	I아이엔브이에이엘아이디오피시오디이	= I인터럽트엔유엠비이알(6)

	D디바이스엔오티에이브이에이아이엘에이비엘이	= I인터럽트엔유엠비이알(7)

	D디오유비엘이에프에이유엘티	= I인터럽트엔유엠비이알(8)

	I아이엔브이에이엘아이디티에스에스	= I인터럽트엔유엠비이알(10)

	S에스이지엠이엔티엔오티피알이에스이엔티	= I인터럽트엔유엠비이알(11)

	S스택에스이지엠이엔티에프에이유엘티	= I인터럽트엔유엠비이알(12)

	G지피에프이엑스시이피티아이오엔	= I인터럽트엔유엠비이알(13)

	P페이지에프에이유엘티이엑스시이피티아이오엔	= I인터럽트엔유엠비이알(14)

	F에프엘오에이티아이엔지피오아이엔티이엑스시이피티아이오엔	= I인터럽트엔유엠비이알(16)

	A에이엘아이지엔엠이엔티시에이치이시케이	= I인터럽트엔유엠비이알(17)

	M엠에이시에이치아이엔이시에이치이시케이	= I인터럽트엔유엠비이알(18)

	S에스아이엠디에프엘오에이티아이엔지피오아이엔티이엑스시이피티아이오엔	= I인터럽트엔유엠비이알(19)
)

func I이닛() {
	아이엔에스티에이엘엘아이디티()
}

func H에이치에이엔디엘이인터럽트(아이엔티엔유엠비이알 I인터럽트엔유엠비이알, 아이에스티오에프에프에스이티 uint8, 핸들러 func(*Registers))

func 아이엔에스티에이엘엘아이디티()

func 디아이에스피에이티시에이치인터럽트()

func 인터럽트지에이티이이엔티알아이이에스()
