#include "string.h"
size_t strlen(const char *ສະຕຣິງ_ຂໍ້ມູນ) { const char *ຂໍ້ມູນ_ຈັດຕໍາແຫນ່ງ = ສະຕຣິງ_ຂໍ້ມູນ; while (*ຂໍ້ມູນ_ຈັດຕໍາແຫນ່ງ) ຂໍ້ມູນ_ຈັດຕໍາແຫນ່ງ++; return ຂໍ້ມູນ_ຈັດຕໍາແຫນ່ງ - ສະຕຣິງ_ຂໍ້ມູນ; }
int memcmp(const void *첫째값, const void *둘째값, size_t 개수) { const unsigned char *ຈຸດ_ພິ_ກັດ_x = 첫째값, *ປຸ່ມ_Y_ຈຸດປະສານ = 둘째값; while (개수--) { if (*ຈຸດ_ພິ_ກັດ_x != *ປຸ່ມ_Y_ຈຸດປະສານ) return (int)*ຈຸດ_ພິ_ກັດ_x - *ປຸ່ມ_Y_ຈຸດປະສານ; ຈຸດ_ພິ_ກັດ_x++; ປຸ່ມ_Y_ຈຸດປະສານ++; } return 0; }
void *memmove(void *ປາຍທາງ_ຂໍ້ມູນ, const void *ສະຕຣິງ_ຂໍ້ມູນ, size_t 개수) { unsigned char *ຈຸດ_ພິ_ກັດ_x = ປາຍທາງ_ຂໍ້ມູນ; const unsigned char *ປຸ່ມ_Y_ຈຸດປະສານ = ສະຕຣິງ_ຂໍ້ມູນ; if (ຈຸດ_ພິ_ກັດ_x < ປຸ່ມ_Y_ຈຸດປະສານ) { for (size_t 순번 = 0; 순번 < 개수; 순번++) ຈຸດ_ພິ_ກັດ_x[순번] = ປຸ່ມ_Y_ຈຸດປະສານ[순번]; } else { while (개수) { 개수--; ຈຸດ_ພິ_ກັດ_x[개수] = ປຸ່ມ_Y_ຈຸດປະສານ[개수]; } } return ປາຍທາງ_ຂໍ້ມູນ; }
int strncmp(const char *첫째값, const char *둘째값, size_t 개수) { while (개수--) { unsigned char ຈຸດ_ພິ_ກັດ_x = *첫째값++, ປຸ່ມ_Y_ຈຸດປະສານ = *둘째값++; if (ຈຸດ_ພິ_ກັດ_x != ປຸ່ມ_Y_ຈຸດປະສານ) return (int)ຈຸດ_ພິ_ກັດ_x-ປຸ່ມ_Y_ຈຸດປະສານ; if (!ຈຸດ_ພິ_ກັດ_x) return 0; } return 0; }
/* lwIP only uses this for small decimal interface numbers. */
long strtol(const char *ສະຕຣິງ_ຂໍ້ມູນ, char **ຈົບ_ອອບເຊັດ, int ພື້ນຫຼັງ_ຄ່າ) {
    const char *ເລີ່ມ_ອອບເຊັດ = ສະຕຣິງ_ຂໍ້ມູນ; unsigned long ຄ່າ = 0; int ເຂົ້າລະຫັດ_ຄ່າ = 1, 하나라도 = 0;
    while (*ສະຕຣິງ_ຂໍ້ມູນ == ' ' || (*ສະຕຣິງ_ຂໍ້ມູນ >= 9 && *ສະຕຣິງ_ຂໍ້ມູນ <= 13)) ສະຕຣິງ_ຂໍ້ມູນ++;
    if (*ສະຕຣິງ_ຂໍ້ມູນ == '-' || *ສະຕຣິງ_ຂໍ້ມູນ == '+') { if (*ສະຕຣິງ_ຂໍ້ມູນ == '-') ເຂົ້າລະຫັດ_ຄ່າ = -1; ສະຕຣິງ_ຂໍ້ມູນ++; }
    if (ພື້ນຫຼັງ_ຄ່າ == 0) ພື້ນຫຼັງ_ຄ່າ = 10;
    while (*ສະຕຣິງ_ຂໍ້ມູນ >= '0' && *ສະຕຣິງ_ຂໍ້ມູນ <= '9' && *ສະຕຣິງ_ຂໍ້ມູນ - '0' < ພື້ນຫຼັງ_ຄ່າ) {
        unsigned ຕົວເລກ_ຄ່າ = *ສະຕຣິງ_ຂໍ້ມູນ++ - '0'; 하나라도 = 1;
        if (ຄ່າ > (0x7ffffffffffffffful - ຕົວເລກ_ຄ່າ) / (unsigned)ພື້ນຫຼັງ_ຄ່າ) ຄ່າ = 0x7ffffffffffffffful;
        else ຄ່າ = ຄ່າ * ພື້ນຫຼັງ_ຄ່າ + ຕົວເລກ_ຄ່າ;
    }
    if (ຈົບ_ອອບເຊັດ) *ຈົບ_ອອບເຊັດ = (char *)(하나라도 ? ສະຕຣິງ_ຂໍ້ມູນ : ເລີ່ມ_ອອບເຊັດ); return ເຂົ້າລະຫັດ_ຄ່າ > 0 ? (long)ຄ່າ : -(long)ຄ່າ;
}
int atoi(const char *ສະຕຣິງ_ຂໍ້ມູນ) { return (int)strtol(ສະຕຣິງ_ຂໍ້ມູນ, 0, 10); }
