package 유디피

import . "unsafe"
import . "콘솔"
import . "util"
import . "메모리매니저"
import . "ipv4"

var udp콘솔 = T콘솔{}

type T유저디에이티에이지알에이엠피알오티오시오엘에이치이에이디이알버퍼 struct {
	에스알시피오알티	[2]byte
	디에스티피오알티	[2]byte

	렝스		[2]byte
	시에이치이시케이에스유엠	[2]byte
}

var 유디피에이치이에이디이알사이즈 uint32 = 8

type T유저디에이티에이지알에이엠피알오티오시오엘에이치이에이디이알 struct {
	에스알시피오알티	uint16
	디에스티피오알티	uint16

	렝스		uint16
	시에이치이시케이에스유엠	uint16
}

func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘에이치이에이디이알) I이닛(버퍼 *T유저디에이티에이지알에이엠피알오티오시오엘에이치이에이디이알버퍼) {
	셀프.에스알시피오알티 = A어레이티오유아이엔티16(버퍼.에스알시피오알티)
	셀프.디에스티피오알티 = A어레이티오유아이엔티16(버퍼.디에스티피오알티)

	셀프.렝스 = A어레이티오유아이엔티16(버퍼.렝스)
	셀프.시에이치이시케이에스유엠 = A어레이티오유아이엔티16(버퍼.시에이치이시케이에스유엠)
}
func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘에이치이에이디이알) S셋버퍼(버퍼 *T유저디에이티에이지알에이엠피알오티오시오엘에이치이에이디이알버퍼) {

	버퍼.에스알시피오알티 = U유아이엔티16티오어레이(셀프.에스알시피오알티)
	버퍼.디에스티피오알티 = U유아이엔티16티오어레이(셀프.디에스티피오알티)

	버퍼.렝스 = U유아이엔티16티오어레이(셀프.렝스)
	버퍼.시에이치이시케이에스유엠 = U유아이엔티16티오어레이(셀프.시에이치이시케이에스유엠)

}

type I유저디에이티에이지알에이엠피알오티오시오엘핸들러 interface {
	H에이치에이엔디엘이유저디에이티에이지알에이엠피알오티오시오엘엠이에스에스에이지이(에스오시케이이티 *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티, 데이터 uintptr, 사이즈 uint16)
}

type T유저디에이티에이지알에이엠피알오티오시오엘핸들러 struct {
}

func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘핸들러) I이닛(비에이시케이이엔디 T아이엔티이알엔이티피알오티오시오엘피알오브이아이디이알) {
}
func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘핸들러) H에이치에이엔디엘이유저디에이티에이지알에이엠피알오티오시오엘엠이에스에스에이지이(에스오시케이이티 *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티, 데이터 uintptr, 사이즈 uint16) {
}

type I유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티 interface {
	H에이치에이엔디엘이유저디에이티에이지알에이엠피알오티오시오엘엠이에스에스에이지이(데이터 uintptr, 사이즈 uint16)
}
type T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티 struct {
	알이엠오티이피오알티	uint16
	알이엠오티이아이피	uint32
	엘오시에이엘피오알티	uint16
	엘오시에이엘아이피	uint32

	엘아이에스티이엔아이엔지	bool
}

var 유디피피알오브이아이디이알 T유저디에이티에이지알에이엠피알오티오시오엘피알오브이아이디이알
var 유디피핸들러 I유저디에이티에이지알에이엠피알오티오시오엘핸들러

func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티) T티이에스티() {
}
func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티) I이닛(피유디피피알오브이아이디이알 T유저디에이티에이지알에이엠피알오티오시오엘피알오브이아이디이알, 피유디피핸들러 I유저디에이티에이지알에이엠피알오티오시오엘핸들러) {
	유디피피알오브이아이디이알 = 피유디피피알오브이아이디이알
	if 유디피핸들러 == nil && 피유디피핸들러 != nil {
		유디피핸들러 = 피유디피핸들러
	}
	셀프.엘아이에스티이엔아이엔지 = false
}
func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티) H에이치에이엔디엘이유저디에이티에이지알에이엠피알오티오시오엘엠이에스에스에이지이(데이터 uintptr, 사이즈 uint16) {
	if 유디피핸들러 != nil {
		유디피핸들러.H에이치에이엔디엘이유저디에이티에이지알에이엠피알오티오시오엘엠이에스에스에이지이(셀프, 데이터, 사이즈)
	}
}
func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티) S에스이엔디(피데이터 []byte, 사이즈 uint16) {
	var 버퍼 [4096]byte
	for 아이 := 0; 아이 < int(사이즈); 아이++ {
		버퍼[아이] = 피데이터[아이]
	}
	var 데이터 = uintptr(Pointer(&버퍼))
	유디피피알오브이아이디이알.S에스이엔디(셀프, 데이터, 사이즈)
}
func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티) D디아이에스시오엔엔이시티() {
	유디피피알오브이아이디이알.D디아이에스시오엔엔이시티(셀프)
}

type T유저디에이티에이지알에이엠피알오티오시오엘피알오브이아이디이알 struct {
}

var 아이피핸들러 I아이엔티이알엔이티피알오티오시오엘핸들러
var 에스오시케이이티에스 [65535]T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티
var 엔유엠에스오시케이이티에스 int
var 프리피오알티 uint16

func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘피알오브이아이디이알) I이닛(피아이피피알오브이아이디이알 T아이엔티이알엔이티피알오티오시오엘피알오브이아이디이알, 피아이피핸들러 I아이엔티이알엔이티피알오티오시오엘핸들러) {
	아이피핸들러 = 피아이피핸들러
	아이피핸들러.I이닛(피아이피피알오브이아이디이알, 피아이피핸들러, 0x11)
	엔유엠에스오시케이이티에스 = 0
	프리피오알티 = 1024
}
func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘피알오브이아이디이알) O온아이엔티이알엔이티피알오티오시오엘알이시이브이아이시이디(에스알시아이피비이 uint32, 디에스티아이피비이 uint32, 아이엔티이알엔이티피알오티오시오엘피에이와이엘오에이디 uintptr, 사이즈 uint32) bool {
	if 사이즈 < 유디피에이치이에이디이알사이즈 {
		return false
	}

	var 버퍼 *T유저디에이티에이지알에이엠피알오티오시오엘에이치이에이디이알버퍼 = (*T유저디에이티에이지알에이엠피알오티오시오엘에이치이에이디이알버퍼)(Pointer(아이엔티이알엔이티피알오티오시오엘피에이와이엘오에이디))
	var 엠에스지 T유저디에이티에이지알에이엠피알오티오시오엘에이치이에이디이알
	엠에스지.I이닛(버퍼)

	var 에스오시케이이티 *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티 = nil

	for 아이 := 0; 아이 < 엔유엠에스오시케이이티에스 && 에스오시케이이티 == nil; 아이++ {
		if 에스오시케이이티에스[아이].엘오시에이엘피오알티 == 엠에스지.디에스티피오알티 && 에스오시케이이티에스[아이].엘오시에이엘아이피 == 디에스티아이피비이 && 에스오시케이이티에스[아이].엘아이에스티이엔아이엔지 == true {
			에스오시케이이티 = &에스오시케이이티에스[아이]
			에스오시케이이티.엘아이에스티이엔아이엔지 = false
			에스오시케이이티.알이엠오티이피오알티 = 엠에스지.에스알시피오알티
			에스오시케이이티.알이엠오티이아이피 = 에스알시아이피비이
		} else if 에스오시케이이티에스[아이].엘오시에이엘피오알티 == 엠에스지.디에스티피오알티 && 에스오시케이이티에스[아이].엘오시에이엘아이피 == 디에스티아이피비이 && 에스오시케이이티에스[아이].알이엠오티이피오알티 == 엠에스지.에스알시피오알티 && 에스오시케이이티에스[아이].알이엠오티이아이피 == 에스알시아이피비이 {
			에스오시케이이티 = &에스오시케이이티에스[아이]

		}
	}

	엠에스지.S셋버퍼(버퍼)
	if 에스오시케이이티 != nil {
		에스오시케이이티.H에이치에이엔디엘이유저디에이티에이지알에이엠피알오티오시오엘엠이에스에스에이지이(아이엔티이알엔이티피알오티오시오엘피에이와이엘오에이디+uintptr(유디피에이치이에이디이알사이즈), uint16(사이즈-유디피에이치이에이디이알사이즈))
	}

	return false
}

func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘피알오브이아이디이알) C시오엔엔이시티(아이피 uint32, 피오알티 uint16) *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티 {
	var 메모리매니저 = &T메모리매니저{}
	var 에스오시케이이티 = (*T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티)(메모리매니저.M엠에이엘엘오시(50))

	if 에스오시케이이티 != nil {

		에스오시케이이티.I이닛(*셀프, nil)
		에스오시케이이티.알이엠오티이피오알티 = 피오알티
		에스오시케이이티.알이엠오티이아이피 = 아이피
		에스오시케이이티.엘오시에이엘피오알티 = 프리피오알티
		프리피오알티++
		에스오시케이이티.엘오시에이엘아이피 = uint32((*아이피핸들러.G겟피알오브이아이디이알()).G겟아이피어드레스())

		에스오시케이이티.알이엠오티이피오알티 = U유아이엔티16알(에스오시케이이티.알이엠오티이피오알티)
		에스오시케이이티.엘오시에이엘피오알티 = U유아이엔티16알(에스오시케이이티.엘오시에이엘피오알티)

		에스오시케이이티에스[엔유엠에스오시케이이티에스] = *에스오시케이이티
		엔유엠에스오시케이이티에스++

	}
	return 에스오시케이이티

}
func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘피알오브이아이디이알) L엘아이에스티이엔(피오알티 uint16) *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티 {
	var 에스오시케이이티 = &T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티{}
	에스오시케이이티 = nil
	if 에스오시케이이티 != nil {
		에스오시케이이티.I이닛(*셀프, nil)
		에스오시케이이티.엘아이에스티이엔아이엔지 = true
		에스오시케이이티.엘오시에이엘피오알티 = 피오알티
		에스오시케이이티.엘오시에이엘아이피 = uint32((*아이피핸들러.G겟피알오브이아이디이알()).G겟아이피어드레스())

		에스오시케이이티.엘오시에이엘피오알티 = U유아이엔티16알(에스오시케이이티.엘오시에이엘피오알티)
	}
	return 에스오시케이이티
}
func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘피알오브이아이디이알) D디아이에스시오엔엔이시티(에스오시케이이티 *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티) {
	for 아이 := 0; 아이 < 엔유엠에스오시케이이티에스 && 에스오시케이이티 == nil; 아이++ {
		if 에스오시케이이티에스[아이] == *에스오시케이이티 {
			엔유엠에스오시케이이티에스--
			에스오시케이이티에스[아이] = 에스오시케이이티에스[엔유엠에스오시케이이티에스]
			break
		}
	}
}
func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘피알오브이아이디이알) S에스이엔디(에스오시케이이티 *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티, 피데이터 uintptr, 사이즈 uint16) {
	var 티오티에이엘렝스 = uint32(사이즈) + 유디피에이치이에이디이알사이즈

	var 버퍼 [4096]byte

	var 엠에스지버퍼 = (*T유저디에이티에이지알에이엠피알오티오시오엘에이치이에이디이알버퍼)(Pointer(&버퍼))

	var 엠에스지 = T유저디에이티에이지알에이엠피알오티오시오엘에이치이에이디이알{}

	엠에스지.에스알시피오알티 = 에스오시케이이티.엘오시에이엘피오알티
	엠에스지.디에스티피오알티 = 에스오시케이이티.알이엠오티이피오알티
	엠에스지.렝스 = U유아이엔티16알(uint16(티오티에이엘렝스))

	엠에스지.시에이치이시케이에스유엠 = 0x0
	엠에스지.S셋버퍼(엠에스지버퍼)

	var 데이터비와이티이에스 [4096]byte = *(*[4096]byte)(Pointer(피데이터))
	for 아이 := 0; 아이 < int(사이즈); 아이++ {
		버퍼[int(유디피에이치이에이디이알사이즈)+아이] = 데이터비와이티이에스[아이]
	}

	var 데이터 uintptr = uintptr(Pointer(&버퍼))

	아이피핸들러.S에스이엔디(에스오시케이이티.알이엠오티이아이피, 0x11, 데이터, 티오티에이엘렝스)

}
func (셀프 *T유저디에이티에이지알에이엠피알오티오시오엘피알오브이아이디이알) B비아이엔디(에스오시케이이티 *T유저디에이티에이지알에이엠피알오티오시오엘에스오시케이이티, 핸들러 *T유저디에이티에이지알에이엠피알오티오시오엘핸들러,) {
}
