package 통신카드

import . "unsafe"
import . "개입중단"
import . "단말"
import . "입출력접속"
import . "주변장치상호연결"

var 통신망카드단말 T단말 = T단말{}

type T통신카드초기설정 struct {
	방식		uint16
	번호전송임시공간	uint8
	번호수신임시공간	uint8

	물리주소	uint64

	논리주소	uint64
	수신임시공간설명주소	uintptr
	전송임시공간설명주소	uintptr
}
type T임시공간서술자 struct {
	주소_2	uint32
	표시값들	uint32
	표시값들2	uint32
	사용가능	uint32
}

type I원시자료처리기 interface {
	M원시자료수신시(자료주소참조 uintptr, 크기 int) bool
	M전송(자료주소참조 uintptr, 크기 uint32)
}

var 원시자료후단부 T통신카드79C973

type T원시자료처리기 struct {
}

func (자신 *T원시자료처리기) M후단부설정(후단부 T통신카드79C973) {

	원시자료후단부 = 후단부
}
func (자신 *T원시자료처리기) M후단부가져오기() T통신카드79C973 {
	return 원시자료후단부
}
func (자신 *T원시자료처리기) M원시자료수신시(자료주소참조 uintptr, 크기 int) bool {
	통신망카드단말.M지정좌표에출력(([]byte)("TRawDataRecv"), 1, 20)
	return true
}

func (자신 *T원시자료처리기) M전송(자료주소참조 uintptr, 크기 uint32) {
	통신망카드단말.M지정좌표에출력(([]byte)("TRawDataSend"), 10, 10)
	원시자료후단부.M전송(자료주소참조, 크기)
}

var 매체주소0접속 uint16
var 매체주소2접속 uint16
var 매체주소4접속 uint16
var 저장기자료접속 uint16
var 저장기주소접속 uint16
var 재설정접속 uint16
var 공용전송로제어저장기자료접속 uint16

var 초기화구획 T통신카드초기설정

var 전송임시공간설명 [8]T임시공간서술자
var 전송임시공간설명기억공간 [2048 + 15]byte
var 전송임시공간 [2*1024 + 15][8]uint8
var 현재전송임시공간 uint8

var 수신임시공간설명 [8]T임시공간서술자
var 수신임시공간설명기억공간 [2048 + 15]uint8
var 수신임시공간 [2*1024 + 15][8]uint8
var 현재수신임시공간 uint8
var 함수값 func(*T통신카드79C973, uint32) uint32

type T통신카드79C973 struct {
	T개입중단처리기
	장치서술자	T주변장치연결서술자
	개입중단	*T개입중단관리자
	처리기	*T원시자료처리기
}

var 단말_3 T단말 = T단말{}
var i원시자료처리기 I원시자료처리기

func (자신 *T통신카드79C973) M구동기초기화(개입중단 *T개입중단관리자, 장치서술자 T주변장치연결서술자, 처리기 I원시자료처리기) {

	자신.장치서술자 = 장치서술자

	함수값 = (*T통신카드79C973).H처리개입중단
	var 주소 uintptr
	주소 = uintptr(Pointer(&함수값))

	자신.F관문초기화(uint8(0x20+장치서술자.I개입중단), uintptr(Pointer(개입중단)), 주소)

	매체주소0접속 = uint16(장치서술자.P접속기준)
	매체주소2접속 = uint16(장치서술자.P접속기준) + 0x02
	매체주소4접속 = uint16(장치서술자.P접속기준) + 0x04
	저장기자료접속 = uint16(장치서술자.P접속기준) + 0x10
	저장기주소접속 = uint16(장치서술자.P접속기준) + 0x12
	재설정접속 = uint16(장치서술자.P접속기준) + 0x14
	공용전송로제어저장기자료접속 = uint16(장치서술자.P접속기준) + 0x16

	i원시자료처리기 = &T원시자료처리기{}
	if 처리기 != nil {
		i원시자료처리기 = 처리기
	}

	현재전송임시공간 = 0
	현재수신임시공간 = 0

	var MAC0 uint64 = uint64(F입출력접속16비트읽기(매체주소0접속) % 256)
	var MAC1 uint64 = uint64(F입출력접속16비트읽기(매체주소0접속) / 256)
	var MAC2 uint64 = uint64(F입출력접속16비트읽기(매체주소2접속) % 256)
	var MAC3 uint64 = uint64(F입출력접속16비트읽기(매체주소2접속) / 256)
	var MAC4 uint64 = uint64(F입출력접속16비트읽기(매체주소4접속) % 256)
	var MAC5 uint64 = uint64(F입출력접속16비트읽기(매체주소4접속) / 256)

	var MAC uint64 = (MAC5 << 40) | (MAC4 << 32) | (MAC3 << 24) | (MAC2 << 16) | (MAC1 << 8) | MAC0

	var mAC주소 uint64 = (MAC0 << 40) | (MAC1 << 32) | (MAC2 << 24) | (MAC3 << 16) | (MAC4 << 8) | MAC5

	단말_3.M지정좌표에출력(([]byte)("[interrupt num : "), 0, 13)
	단말_3.M16진수출력(uint8(장치서술자.I개입중단))
	단말_3.M출력(([]byte)("]"))
	단말_3.M출력(([]byte)("[mac address : "))
	단말_3.M부호없음정수16출력(uint16(mAC주소 >> 32))
	단말_3.M부호없음정수32출력(uint32(mAC주소 & 0x00000000FFFFFFFF))
	단말_3.M출력(([]byte)("]"))

	F입출력접속16비트쓰기(저장기주소접속, 20)
	F입출력접속16비트쓰기(공용전송로제어저장기자료접속, 0x102)

	F입출력접속16비트쓰기(저장기주소접속, 0)
	F입출력접속16비트쓰기(저장기자료접속, 0x04)

	초기화구획.방식 = 0x0000
	초기화구획.번호전송임시공간 = 3
	초기화구획.번호수신임시공간 = 3

	초기화구획.물리주소 = MAC

	초기화구획.논리주소 = 0

	전송임시공간설명 = *(*([8]T임시공간서술자))(Pointer((uintptr((Pointer)(&전송임시공간설명기억공간)) + 15) & ^(uintptr)(0xF)))
	초기화구획.전송임시공간설명주소 = uintptr(Pointer(&전송임시공간설명))
	수신임시공간설명 = *(*([8]T임시공간서술자))(Pointer((uintptr((Pointer)(&수신임시공간설명기억공간)) + 15) & ^(uintptr)(0xF)))
	초기화구획.수신임시공간설명주소 = uintptr(Pointer(&수신임시공간설명))

	for i := 0; i < 8; i++ {
		전송임시공간설명[i].주소_2 = uint32((uintptr(Pointer(&전송임시공간[i])) + 15) & ^(uintptr(0xF)))
		전송임시공간설명[i].표시값들 = 0x7FF | 0xF000
		전송임시공간설명[i].표시값들2 = 0
		전송임시공간설명[i].사용가능 = 0

		수신임시공간설명[i].주소_2 = uint32((uintptr(Pointer(&수신임시공간[i])) + 15) & ^(uintptr(0xF)))
		수신임시공간설명[i].표시값들 = 0xF7FF | 0x80000000

	}

	F입출력접속16비트쓰기(저장기주소접속, 1)
	F입출력접속16비트쓰기(저장기자료접속, uint16(uintptr(Pointer(&초기화구획))&0xFFFF))

	F입출력접속16비트쓰기(저장기주소접속, 2)
	F입출력접속16비트쓰기(저장기자료접속, uint16((uintptr(Pointer(&초기화구획))>>16)&0xFFFF))

}
func (자신 *T통신카드79C973) M활성화() {
	F입출력접속16비트쓰기(저장기주소접속, 0)
	F입출력접속16비트쓰기(저장기자료접속, 0x41)

	F입출력접속16비트쓰기(저장기주소접속, 4)
	임시 := F입출력접속16비트읽기(저장기자료접속)
	F입출력접속16비트쓰기(저장기주소접속, 4)
	F입출력접속16비트쓰기(저장기자료접속, 임시|0xC00)

	F입출력접속16비트쓰기(저장기주소접속, 0)
	F입출력접속16비트쓰기(저장기자료접속, 0x42)

}
func (자신 *T통신카드79C973) M재설정() int {
	F입출력접속16비트읽기(재설정접속)
	F입출력접속16비트쓰기(재설정접속, 0)
	return 10
}

var 개수 uint16 = 0

func (자신 *T통신카드79C973) H처리개입중단(확장쌓임공간주소 uint32) uint32 {

	F입출력접속16비트쓰기(저장기주소접속, 0)
	임시 := uint32(F입출력접속16비트읽기(저장기자료접속))
	단말_3.M출력(([]byte)("interrupt("))
	단말_3.M부호없음정수32출력(확장쌓임공간주소)
	단말_3.M출력(([]byte)(":"))
	단말_3.M부호없음정수32출력(임시)
	단말_3.M출력(([]byte)(":"))
	단말_3.M부호없음정수16출력(개수)
	개수++
	단말_3.M출력(([]byte)(")"))

	if (임시 & 0x8000) == 0x8000 {
		단말_3.M출력(([]byte)("am79c973 error"))
	}
	if (임시 & 0x2000) == 0x2000 {
		단말_3.M출력(([]byte)("am79c973 collision error"))
	}
	if (임시 & 0x1000) == 0x1000 {
		단말_3.M출력(([]byte)("am79c973 missed frame"))
	}
	if (임시 & 0x0800) == 0x0800 {
		단말_3.M출력(([]byte)("am79c973 memory error"))
	}
	if (임시 & 0x0400) == 0x0400 {
		단말_3.M출력(([]byte)("am79c973 data received"))
		자신.M수신()
	}
	if (임시 & 0x0200) == 0x0200 {
		단말_3.M출력(([]byte)("am79c973 data sent"))
	}

	F입출력접속16비트쓰기(저장기주소접속, 0)
	F입출력접속16비트쓰기(저장기자료접속, uint16(임시))

	if (임시 & 0x0100) == 0x0100 {
		단말_3.M출력(([]byte)("[netcard(am79c973) init done]"))
	}
	return 확장쌓임공간주소
}

func (자신 *T통신카드79C973) M전송(자료주소참조 uintptr, 크기 uint32) {
	var 전송서술자 uint16 = uint16(현재전송임시공간)
	현재전송임시공간 = 0

	if 크기 > 1518 {
		크기 = 1518
	}

	var 출발지_2 [4096]byte = *(*([4096]byte))(Pointer(자료주소참조))
	var 목적지_2 uint32 = 전송임시공간설명[전송서술자].주소_2 + 크기 - 1

	for i := 0; i < int(크기); i++ {

		*(*byte)(Pointer(uintptr(목적지_2))) = 출발지_2[int(크기)-i-1]

		목적지_2--
	}

	var 자료 [4096]byte = *(*([4096]byte))(Pointer(자료주소참조))
	단말_3.M지정좌표에출력(([]byte)("send packet"), 0, 2)
	for i := 0; i < 64; i++ {
		단말_3.M16진수출력(자료[i])
		단말_3.M출력(([]byte)(":"))
	}
	단말_3.M출력(([]byte)("\n"))

	전송임시공간설명[전송서술자].사용가능 = 0
	전송임시공간설명[전송서술자].표시값들2 = 0
	전송임시공간설명[전송서술자].표시값들 = 0x8300F000 | uint32((-크기)&0xFFF)

	F입출력접속16비트쓰기(저장기주소접속, 0)
	F입출력접속16비트쓰기(저장기자료접속, 0x48)

}
func (자신 *T통신카드79C973) M수신() {
	단말_3.M출력(([]byte)(":"))
	단말_3.M부호없음정수32출력(uint32(uintptr(Pointer(&전송임시공간))))
	단말_3.M출력(([]byte)(":"))
	단말_3.M16진수출력(전송임시공간[0][0])
	단말_3.M16진수출력(전송임시공간[0][1])
	단말_3.M출력(([]byte)(":"))
	현재수신임시공간 = 0

	for ; (수신임시공간설명[현재수신임시공간].표시값들 & 0x80000000) == 0; 현재수신임시공간 = (현재수신임시공간 + 1) % 8 {

		if !(수신임시공간설명[현재수신임시공간].표시값들&0x40000000 != 0) && ((수신임시공간설명[현재수신임시공간].표시값들 & 0x03000000) == 0x03000000) {
			var 크기 uint32 = 수신임시공간설명[현재수신임시공간].표시값들 & 0xFFF
			if 크기 > 64 {
				크기 -= 4
			}

			단말_3.M출력([]byte(" size : ["))
			단말_3.M부호없음정수32출력(크기)
			단말_3.M출력([]byte("]"))

			var 임시공간_2 [4096]byte = *(*([4096]byte))(Pointer(uintptr(수신임시공간설명[현재수신임시공간].주소_2)))
			var 주소참조 uintptr = uintptr(Pointer(&임시공간_2))
			if i원시자료처리기 != nil {
				if i원시자료처리기.M원시자료수신시(주소참조, int(크기)) {

					단말_3.M지정좌표에출력(([]byte)("self.Send"), 0, 22)

					자신.M전송(주소참조, 크기)
				}
			}

			var i uint32
			for i = 0; i < 64; i++ {
				단말_3.M16진수출력(임시공간_2[i])
				단말_3.M출력([]byte(":"))
			}

		}
		수신임시공간설명[현재수신임시공간].표시값들2 = 0
		수신임시공간설명[현재수신임시공간].표시값들 = 0x8000F7FF
	}
}
func (자신 *T통신카드79C973) M처리기설정(처리기 *T원시자료처리기) {
	자신.처리기 = 처리기
}
func (자신 *T통신카드79C973) M매체주소가져오기() uint64 {

	return 초기화구획.물리주소
}
func (자신 *T통신카드79C973) M상호연결망주소설정(상호연결망규약 uint64) {
	초기화구획.논리주소 = 상호연결망규약
}
func (자신 *T통신카드79C973) M상호연결망주소가져오기() uint64 {
	return 초기화구획.논리주소
}
