#include "예제규약.h"
int main(void) {
    const char ڪوائف[]="C فائل: sd 😀\n";
    int فائل=ٺاھيو_فائل("c.txt",پڙهڻ_لکڻ|없으면만들기|내용비우기,0600);
    if(فائل<0)return 1;
    if(لکو_فائل_ڪوائف(فائل,ڪوائف,sizeof(ڪوائف)-1)!=sizeof(ڪوائف)-1)return 2;
    if(ڳولا_فائل(فائل,0,처음기준)!=0)return 3;
    char 읽은글[128]={0};int لمبائي_قدر=파일자료읽기(فائل,읽은글,sizeof(읽은글)-1);
    بند_ڪرڻ_فائل(فائل);
    if(لمبائي_قدر!=sizeof(ڪوائف)-1)return 4;
    for(int 수=0;수<لمبائي_قدر;수++)if(ڪوائف[수]!=읽은글[수])return 5;
    return 출력(읽은글);
}
