// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
package मराठी.स्वकीय;
/** धागा म्हणजे एक कार्यप्रवाह. स्वतःचे JVM चाललेल्या सूचनांच्या संख्येनुसार धागे आळीपाळीने चालवते. */
public final class पारपाडा_कार्य {
    private पारपाडा_कार्य() {}
    public static कार्यसूत्र सुरू_करा(चालवण्यायोग्य_कार्य कार्य_क्रिया) { कार्यसूत्र कार्यसूत्र_मूल्य_5b72a632 = new कार्यसूत्र(कार्य_क्रिया); कार्यसूत्र_मूल्य_5b72a632.प्रारंभ_कार्य(); return कार्यसूत्र_मूल्य_5b72a632; }
    public static void प्रतीक्षाकरा(कार्यसूत्र कार्यसूत्र_मूल्य_5b72a632) throws प्रतीक्षा_करा_खंडित_अपवाद { कार्यसूत्र_मूल्य_5b72a632.प्रतीक्षाकरा(); }
    public static boolean आहे_कार्यरत(कार्यसूत्र कार्यसूत्र_मूल्य_5b72a632) { return कार्यसूत्र_मूल्य_5b72a632.आहे_कार्यरत(); }
    public static void निलंबित_करा_कार्य() { कार्यसूत्र.निलंबित_करा_कार्य(); }
}
