/*
	Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
*/

#ifndef _include_தொடர்பு_முகவரி_மாற்றம்_எட்டு_இரும_இலக்கக்_குழு_வரிசை
#define _include_தொடர்பு_முகவரி_மாற்றம்_எட்டு_இரும_இலக்கக்_குழு_வரிசை

#include <பிணையங்களிடை/முகவரி.h>

#ifdef __cplusplus
extern "C" {
#endif
uint16_t _16_இரும_இலக்கங்களை_வலை_வரிசைக்கு_மாற்று(uint16_t பொறி_வரிசையில்_16_இரும_இலக்க_மதிப்பு);
uint16_t _16_இரும_இலக்கங்களைப்_பொறி_வரிசைக்கு_மாற்று(uint16_t பிணைய_வரிசையில்_16_இரும_இலக்க_மதிப்பு);
uint32_t _32_இரும_இலக்கங்களை_வலை_வரிசைக்கு_மாற்று(uint32_t பொறி_வரிசையில்_32_இரும_இலக்க_மதிப்பு);
uint32_t _32_இரும_இலக்கங்களைப்_பொறி_வரிசைக்கு_மாற்று(uint32_t பிணைய_வரிசையில்_32_இரும_இலக்க_மதிப்பு);
#ifdef __cplusplus
}
#endif

#endif
