// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public class ဟန်ဂုမူရင်းကုဒ် {
    public static void main(String[] အချက်များ) throws မြန်မာ.ကိုယ်ပိုင်.အဝင်အထွက်ခြွင်းချက် {
        မြန်မာ.ကိုယ်ပိုင်.အထွက်.စာကြောင်းထုတ်("ကိုယ်ပိုင် 컴파일러와 မြန်မာ စာကြည့်တိုက်");
        int အက္ခရာအရေအတွက် = မြန်မာ.ကိုယ်ပိုင်.အက္ခရာ.ကုဒ်အမှတ်တစ်ခုအရေအတွက်("한글😀");
        မြန်မာ.ကိုယ်ပိုင်.အထွက်.ကိန်းထုတ်(အက္ခရာအရေအတွက်);
        မြန်မာ.ကိုယ်ပိုင်.ဖိုင်.ရေး("한글자료.txt", "ကိုယ်ပိုင် အူတိုင်တန်ဖိုး 안에서 저장한 한글😀");
        မြန်မာ.ကိုယ်ပိုင်.အထွက်.စာကြောင်းထုတ်(မြန်မာ.ကိုယ်ပိုင်.ဖိုင်.ဖတ်("한글자료.txt"));
    }
}
