package main

import (
	"reflect"
	"unsafe"
)

type 티이엑스티모드더블유알아이티이알 struct {
}

func (이 티이엑스티모드더블유알아이티이알) W라이트(피 []byte) (int, error) {
	티이엑스티모드피알아이엔티비와이티이에스(피)
	return len(피), nil
}

type 티이엑스티모드에러더블유알아이티이알 struct {
}

func (이 티이엑스티모드에러더블유알아이티이알) W라이트(피 []byte) (int, error) {
	티이엑스티모드피알아이엔티에러비와이티이에스(피)
	return len(피), nil
}

const (
	에프비더블유아이디티에이치			= 80
	에프비에이치이아이지에이치티			= 25
	에프비피에이치와이에스에이디디알	uintptr	= 0xb8000
	시유알에스오알에이치이아이지에이치티		= 1
	시유알에스오알에스티에이알티			= 11
)

var (
	에프비시유알엘아이엔이	= 0
	에프비시유알시오엘	= 0
)

var 에프비 []uint16

func 티이엑스티모드이닛() {
	에프비 = *(*[]uint16)(unsafe.Pointer(&reflect.SliceHeader{
		Len:	에프비더블유아이디티에이치 * 에프비에이치이아이지에이치티,
		Cap:	에프비더블유아이디티에이치 * 에프비에이치이아이지에이치티,
		Data:	에프비피에이치와이에스에이디디알,
	}))

}

func 티이엑스티모드이엔에이비엘이시유알에스오알() {
	Outb(0x3D4, 0x0A)
	Outb(0x3D5, (Inb(0x3D5)&0xC0)|시유알에스오알에스티에이알티)

	Outb(0x3D4, 0x0B)
	Outb(0x3D5, (Inb(0x3D5)&0xE0)|시유알에스오알에이치이아이지에이치티+시유알에스오알에스티에이알티)
}

func 티이엑스티모드디아이에스에이비엘이시유알에스오알() {
	Outb(0x3D4, 0x0A)
	Outb(0x3D5, 0x20)
}

func 티이엑스티모드유피디에이티이시유알에스오알(엑스 int, 와이 int) {
	포스 := 와이*에프비더블유아이디티에이치 + 엑스
	Outb(0x3D4, 0x0F)
	Outb(0x3D5, uint8(포스&0xFF))
	Outb(0x3D4, 0x0E)
	Outb(0x3D5, uint8((포스>>8)&0xFF))
}

func 티이엑스티모드에프엘유에스에이치에스시알이이엔() {
	for 아이 := range 에프비 {
		에프비[아이] = 0xf00
	}
}

func 티이엑스티모드시에이치이시케이에프비무브() {
	for 에프비시유알엘아이엔이 >= 에프비에이치이아이지에이치티 {
		copy(에프비[:len(에프비)-에프비더블유아이디티에이치], 에프비[에프비더블유아이디티에이치:])

		for 아이 := 0; 아이 < 에프비더블유아이디티에이치; 아이++ {
			에프비[(에프비에이치이아이지에이치티-1)*에프비더블유아이디티에이치+아이] = 0xf00
		}
		에프비시유알엘아이엔이--
	}
}

func 티이엑스티모드피알아이엔티시오엘(에스 string, 에이티티알 uint8) {
	for _, 비 := range 에스 {
		티이엑스티모드피알아이엔티시에이치에이알시오엘(uint8(비), 에이티티알)
	}
}

func 티이엑스티모드피알아이엔티엘엔시오엘(에스 string, 에이티티알 uint8) {
	for _, 비 := range 에스 {
		티이엑스티모드피알아이엔티시에이치에이알시오엘(uint8(비), 에이티티알)
	}
	티이엑스티모드피알아이엔티시에이치에이알(0xa)
}

func 티이엑스티모드피알아이엔티(에스 string) {
	for _, 비 := range 에스 {
		티이엑스티모드피알아이엔티시에이치에이알(uint8(비))
	}
}

func 티이엑스티모드피알아이엔티비와이티이에스(에이 []byte) {
	for _, 비 := range 에이 {
		티이엑스티모드피알아이엔티시에이치에이알(uint8(비))
	}
}

func 티이엑스티모드피알아이엔티에러비와이티이에스(에이 []byte) {
	for _, 비 := range 에이 {
		티이엑스티모드피알아이엔티시에이치에이알시오엘(uint8(비), 4<<4|0xf)
	}
}

func 티이엑스티모드피알아이엔티엘엔(에스 string) {
	for _, 비 := range 에스 {
		티이엑스티모드피알아이엔티시에이치에이알(uint8(비))
	}
	티이엑스티모드피알아이엔티시에이치에이알(0xa)
}

func 티이엑스티모드피알아이엔티에러(에스 string) {
	for _, 비 := range 에스 {
		티이엑스티모드피알아이엔티시에이치에이알시오엘(uint8(비), 4<<4|0xf)
	}
}

func 티이엑스티모드피알아이엔티이알알오알엘엔(에스 string) {
	티이엑스티모드피알아이엔티에러(에스)
	티이엑스티모드피알아이엔티시에이치에이알(0xa)
}

func 티이엑스티모드피알아이엔티시에이치에이알(시에이치에이알 uint8) {
	티이엑스티모드피알아이엔티시에이치에이알시오엘(시에이치에이알, 0<<4|0xf)
}

func 티이엑스티모드피알아이엔티시에이치에이알시오엘(시에이치에이알 uint8, 에이티티알 uint8) {
	티이엑스티모드시에이치이시케이에프비무브()
	if 시에이치에이알 == '\n' {
		에프비시유알엘아이엔이++
		에프비시유알시오엘 = 0
		티이엑스티모드시에이치이시케이에프비무브()
	} else if 시에이치에이알 == '\b' {
		에프비[에프비시유알시오엘+에프비시유알엘아이엔이*에프비더블유아이디티에이치] = 0xf00
		에프비시유알시오엘 = 에프비시유알시오엘 - 1
		if 에프비시유알시오엘 < 0 {
			에프비시유알시오엘 = 0
		}
	} else if 시에이치에이알 == '\r' {
		에프비시유알시오엘 = 0
	} else {
		if 에프비시유알시오엘 >= 에프비더블유아이디티에이치 {
			return
		}
		에프비[에프비시유알시오엘+에프비시유알엘아이엔이*에프비더블유아이디티에이치] = uint16(에이티티알)<<8 | uint16(시에이치에이알)
		에프비시유알시오엘++
	}

}

func 티이엑스티모드피알아이엔티에이치이엑스64(엔유엠 uint64) {
	티이엑스티모드피알아이엔티에이치이엑스32(uint32(엔유엠 >> 32))
	티이엑스티모드피알아이엔티에이치이엑스32(uint32(엔유엠))
}

func 티이엑스티모드피알아이엔티에이치이엑스32(엔유엠 uint32) {
	티이엑스티모드피알아이엔티에이치이엑스16(uint16(엔유엠 >> 16))
	티이엑스티모드피알아이엔티에이치이엑스16(uint16(엔유엠))
}

func 티이엑스티모드피알아이엔티에이치이엑스16(엔유엠 uint16) {
	티이엑스티모드피알아이엔티에이치이엑스(uint8(엔유엠 >> 8))
	티이엑스티모드피알아이엔티에이치이엑스(uint8(엔유엠))
}

func 티이엑스티모드피알아이엔티에이치이엑스(엔유엠 uint8) {
	티이엑스티모드피알아이엔티에이치이엑스시에이치에이알(엔유엠 >> 4)
	티이엑스티모드피알아이엔티에이치이엑스시에이치에이알(엔유엠)
}

func 티이엑스티모드피알아이엔티에이치이엑스시에이치에이알(엔아이비비엘이 uint8) {
	엔 := 엔아이비비엘이 & 0xf
	if 엔 < 10 {
		티이엑스티모드피알아이엔티시에이치에이알(0x30 + 엔)
	} else {
		티이엑스티모드피알아이엔티시에이치에이알(0x41 + 엔 - 10)
	}
}
