from ελληνικά import Έξοδος, ανοίγω_αυτοδύναμο_πακέτο, στέλνω_εξωτερικός_αυτοδύναμο_πακέτο, λαμβάνω_αυτοδύναμο_πακέτο, κλείνω_δίκτυο, 밀리초
from ελληνικά import σφάλμα_συστήματος, 다시시도오류, κωδικοποιώ_μήνυμα, 명령인수, ακέραιος
τελικό_σημείο = ανοίγω_αυτοδύναμο_πακέτο(0)
try:
    αυτοδύναμο_πακέτο = κωδικοποιώ_μήνυμα("PYTHON UDP Modern Greek (1453-)")
    στέλνω_εξωτερικός_αυτοδύναμο_πακέτο(τελικό_σημείο, "10.0.2.2", ακέραιος(명령인수[1]), αυτοδύναμο_πακέτο)
    Εκτέλεση_2 = 밀리초()
    while True:
        try:
            απαντώ, θύρα_τιμή = λαμβάνω_αυτοδύναμο_πακέτο(τελικό_σημείο)
            break
        except σφάλμα_συστήματος as ΣΦΑΛΜΑ:
            if ΣΦΑΛΜΑ.Ευρετήριο != 다시시도오류 or 밀리초() - Εκτέλεση_2 >= 700:
                raise
    assert απαντώ == αυτοδύναμο_πακέτο
    Έξοδος("PYTHON 네트워크 επαληθεύω: UDP Modern Greek (1453-)")
finally:
    κλείνω_δίκτυο(τελικό_σημείο)
