"""자체 kernel_ᏧᎬᏩᎶᏗᏯ MicroPython에서 사용하는 한글 ᏧᎸᏫᏍᏓᏁᏗᏱ_ᏧᎬᏩᎶᏗᏯ ᏚᏙᎥᎢ."""
import jkoros as ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ
출력 = print
파일읽기 = ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ.read
ᎪᏪᎶᏗ_ᎠᏍᏆᏂᎪᏙᏗ = ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ.write
ᎯᎲᎾ_ᎠᏍᏆᏂᎪᏙᏗ = ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ.remove
입력읽기 = ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ.stdin
네모그리기 = ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ.rect
그림기다리기 = ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ.wait_key
밀리초 = ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ.ticks_ms
전문통신열기 = ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ.udp_open
전문보내기 = ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ.udp_send
바깥전문보내기 = ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ.udp_sendto
전문받기 = ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ.udp_recv
ᎯᏍᏚᎲᎦ_ᏧᎾᏚᏓᎵ = ᎢᏯᏛᏁᏗ_ᏄᏍᏗᏓᏅᎢ.udp_close

def 글해독(ᎦᏟᏌᏅᎯ):
    return ᎦᏟᏌᏅᎯ.decode("utf-8")
