from ಕನ್ನಡ import ಔಟ್_ಪುಟ್, 전문통신열기, 바깥전문보내기, 전문받기, ಮುಚ್ಚು_ನೆಟ್_ವರ್ಕ್, 밀리초
from ಕನ್ನಡ import ಸಿಸ್ಟಂ_ದೋಷ, 다시시도오류, 글부호화, 명령인수, ಪೂರ್ಣಸಂಖ್ಯೆ
종단 = 전문통신열기(0)
try:
    전문 = 글부호화("PYTHON UDP kn")
    바깥전문보내기(종단, "10.0.2.2", ಪೂರ್ಣಸಂಖ್ಯೆ(명령인수[1]), 전문)
    ಚಲಾಯಿಸು_2 = 밀리초()
    while True:
        try:
            ಪ್ರತ್ಯುತ್ತರ, ಪೋರ್ಟ್_ಮೌಲ್ಯ = 전문받기(종단)
            break
        except ಸಿಸ್ಟಂ_ದೋಷ as ದೋಷ:
            if ದೋಷ.ಪದಸೂಚಿ != 다시시도오류 or 밀리초() - ಚಲಾಯಿಸು_2 >= 700:
                raise
    assert ಪ್ರತ್ಯುತ್ತರ == 전문
    ಔಟ್_ಪುಟ್("PYTHON 네트워크 ಖಚಿತಪಡಿಸಿಕೊಳ್ಳು: UDP kn")
finally:
    ಮುಚ್ಚು_ನೆಟ್_ವರ್ಕ್(종단)
