"""เอง เคอร์เนล_ค่า MicroPython에서 사용하는 한글 ฟังก์ชัน_ค่า ชื่อ."""
import jkoros as ระบบปฏิบัติการ
ข้อความออก = print
파일읽기 = ระบบปฏิบัติการ.read
파일쓰기 = ระบบปฏิบัติการ.write
นําออก_แฟ้ม = ระบบปฏิบัติการ.remove
입력읽기 = ระบบปฏิบัติการ.stdin
วาด_สี่เหลี่ยมผืนผ้า = ระบบปฏิบัติการ.rect
그림기다리기 = ระบบปฏิบัติการ.wait_key
밀리초 = ระบบปฏิบัติการ.ticks_ms
เปิด_เดตาแกรม = ระบบปฏิบัติการ.udp_open
ส่ง_เดตาแกรม = ระบบปฏิบัติการ.udp_send
ส่ง_ภายนอก_เดตาแกรม = ระบบปฏิบัติการ.udp_sendto
รับ_เดตาแกรม = ระบบปฏิบัติการ.udp_recv
ปิด_เครือข่าย = ระบบปฏิบัติการ.udp_close

def 글해독(ข้อมูล):
    return ข้อมูล.decode("utf-8")
