// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public class ΠαράδειγμαΣχεδίου {
    public static void Εκτέλεση_2() {
        // 640x480 화면 오른쪽에 빨강/초록/파랑 사각형을 그린다.
        ελληνικά.ίδιο.화면.ορθογώνιο(600, 400, 28, 20, 0x0000ff);
        ελληνικά.ίδιο.화면.ορθογώνιο(600, 425, 28, 20, 0x00ff00);
        ελληνικά.ίδιο.화면.ορθογώνιο(600, 450, 28, 20, 0xff0000);
        ελληνικά.ίδιο.Έξοδος.εγγράφω_γραμμή("JAVA 그래픽: RGB");
        ελληνικά.ίδιο.Έξοδος.εγγράφω_γραμμή("Enter");
        ελληνικά.ίδιο.화면.기다리기();
    }
}
