// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int نرخ) {
        if (نرخ < 0x80) 보드.직렬쓰기(نرخ);
        else if (نرخ < 0x800) {
            보드.직렬쓰기(0xc0 | (نرخ >> 6)); 보드.직렬쓰기(0x80 | (نرخ & 63));
        } else if (نرخ < 0x10000) {
            보드.직렬쓰기(0xe0 | (نرخ >> 12)); 보드.직렬쓰기(0x80 | ((نرخ >> 6) & 63)); 보드.직렬쓰기(0x80 | (نرخ & 63));
        } else {
            보드.직렬쓰기(0xf0 | (نرخ >> 18)); 보드.직렬쓰기(0x80 | ((نرخ >> 12) & 63));
            보드.직렬쓰기(0x80 | ((نرخ >> 6) & 63)); 보드.직렬쓰기(0x80 | (نرخ & 63));
        }
    }
    static void ڕایت_کردن(String دەق) {
        for (int پێرست = 0; پێرست < دەق.length(); پێرست++) {
            int نرخ = دەق.charAt(پێرست);
            if (نرخ >= 0xd800 && نرخ <= 0xdbff && پێرست + 1 < دەق.length()) {
                int 아래 = دەق.charAt(پێرست + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    نرخ = 0x10000 + ((نرخ - 0xd800) << 10) + 아래 - 0xdc00; پێرست++;
                }
            }
            if (نرخ >= 0xd800 && نرخ <= 0xdfff) نرخ = 0xfffd;
            문자(نرخ);
        }
    }
    static void 수(int نرخ) {
        if (نرخ < 0) 문자('-'); else نرخ = -نرخ;
        int 자리 = 1000000000;
        boolean ڕادان = false;
        while (자리 > 0) {
            int ڕه_نووس_نرخ = -(نرخ / 자리);
            if (ڕه_نووس_نرخ != 0 || ڕادان || 자리 == 1) { 문자('0' + ڕه_نووس_نرخ); ڕادان = true; }
            نرخ %= 자리; 자리 /= 10;
        }
    }
}
