package 프로세스

import . "unsafe"
import . "util/list"
import 엠이엠 "메모리매니저"
import . "태스킹/스레드"
import . "태스킹/스케줄러"
import . "util"

const P피알오시유저힙사이즈 = 1 * 1024 * 1024

type P프로세스 struct {
	아이디		uint32
	에스와이에스시에이엘엘아이디	int
	I아이에스유저스페이스	bool
	에이알지에스		*[]byte

	T스레드리스트		L엘아이엔케이이디리스트
	T티에이치알이에이디에스	*L엘아이엔케이이디리스트
	F파일네임		[]byte

	P페이지디아이알엔트리	uintptr
}

func (셀프 *P프로세스) I이닛(엠이엠 *엠이엠.T메모리매니저) {
	셀프.T스레드리스트 = L엘아이엔케이이디리스트{}
	셀프.T티에이치알이에이디에스 = &셀프.T스레드리스트
	셀프.T티에이치알이에이디에스.I이닛(엠이엠)
}

type P프로세스에이치이엘피이알 struct {
	피알오시이에스에스이에스	L엘아이엔케이이디리스트
	엠이엠		*엠이엠.T메모리매니저
	커널페이지디아이알엔트리	uintptr
}

func (셀프 *P프로세스에이치이엘피이알) I이닛(엠이엠 *엠이엠.T메모리매니저, 커널페이지디아이알엔트리 uintptr) {
	셀프.엠이엠 = 엠이엠
	셀프.피알오시이에스에스이에스 = L엘아이엔케이이디리스트{}
	셀프.피알오시이에스에스이에스.I이닛(셀프.엠이엠)
	셀프.커널페이지디아이알엔트리 = 커널페이지디아이알엔트리
}

func (셀프 *P프로세스에이치이엘피이알) C시알이에이티이(엔트리피오아이엔티 func(), 스레드에이치이엘피이알 *T스레드에이치이엘피이알, P페이지디아이알엔트리 uint32, 아이에스커널 bool) P프로세스 {
	프로세스 := (*P프로세스)(셀프.엠이엠.M엠에이엘엘오시(uint32(Sizeof(P프로세스{}))))
	if 프로세스 == nil {
		return P프로세스{}
	}
	프로세스.I이닛(셀프.엠이엠)
	프로세스.아이디 = A앨로케이트피아이디()
	프로세스.P페이지디아이알엔트리 = uintptr(P페이지디아이알엔트리)
	엠에이아이엔스레드 := 스레드에이치이엘피이알.C시알이에이티이피티알에프알오엠펑션(엔트리피오아이엔티, P페이지디아이알엔트리, 아이에스커널)
	if 엠에이아이엔스레드 != nil {
		엠에이아이엔스레드.P피아이디 = 프로세스.아이디
		엠에이아이엔스레드.P페어런트피아이디 = 0
		프로세스.T티에이치알이에이디에스.P피유에스에이치비에이시케이(uintptr(Pointer(엠에이아이엔스레드)))
	}

	셀프.피알오시이에스에스이에스.P피유에스에이치비에이시케이(uintptr(Pointer(프로세스)))

	return *프로세스
}

func (셀프 *P프로세스에이치이엘피이알) S에스피에이더블유엔(엔트리피오아이엔티 func(), 스레드에이치이엘피이알 *T스레드에이치이엘피이알, 스케줄러 *S스케줄러, P페이지디아이알엔트리 uint32, 아이에스커널 bool) P프로세스 {
	프로세스 := 셀프.C시알이에이티이(엔트리피오아이엔티, 스레드에이치이엘피이알, P페이지디아이알엔트리, 아이에스커널)
	if 프로세스.T티에이치알이에이디에스 != nil && 프로세스.T티에이치알이에이디에스.S사이즈_에스아이지이 > 0 {
		스레드 := (*T스레드)(프로세스.T티에이치알이에이디에스.G겟에이티(0))
		if 스레드 != nil && 스케줄러 != nil {
			스케줄러.A에이디디스레드(스레드)
		}
	}
	return 프로세스
}

func (셀프 *P프로세스에이치이엘피이알) 카피페이지디아이알(에스알시엔트리 uintptr, 디에스티엔트리 uintptr) {
	에스알시 := G겟유아이엔티32어레이에프알오엠피티알(에스알시엔트리, 1024, 1024)
	디에스티 := G겟유아이엔티32어레이에프알오엠피티알(디에스티엔트리, 1024, 1024)

	for 아이 := uint32(0); 아이 < 1024; 아이++ {
		디에스티[아이] = 에스알시[아이]
	}
}
func (셀프 *P프로세스에이치이엘피이알) C시알이에이티이에프알오엠데이터() P프로세스 {
	프로세스 := P프로세스{}
	return 프로세스
}
