// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int قىممىتى) {
        if (قىممىتى < 0x80) سۇپا.직렬쓰기(قىممىتى);
        else if (قىممىتى < 0x800) {
            سۇپا.직렬쓰기(0xc0 | (قىممىتى >> 6)); سۇپا.직렬쓰기(0x80 | (قىممىتى & 63));
        } else if (قىممىتى < 0x10000) {
            سۇپا.직렬쓰기(0xe0 | (قىممىتى >> 12)); سۇپا.직렬쓰기(0x80 | ((قىممىتى >> 6) & 63)); سۇپا.직렬쓰기(0x80 | (قىممىتى & 63));
        } else {
            سۇپا.직렬쓰기(0xf0 | (قىممىتى >> 18)); سۇپا.직렬쓰기(0x80 | ((قىممىتى >> 12) & 63));
            سۇپا.직렬쓰기(0x80 | ((قىممىتى >> 6) & 63)); سۇپا.직렬쓰기(0x80 | (قىممىتى & 63));
        }
    }
    static void ياز(String تېكىست) {
        for (int ئىندېكس = 0; ئىندېكس < تېكىست.length(); ئىندېكس++) {
            int قىممىتى = تېكىست.charAt(ئىندېكس);
            if (قىممىتى >= 0xd800 && قىممىتى <= 0xdbff && ئىندېكس + 1 < تېكىست.length()) {
                int 아래 = تېكىست.charAt(ئىندېكس + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    قىممىتى = 0x10000 + ((قىممىتى - 0xd800) << 10) + 아래 - 0xdc00; ئىندېكس++;
                }
            }
            if (قىممىتى >= 0xd800 && قىممىتى <= 0xdfff) قىممىتى = 0xfffd;
            문자(قىممىتى);
        }
    }
    static void 수(int قىممىتى) {
        if (قىممىتى < 0) 문자('-'); else قىممىتى = -قىممىتى;
        int ئورۇنلاشتۇرۇش_ئىندېكس = 1000000000;
        boolean ئىجرا_قىل_2 = false;
        while (ئورۇنلاشتۇرۇش_ئىندېكس > 0) {
            int خانا_قىممىتى = -(قىممىتى / ئورۇنلاشتۇرۇش_ئىندېكس);
            if (خانا_قىممىتى != 0 || ئىجرا_قىل_2 || ئورۇنلاشتۇرۇش_ئىندېكس == 1) { 문자('0' + خانا_قىممىتى); ئىجرا_قىل_2 = true; }
            قىممىتى %= ئورۇنلاشتۇرۇش_ئىندېكس; ئورۇنلاشتۇرۇش_ئىندېكس /= 10;
        }
    }
}
