// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int मान) {
        if (मान < 0x80) बोर्ड.직렬쓰기(मान);
        else if (मान < 0x800) {
            बोर्ड.직렬쓰기(0xc0 | (मान >> 6)); बोर्ड.직렬쓰기(0x80 | (मान & 63));
        } else if (मान < 0x10000) {
            बोर्ड.직렬쓰기(0xe0 | (मान >> 12)); बोर्ड.직렬쓰기(0x80 | ((मान >> 6) & 63)); बोर्ड.직렬쓰기(0x80 | (मान & 63));
        } else {
            बोर्ड.직렬쓰기(0xf0 | (मान >> 18)); बोर्ड.직렬쓰기(0x80 | ((मान >> 12) & 63));
            बोर्ड.직렬쓰기(0x80 | ((मान >> 6) & 63)); बोर्ड.직렬쓰기(0x80 | (मान & 63));
        }
    }
    static void लिखें(String पाठ) {
        for (int इंडेक्स = 0; इंडेक्स < पाठ.length(); इंडेक्स++) {
            int मान = पाठ.charAt(इंडेक्स);
            if (मान >= 0xd800 && मान <= 0xdbff && इंडेक्स + 1 < पाठ.length()) {
                int 아래 = पाठ.charAt(इंडेक्स + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    मान = 0x10000 + ((मान - 0xd800) << 10) + 아래 - 0xdc00; इंडेक्स++;
                }
            }
            if (मान >= 0xd800 && मान <= 0xdfff) मान = 0xfffd;
            문자(मान);
        }
    }
    static void 수(int मान) {
        if (मान < 0) 문자('-'); else मान = -मान;
        int पद_इंडेक्स = 1000000000;
        boolean चलाएँ = false;
        while (पद_इंडेक्स > 0) {
            int अंक_मान = -(मान / पद_इंडेक्स);
            if (अंक_मान != 0 || चलाएँ || पद_इंडेक्स == 1) { 문자('0' + अंक_मान); चलाएँ = true; }
            मान %= पद_इंडेक्स; पद_इंडेक्स /= 10;
        }
    }
}
