from 한국어 import 출력, 전문통신열기, 바깥전문보내기, 전문받기, داخستن_تۆڕ, 밀리초
from 한국어 import سیستم_هەڵە, 다시시도오류, 글부호화, 명령인수, ژمارەی_سروشتی
종단 = 전문통신열기(0)
try:
    전문 = 글부호화("PYTHON UDP ckb")
    바깥전문보내기(종단, "10.0.2.2", ژمارەی_سروشتی(명령인수[1]), 전문)
    ڕادان = 밀리초()
    while True:
        try:
            وەڵامدانەوه, دەرگا_نرخ = 전문받기(종단)
            break
        except سیستم_هەڵە as هەڵە:
            if هەڵە.پێرست != 다시시도오류 or 밀리초() - ڕادان >= 700:
                raise
    assert وەڵامدانەوه == 전문
    출력("PYTHON 네트워크 سەلماندن: UDP ckb")
finally:
    داخستن_تۆڕ(종단)
