"""свой ядро_ЗНАЧЕН MicroPython에서 사용하는 한글 ФУНКЦИЯ_ЗНАЧЕН Название."""
import jkoros as операционная_система
текстовыйВывод = print
чтение_файл = операционная_система.read
запись_файл = операционная_система.write
удалить_файл = операционная_система.remove
чтение_входные_данные = операционная_система.stdin
выписать_прямоугольник = операционная_система.rect
그림기다리기 = операционная_система.wait_key
밀리초 = операционная_система.ticks_ms
открыть_датаграмма = операционная_система.udp_open
написать_датаграмма = операционная_система.udp_send
написать_внешний_датаграмма = операционная_система.udp_sendto
получить_датаграмма = операционная_система.udp_recv
Close_сеть = операционная_система.udp_close

def 글해독(данные):
    return данные.decode("utf-8")
