"""자체 ядро_мән MicroPython에서 사용하는 한글 функция_мән Аты."""
import jkoros as операциялық_жүйе
Шығысы = print
파일읽기 = операциялық_жүйе.read
жазу_файл = операциялық_жүйе.write
жою_файл = операциялық_жүйе.remove
입력읽기 = операциялық_жүйе.stdin
Сурет_салу_тік_төртбұрыш = операциялық_жүйе.rect
그림기다리기 = операциялық_жүйе.wait_key
밀리초 = операциялық_жүйе.ticks_ms
전문통신열기 = операциялық_жүйе.udp_open
전문보내기 = операциялық_жүйе.udp_send
바깥전문보내기 = операциялық_жүйе.udp_sendto
전문받기 = операциялық_жүйе.udp_recv
Жабу_желі = операциялық_жүйе.udp_close

def 글해독(деректер):
    return деректер.decode("utf-8")
