#ifndef _include_संचार_पता_परिवर्तन_अष्टक_क्रम
#define _include_संचार_पता_परिवर्तन_अष्टक_क्रम

#include <अंतरजाल/पता.h>

#ifdef __cplusplus
extern "C" {
#endif
uint16_t _16_अंकों_को_संजाल_क्रम_में_बदलना(uint16_t यंत्र_क्रम_में_16_द्विआधारी_अंकों_का_मान);
uint16_t _16_अंकों_को_यंत्र_क्रम_में_बदलना(uint16_t जाल_क्रम_में_16_द्विआधारी_अंकों_का_मान);
uint32_t _32_अंकों_को_संजाल_क्रम_में_बदलना(uint32_t यंत्र_क्रम_में_32_द्विआधारी_अंकों_का_मान);
uint32_t _32_अंकों_को_यंत्र_क्रम_में_बदलना(uint32_t जाल_क्रम_में_32_द्विआधारी_अंकों_का_मान);
#ifdef __cplusplus
}
#endif

#endif
