"""자체 өзөк_маани MicroPython에서 사용하는 한글 функция_маани Аты."""
import jkoros as оперативдик_система
Чыгыш = print
파일읽기 = оперативдик_система.read
жазуу_файл = оперативдик_система.write
алып_салуу_файл = оперативдик_система.remove
입력읽기 = оперативдик_система.stdin
네모그리기 = оперативдик_система.rect
그림기다리기 = оперативдик_система.wait_key
밀리초 = оперативдик_система.ticks_ms
전문통신열기 = оперативдик_система.udp_open
전문보내기 = оперативдик_система.udp_send
바깥전문보내기 = оперативдик_система.udp_sendto
전문받기 = оперативдик_система.udp_recv
жабуу_Желе = оперативдик_система.udp_close

def 글해독(берилмелер):
    return берилмелер.decode("utf-8")
