#ifndef _せんげん_せいすうげんかい
#define _せんげん_せいすうげんかい
/* This package's compiler ABI is i386 ILP32 with signed plain char. */
#define はちけたぐみのにしんけたすう 8
#define ふごうつきもじせいすうさいしょうち (-128)
#define ふごうつきもじせいすうさいだいち 127
#define ふごうなしもじせいすうさいだいち 255
#define もじせいすうさいしょうち ふごうつきもじせいすうさいしょうち
#define もじせいすうさいだいち ふごうつきもじせいすうさいだいち
#define たんせいすうさいしょうち (-32767-1)
#define たんせいすうさいだいち 32767
#define ふごうなしたんせいすうさいだいち 65535
#define せいすうさいしょうち (-2147483647-1)
#define せいすうさいだいち 2147483647
#define ふごうなしせいすうさいだいち 4294967295U
#define ちょうせいすうさいしょうち (-2147483647L-1L)
#define ちょうせいすうさいだいち 2147483647L
#define ふごうなしちょうせいすうさいだいち 4294967295UL
#define ちょうちょうせいすうさいしょうち (-9223372036854775807LL-1LL)
#define ちょうちょうせいすうさいだいち 9223372036854775807LL
#define ふごうなしちょうちょうせいすうさいだいち 18446744073709551615ULL
#endif
