// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int маани) {
        if (маани < 0x80) 보드.직렬쓰기(маани);
        else if (маани < 0x800) {
            보드.직렬쓰기(0xc0 | (маани >> 6)); 보드.직렬쓰기(0x80 | (маани & 63));
        } else if (маани < 0x10000) {
            보드.직렬쓰기(0xe0 | (маани >> 12)); 보드.직렬쓰기(0x80 | ((маани >> 6) & 63)); 보드.직렬쓰기(0x80 | (маани & 63));
        } else {
            보드.직렬쓰기(0xf0 | (маани >> 18)); 보드.직렬쓰기(0x80 | ((маани >> 12) & 63));
            보드.직렬쓰기(0x80 | ((маани >> 6) & 63)); 보드.직렬쓰기(0x80 | (маани & 63));
        }
    }
    static void Жазуу(String Текст) {
        for (int индекс = 0; индекс < Текст.length(); индекс++) {
            int маани = Текст.charAt(индекс);
            if (маани >= 0xd800 && маани <= 0xdbff && индекс + 1 < Текст.length()) {
                int 아래 = Текст.charAt(индекс + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    маани = 0x10000 + ((маани - 0xd800) << 10) + 아래 - 0xdc00; индекс++;
                }
            }
            if (маани >= 0xd800 && маани <= 0xdfff) маани = 0xfffd;
            문자(маани);
        }
    }
    static void 수(int маани) {
        if (маани < 0) 문자('-'); else маани = -маани;
        int 자리 = 1000000000;
        boolean Жүргүзүү = false;
        while (자리 > 0) {
            int санарип_маани = -(маани / 자리);
            if (санарип_маани != 0 || Жүргүзүү || 자리 == 1) { 문자('0' + санарип_маани); Жүргүзүү = true; }
            маани %= 자리; 자리 /= 10;
        }
    }
}
