// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int મૂલ્ય) {
        if (મૂલ્ય < 0x80) બોર્ડ.직렬쓰기(મૂલ્ય);
        else if (મૂલ્ય < 0x800) {
            બોર્ડ.직렬쓰기(0xc0 | (મૂલ્ય >> 6)); બોર્ડ.직렬쓰기(0x80 | (મૂલ્ય & 63));
        } else if (મૂલ્ય < 0x10000) {
            બોર્ડ.직렬쓰기(0xe0 | (મૂલ્ય >> 12)); બોર્ડ.직렬쓰기(0x80 | ((મૂલ્ય >> 6) & 63)); બોર્ડ.직렬쓰기(0x80 | (મૂલ્ય & 63));
        } else {
            બોર્ડ.직렬쓰기(0xf0 | (મૂલ્ય >> 18)); બોર્ડ.직렬쓰기(0x80 | ((મૂલ્ય >> 12) & 63));
            બોર્ડ.직렬쓰기(0x80 | ((મૂલ્ય >> 6) & 63)); બોર્ડ.직렬쓰기(0x80 | (મૂલ્ય & 63));
        }
    }
    static void લખો(String લખાણ) {
        for (int અનુક્રમણિકા = 0; અનુક્રમણિકા < લખાણ.length(); અનુક્રમણિકા++) {
            int મૂલ્ય = લખાણ.charAt(અનુક્રમણિકા);
            if (મૂલ્ય >= 0xd800 && મૂલ્ય <= 0xdbff && અનુક્રમણિકા + 1 < લખાણ.length()) {
                int 아래 = લખાણ.charAt(અનુક્રમણિકા + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    મૂલ્ય = 0x10000 + ((મૂલ્ય - 0xd800) << 10) + 아래 - 0xdc00; અનુક્રમણિકા++;
                }
            }
            if (મૂલ્ય >= 0xd800 && મૂલ્ય <= 0xdfff) મૂલ્ય = 0xfffd;
            문자(મૂલ્ય);
        }
    }
    static void 수(int મૂલ્ય) {
        if (મૂલ્ય < 0) 문자('-'); else મૂલ્ય = -મૂલ્ય;
        int સ્થિતિ_અનુક્રમણિકા = 1000000000;
        boolean ચલાવો_2 = false;
        while (સ્થિતિ_અનુક્રમણિકા > 0) {
            int અંક_મૂલ્ય = -(મૂલ્ય / સ્થિતિ_અનુક્રમણિકા);
            if (અંક_મૂલ્ય != 0 || ચલાવો_2 || સ્થિતિ_અનુક્રમણિકા == 1) { 문자('0' + અંક_મૂલ્ય); ચલાવો_2 = true; }
            મૂલ્ય %= સ્થિતિ_અનુક્રમણિકા; સ્થિતિ_અનુક્રમણિકા /= 10;
        }
    }
}
