// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
/** 파이프는 16 KiB씩 순서대로 실행한다. 프로세스/동시 파이프를 흉내 내지 않는다. */
public final class 셸입출력 {
    static int[] 입력자료 = new int[16384], 출력자료 = new int[16384];
    static int 입력길이, 입력위치, 출력길이, 입력파일 = -1, 출력파일 = -1;
    static boolean 파이프입력, 파이프출력;
    static int ᎤᏄᎸᎲᎦ_ᏧᎬᏩᎶᏗᏯ;
    static boolean ᏗᎵᏍᎪᏟᏙᏗᎢ_ᏗᎵᎪᎲᏍᎩ = true;
    public static int 대화가능() { return ᏗᎵᏍᎪᏟᏙᏗᎢ_ᏗᎵᎪᎲᏍᎩ && 입력파일 < 3 && 출력파일 < 3 && !파이프입력 && !파이프출력 ? 1 : 0; }
    public static int 출력(int ᎦᎳᏅᏛ_ᏧᎬᏩᎶᏗᏯ, int ᏧᎬᏩᎶᏗᏯ) {
        if (ᎦᎳᏅᏛ_ᏧᎬᏩᎶᏗᏯ != 1) return 0;
        if (출력파일 >= 3) { int 처리값 = 기억파일.ᎪᏪᎶᏗ(출력파일, ᏧᎬᏩᎶᏗᏯ); if (처리값 < 0) ᎤᏄᎸᎲᎦ_ᏧᎬᏩᎶᏗᏯ = 처리값; return 1; }
        if (!파이프출력) return 0;
        if (출력길이 == 출력자료.length) ᎤᏄᎸᎲᎦ_ᏧᎬᏩᎶᏗᏯ = -28;
        else 출력자료[출력길이++] = ᏧᎬᏩᎶᏗᏯ;
        return 1;
    }
    public static int 입력() {
        if (입력파일 >= 3) { int 처리값 = 기억파일.읽기(입력파일); return 처리값 == 256 ? -2 : 처리값; }
        if (파이프입력) return 입력위치 < 입력길이 ? 입력자료[입력위치++] : -2;
        return -3; // UART로 ᏩᎦᏛᏗᏜ_ᏧᎬᏩᎶᏗᏯ
    }
    static void ᎠᎢᏎᏍᏗ(boolean 앞파이프, boolean 뒤파이프) {
        파이프입력 = 앞파이프; 파이프출력 = 뒤파이프;
        입력위치 = 0; 출력길이 = 0; 입력파일 = -1; 출력파일 = -1; ᎤᏄᎸᎲᎦ_ᏧᎬᏩᎶᏗᏯ = 0;
    }
    static void 끝() {
        보드.입출력전환(0);
        if (입력파일 >= 3) 기억파일.ᎯᏍᏚᎲᎦ(입력파일);
        if (출력파일 >= 3) 기억파일.ᎯᏍᏚᎲᎦ(출력파일);
        if (파이프출력) { 입력길이 = 출력길이; for (int ᎬᎪᏘᎶᏓ_ᏂᎬᎿᏅ_ᎠᏓᏎᎮᎯ = 0; ᎬᎪᏘᎶᏓ_ᏂᎬᎿᏅ_ᎠᏓᏎᎮᎯ < 출력길이; ᎬᎪᏘᎶᏓ_ᏂᎬᎿᏅ_ᎠᏓᏎᎮᎯ++) 입력자료[ᎬᎪᏘᎶᏓ_ᏂᎬᎿᏅ_ᎠᏓᏎᎮᎯ] = 출력자료[ᎬᎪᏘᎶᏓ_ᏂᎬᎿᏅ_ᎠᏓᏎᎮᎯ]; }
        입력파일 = -1; 출력파일 = -1; 파이프입력 = false; 파이프출력 = false;
    }
}
