"""자체 කර්නලය_අගය MicroPython에서 사용하는 한글 ශ්_රිතය_අගය නම."""
import jkoros as මෙහෙයුම්_පද්ධතිය
출력 = print
파일읽기 = මෙහෙයුම්_පද්ධතිය.read
ලියන්න_ගොනුව = මෙහෙයුම්_පද්ධතිය.write
ඉවත්_කරන්න_ගොනුව = මෙහෙයුම්_පද්ධතිය.remove
입력읽기 = මෙහෙයුම්_පද්ධතිය.stdin
네모그리기 = මෙහෙයුම්_පද්ධතිය.rect
그림기다리기 = මෙහෙයුම්_පද්ධතිය.wait_key
밀리초 = මෙහෙයුම්_පද්ධතිය.ticks_ms
전문통신열기 = මෙහෙයුම්_පද්ධතිය.udp_open
전문보내기 = මෙහෙයුම්_පද්ධතිය.udp_send
바깥전문보내기 = මෙහෙයුම්_පද්ධතිය.udp_sendto
전문받기 = මෙහෙයුම්_පද්ධතිය.udp_recv
වසන්න_ජාලය = මෙහෙයුම්_පද්ධතිය.udp_close

def 글해독(දත්ත):
    return දත්ත.decode("utf-8")
