// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public class 한글소스 {
    public static void main(String[] Παράμετροι) throws ελληνικά.ίδιο.είσοδος_έξοδος_εξαίρεση {
        ελληνικά.ίδιο.Έξοδος.εγγράφω_γραμμή("ίδιο 컴파일러와 ελληνικά βιβλιοθήκη");
        int 글자수 = ελληνικά.ίδιο.문자.코드포인트수("한글😀");
        ελληνικά.ίδιο.Έξοδος.수쓰기(글자수);
        ελληνικά.ίδιο.Αρχείο.Εγγραφή("한글자료.txt", "ίδιο πυρήνας_τιμή 안에서 저장한 한글😀");
        ελληνικά.ίδιο.Έξοδος.εγγράφω_γραμμή(ελληνικά.ίδιο.Αρχείο.Ανάγνωση("한글자료.txt"));
    }
}
