#include "예제규약.h"
#include <통신규약.h>
int main(int 인수수,char **ئۆزگەرگۈچىلەر) {
    if(인수수!=2)return چىقار("사용법: ./네트워크 UDP창구번호\n");
    unsigned ئېغىز_قىممىتى=0;for(int 수=0;ئۆزگەرگۈچىلەر[1][수];수++) {
        if(ئۆزگەرگۈچىلەر[1][수]<'0'||ئۆزگەرگۈچىلەر[1][수]>'9')return 2;
        ئېغىز_قىممىتى=ئېغىز_قىممىتى*10+ئۆزگەرگۈچىلەر[1][수]-'0';if(ئېغىز_قىممىتى>65535)return 2;
    }
    if(!ئېغىز_قىممىتى)return 2;
    int 종단=통신종단점만들기(بۇلۇت_ئائىلە,전문통신,전문전송규약);if(종단<0)return 3;
    struct 인터넷통신주소 ئادرېس={0};ئادرېس.ئادرېس_ئائىلە=بۇلۇت_ئائىلە;
    if(باغلاش_ئادرېس(종단,(struct 통신주소 *)&ئادرېس,sizeof(ئادرېس))<0)return 4;
    ئادرېس.접속번호=망차례짧은수(ئېغىز_قىممىتى);ئادرېس.ئىنتېرنېت_ئادرېسى.ئادرېس_قىممىتى=تور_پۈتۈن_سان(0x0a000202);
    const char 전문[]="C UDP ug";
    if(자료전문보내기(종단,전문,sizeof(전문)-1,0,(struct 통신주소 *)&ئادرېس,sizeof(ئادرېس))!=sizeof(전문)-1)return 5;
    char جاۋابلاش[512];unsigned ئىجرا_قىل_2=밀리초();int 받은수;
    do {
        받은수=자료전문받기(종단,جاۋابلاش,sizeof(جاۋابلاش),0,0,0);
        if(받은수<0&&오류번호!=다시시도오류)return 6;
    } while(받은수<0&&(unsigned)(밀리초()-ئىجرا_قىل_2)<700);
    ئاياغ_ھۆججەت(종단);if(받은수!=sizeof(전문)-1)return 7;
    for(int 수=0;수<받은수;수++)if(전문[수]!=جاۋابلاش[수])return 8;
    return چىقار("C 네트워크 دەلىللىمەك: UDP ug\n");
}
