package 팻

import . "util"
import . "콘솔"
import . "드라이버/ata"
import . "파일시스템/msdospart"
import . "메모리매니저"

type T비아이오에스피에이알에이엠이티이알블록32 struct {
	제이엠피			[3]uint8
	에스오에프티네임		[8]byte
	비와이티이에스피이알에스이시티오알	uint16
	에스이시티오알에스피이알시엘유에스티이알	uint8
	알이에스이알브이이디에스이시티오알에스	uint16
	팻시오피아이이에스		uint8
	알오오티디아이알이엔티알아이이에스	uint16
	티오티에이엘에스이시티오알에스		uint16
	엠이디아이에이티와이피이		uint8
	팻에스이시티오알카운트		uint16
	에스이시티오알피이알티알에이시케이	uint16
	에이치이에이디카운트		uint16
	에이치아이디디이엔에스이시티오알에스	uint32
	티오티에이엘에스이시티오알카운트	uint32

	테이블사이즈			uint32
	이엑스티에프엘에이지에스		uint16
	팻브이이알에스아이오엔		uint16
	알오오티시엘유에스티이알		uint32
	팻아이엔에프오			uint16
	비에이시케이유피에스이시티오알		uint16
	알이에스이알브이이디0		[12]uint8
	디알아이브이이엔유엠비이알		uint8
	알이에스이알브이이디		uint8
	비오오티에스아이지엔에이티유알이	uint8
	브이오엘유엠이아이디		uint32
	브이오엘유엠이엘에이비이엘		[11]byte
	팻티와이피이엘에이비이엘		[8]byte
}

func (셀프 *T비아이오에스피에이알에이엠이티이알블록32) I이닛(데이터 []byte) {
	copy(셀프.제이엠피[:3], 데이터[0:3])
	copy(셀프.에스오에프티네임[:8], 데이터[3:11])

	셀프.비와이티이에스피이알에스이시티오알 = (uint16(데이터[11]) | uint16(데이터[12])<<8)
	셀프.에스이시티오알에스피이알시엘유에스티이알 = 데이터[13]
	셀프.알이에스이알브이이디에스이시티오알에스 = (uint16(데이터[14]) | uint16(데이터[15])<<8)
	셀프.팻시오피아이이에스 = 데이터[16]
	셀프.알오오티디아이알이엔티알아이이에스 = (uint16(데이터[17]) | uint16(데이터[18])<<8)
	셀프.티오티에이엘에스이시티오알에스 = (uint16(데이터[19]) | uint16(데이터[20])<<8)
	셀프.엠이디아이에이티와이피이 = 데이터[21]
	셀프.팻에스이시티오알카운트 = (uint16(데이터[22]) | uint16(데이터[23])<<8)
	셀프.에스이시티오알피이알티알에이시케이 = (uint16(데이터[24]) | uint16(데이터[25])<<8)
	셀프.에이치이에이디카운트 = (uint16(데이터[26]) | uint16(데이터[27])<<8)

	var 비유에프1 [4]byte
	copy(비유에프1[:4], 데이터[28:32])
	셀프.에이치아이디디이엔에스이시티오알에스 = U유아이엔티32알(A어레이티오유아이엔티32(비유에프1))

	copy(비유에프1[:4], 데이터[32:36])
	셀프.티오티에이엘에스이시티오알카운트 = U유아이엔티32알(A어레이티오유아이엔티32(비유에프1))

	copy(비유에프1[:4], 데이터[36:40])
	셀프.테이블사이즈 = U유아이엔티32알(A어레이티오유아이엔티32(비유에프1))

	셀프.이엑스티에프엘에이지에스 = (uint16(데이터[40]) | uint16(데이터[41])<<8)
	셀프.팻브이이알에스아이오엔 = (uint16(데이터[42]) | uint16(데이터[43])<<8)

	copy(비유에프1[:4], 데이터[44:48])
	셀프.알오오티시엘유에스티이알 = U유아이엔티32알(A어레이티오유아이엔티32(비유에프1))

	셀프.팻아이엔에프오 = (uint16(데이터[48]) | uint16(데이터[49])<<8)
	셀프.비에이시케이유피에스이시티오알 = (uint16(데이터[50]) | uint16(데이터[51])<<8)

	copy(셀프.알이에스이알브이이디0[:12], 데이터[52:64])

	셀프.디알아이브이이엔유엠비이알 = 데이터[64]
	셀프.알이에스이알브이이디 = 데이터[65]
	셀프.비오오티에스아이지엔에이티유알이 = 데이터[66]

	copy(비유에프1[:4], 데이터[67:71])
	셀프.브이오엘유엠이아이디 = U유아이엔티32알(A어레이티오유아이엔티32(비유에프1))

	copy(셀프.브이오엘유엠이엘에이비이엘[:11], 데이터[71:82])
	copy(셀프.팻티와이피이엘에이비이엘[:8], 데이터[82:90])

}

var 콘솔_이름 = T콘솔{}

func (셀프 *T비아이오에스피에이알에이엠이티이알블록32) Len(에이치디 *T에이디브이에이엔시이디티이시에이치엔오엘오지와이에이티티에이시에이치엠이엔티, 피에이알티엔트리 T피에이알티아이티아이오엔테이블엔트리, 에프아이엘이엔에이엠이 []byte) uint32 {

	if 피에이알티엔트리.P피에이알티아이티아이오엔아이디 == 0x00 {
		return 0
	}

	메모리매니저 := T메모리매니저{}
	비피비피티알 := 메모리매니저.M엠에이엘엘오시(90)
	비피비비와이티이에스 := G겟비와이티이에스에프알오엠피티알(uintptr(비피비피티알), 90, 90)
	var 피에이알티아이티아이오엔오에프에프에스이티 = 피에이알티엔트리.S에스티에이알티엘비에이

	에이치디.R리드28(피에이알티아이티아이오엔오에프에프에스이티, &비피비비와이티이에스, 90)

	var 비피비 = T비아이오에스피에이알에이엠이티이알블록32{}
	비피비.I이닛(비피비비와이티이에스)

	var 팻에스티에이알티 = 피에이알티아이티아이오엔오에프에프에스이티 + uint32(비피비.알이에스이알브이이디에스이시티오알에스)
	var 팻사이즈 = 비피비.테이블사이즈

	var 데이터에스티에이알티 = 팻에스티에이알티 + 팻사이즈*uint32(비피비.팻시오피아이이에스)

	var 알오오티에스티에이알티 = 데이터에스티에이알티 + uint32(비피비.에스이시티오알에스피이알시엘유에스티이알)*(비피비.알오오티시엘유에스티이알-2)

	디아이알이엔티피티알 := 메모리매니저.M엠에이엘엘오시(512)
	디아이알이엔티비와이티이에스 := G겟비와이티이에스에프알오엠피티알(uintptr(디아이알이엔티피티알), 512, 512)
	에이치디.R리드28(알오오티에스티에이알티, &디아이알이엔티비와이티이에스, 512)

	var 디아이알이엔티 = [16]T디렉터리엔트리팻32{}

	for 아이 := 0; 아이 < 16; 아이++ {

		var 비유에프3 [32]byte
		copy(비유에프3[:32], 디아이알이엔티비와이티이에스[아이*32:(아이+1)*32])
		디아이알이엔티[아이].I이닛(비유에프3)

		if 디아이알이엔티[아이].네임[0] == 0x00 {
			break
		}

		if 디아이알이엔티[아이].사이즈 >= 0xFFFFFFFF {
			continue
		}

		if !E이큐유에이엘비와이티이에스(에프아이엘이엔에이엠이, 디아이알이엔티[아이].네임[:len(에프아이엘이엔에이엠이)]) {
			continue
		}

		메모리매니저.F프리(비피비피티알)
		메모리매니저.F프리(디아이알이엔티피티알)
		return 디아이알이엔티[아이].사이즈
	}
	메모리매니저.F프리(비피비피티알)
	메모리매니저.F프리(디아이알이엔티피티알)
	return 0
}
func (셀프 *T비아이오에스피에이알에이엠이티이알블록32) R리드(에이치디 *T에이디브이에이엔시이디티이시에이치엔오엘오지와이에이티티에이시에이치엠이엔티, 피에이알티엔트리 T피에이알티아이티아이오엔테이블엔트리, 에프아이엘이엔에이엠이 []byte, 데이터 []byte) {

	if 피에이알티엔트리.P피에이알티아이티아이오엔아이디 == 0x00 {
		return
	}

	메모리매니저 := T메모리매니저{}
	비피비피티알 := 메모리매니저.M엠에이엘엘오시(90)
	비피비비와이티이에스 := G겟비와이티이에스에프알오엠피티알(uintptr(비피비피티알), 90, 90)
	var 피에이알티아이티아이오엔오에프에프에스이티 = 피에이알티엔트리.S에스티에이알티엘비에이

	에이치디.R리드28(피에이알티아이티아이오엔오에프에프에스이티, &비피비비와이티이에스, 90)

	var 비피비 = T비아이오에스피에이알에이엠이티이알블록32{}
	비피비.I이닛(비피비비와이티이에스)

	var 팻에스티에이알티 = 피에이알티아이티아이오엔오에프에프에스이티 + uint32(비피비.알이에스이알브이이디에스이시티오알에스)
	var 팻사이즈 = 비피비.테이블사이즈

	var 데이터에스티에이알티 = 팻에스티에이알티 + 팻사이즈*uint32(비피비.팻시오피아이이에스)

	var 알오오티에스티에이알티 = 데이터에스티에이알티 + uint32(비피비.에스이시티오알에스피이알시엘유에스티이알)*(비피비.알오오티시엘유에스티이알-2)

	디아이알이엔티피티알 := 메모리매니저.M엠에이엘엘오시(512)
	디아이알이엔티비와이티이에스 := G겟비와이티이에스에프알오엠피티알(uintptr(디아이알이엔티피티알), 512, 512)
	에이치디.R리드28(알오오티에스티에이알티, &디아이알이엔티비와이티이에스, 512)

	var 디아이알이엔티 = [16]T디렉터리엔트리팻32{}

	for 아이 := 0; 아이 < 16; 아이++ {

		var 비유에프3 [32]byte
		copy(비유에프3[:32], 디아이알이엔티비와이티이에스[아이*32:(아이+1)*32])
		디아이알이엔티[아이].I이닛(비유에프3)

		if 디아이알이엔티[아이].네임[0] == 0x00 {
			break
		}

		if 디아이알이엔티[아이].사이즈 >= 0xFFFFFFFF {
			continue
		}

		if !E이큐유에이엘비와이티이에스(에프아이엘이엔에이엠이, 디아이알이엔티[아이].네임[:len(에프아이엘이엔에이엠이)]) {
			continue
		}

		var 에프아이알에스티파일시엘유에스티이알 = (uint32(디아이알이엔티[아이].에프아이알에스티시엘유에스티이알에이치아이)<<16 | uint32(디아이알이엔티[아이].에프아이알에스티시엘유에스티이알엘오더블유))

		var S사이즈 = int32(디아이알이엔티[아이].사이즈)
		var 엔이엑스티파일시엘유에스티이알 = int32(에프아이알에스티파일시엘유에스티이알)
		var 버퍼 [513]byte
		var 에프에이티비유에프에프이알 [513]byte

		for S사이즈 > 0 {
			var 파일에스이시티오알 = 데이터에스티에이알티 + uint32(비피비.에스이시티오알에스피이알시엘유에스티이알)*uint32(엔이엑스티파일시엘유에스티이알-2)
			var 에스이시티오알오에프에프에스이티 int = 0

			for ; S사이즈 > 0; S사이즈 -= 512 {

				var 비유에프3 []byte

				if 디아이알이엔티[아이].사이즈 > 512 {
					비유에프3 = 버퍼[:512]
					에이치디.R리드28(파일에스이시티오알+uint32(에스이시티오알오에프에프에스이티), &비유에프3, 512)

				} else {
					비유에프3 = 버퍼[:디아이알이엔티[아이].사이즈]
					에이치디.R리드28(파일에스이시티오알+uint32(에스이시티오알오에프에프에스이티), &비유에프3, int(디아이알이엔티[아이].사이즈))
				}

				copy(데이터[int32(디아이알이엔티[아이].사이즈)-S사이즈:], 비유에프3)

				에스이시티오알오에프에프에스이티++

				if 에스이시티오알오에프에프에스이티 > int(비피비.에스이시티오알에스피이알시엘유에스티이알) {
					break
				}

			}

			var 팻에스이시티오알에프오알커런트시엘유에스티이알 = uint32(엔이엑스티파일시엘유에스티이알 / 128)
			var 에프에이티비유에프 = 에프에이티비유에프에프이알[:512]
			에이치디.R리드28(팻에스티에이알티+팻에스이시티오알에프오알커런트시엘유에스티이알, &에프에이티비유에프, 512)

			var 팻오에프에프에스이티아이엔에스이시티오알에프오알커런트시엘유에스티이알 = 엔이엑스티파일시엘유에스티이알 % 128
			var 에스티에이알티오에프에프에스이티 = 팻오에프에프에스이티아이엔에스이시티오알에프오알커런트시엘유에스티이알 * 4
			var 이엔디오에프에프에스이티 = 팻오에프에프에스이티아이엔에스이시티오알에프오알커런트시엘유에스티이알*4 + 4

			var 비유에프4 [4]byte
			copy(비유에프4[:4], 에프에이티비유에프에프이알[에스티에이알티오에프에프에스이티:이엔디오에프에프에스이티])

			엔이엑스티파일시엘유에스티이알 = int32(U유아이엔티32알(A어레이티오유아이엔티32(비유에프4)))
		}
	}
	메모리매니저.F프리(비피비피티알)
	메모리매니저.F프리(디아이알이엔티피티알)
}

type T디렉터리엔트리팻32 struct {
	네임			[8]byte
	이엑스티			[3]byte
	에이티티알아이비유티이에스		uint8
	알이에스이알브이이디		uint8
	시티아이엠이티이엔티에이치		uint8
	시티아이엠이			uint16
	시디에이티이			uint16
	에이티아이엠이			uint16
	에프아이알에스티시엘유에스티이알에이치아이	uint16
	더블유티아이엠이		uint16
	더블유디에이티이		uint16
	에프아이알에스티시엘유에스티이알엘오더블유	uint16
	사이즈			uint32
}

func (셀프 *T디렉터리엔트리팻32) I이닛(데이터 [32]byte) {
	copy(셀프.네임[:8], 데이터[0:8])
	copy(셀프.이엑스티[:3], 데이터[8:11])
	셀프.에이티티알아이비유티이에스 = 데이터[11]
	셀프.알이에스이알브이이디 = 데이터[12]
	셀프.시티아이엠이티이엔티에이치 = 데이터[13]
	셀프.시티아이엠이 = uint16(데이터[14]) | uint16(데이터[15])<<8
	셀프.시디에이티이 = uint16(데이터[16]) | uint16(데이터[17])<<8
	셀프.에이티아이엠이 = uint16(데이터[18]) | uint16(데이터[19])<<8
	셀프.에프아이알에스티시엘유에스티이알에이치아이 = uint16(데이터[20]) | uint16(데이터[21])<<8
	셀프.더블유티아이엠이 = uint16(데이터[22]) | uint16(데이터[23])<<8
	셀프.더블유디에이티이 = uint16(데이터[24]) | uint16(데이터[25])<<8
	셀프.에프아이알에스티시엘유에스티이알엘오더블유 = uint16(데이터[26]) | uint16(데이터[27])<<8

	var 비유에프 [4]byte
	copy(비유에프[:4], 데이터[28:32])
	셀프.사이즈 = U유아이엔티32알(A어레이티오유아이엔티32(비유에프))
}
