package 단말

import . "unsafe"

const (
	화면너비			= 80
	화면높이			= 25
	화면물리주소	uintptr	= 0xb8000
)

type T단말 struct {
	x위치	uint16
	y위치	uint16
}

var 직렬준비 bool

func F직렬접속초기화()
func F직렬접속에바이트쓰기(자료 uint8)

func F직렬기록초기화() {
	F직렬접속초기화()
	직렬준비 = true
}

func 직렬기록바이트(자료 byte) {
	if !직렬준비 {
		return
	}

	if 자료 == '\n' {
		F직렬접속에바이트쓰기('\r')
	}
	F직렬접속에바이트쓰기(uint8(자료))
}

func F긴급문자열기록(자료 string) {
	for i := 0; i < len(자료); i++ {
		직렬기록바이트(자료[i])
	}
}

func F긴급8비트16진수기록(자료 uint8) {
	const 숫자들 = "0123456789ABCDEF"
	직렬기록바이트(숫자들[(자료>>4)&0x0F])
	직렬기록바이트(숫자들[자료&0x0F])
}

func F긴급정수32기록(자료 uint32) {
	F긴급8비트16진수기록(uint8(자료 >> 24))
	F긴급8비트16진수기록(uint8(자료 >> 16))
	F긴급8비트16진수기록(uint8(자료 >> 8))
	F긴급8비트16진수기록(uint8(자료))
}

func (자신 *T단말) M출력(인자값 ...interface{}) {
	var x uint16 = 1000
	var y uint16 = 1000
	var 값_3 interface{}

	for i, p := range 인자값 {
		switch i {
		case 0:
			매개값, _ := p.(interface{})
			값_3 = 매개값
		case 1:
			switch p.(type) {
			case uint16:
				매개값, _ := p.(uint16)
				x = 매개값
			case int:
				매개값, _ := p.(int)
				x = uint16(매개값)
			}
		case 2:
			switch p.(type) {
			case uint16:
				매개값, _ := p.(uint16)
				y = 매개값
			case int:
				매개값, _ := p.(int)
				y = uint16(매개값)
			}
		}
	}

	자신.M지정좌표에출력(값_3, x, y)

}
func (자신 *T단말) M지정좌표에출력(임시_2 interface{}, x uint16, y uint16) {

	switch 임시_2.(type) {
	case string:
		자료_2, _ := 임시_2.(string)
		자신.M지정좌표에바이트출력(([]byte)(자료_2), x, y)
	case uint8:
		자료_2, _ := 임시_2.(uint8)
		자신.M지정좌표에16진수출력(자료_2, x, y)
	case uint16:
		자료_2, _ := 임시_2.(uint16)
		자신.M지정좌표에정수16출력(자료_2, x, y)
	case uint32:
		자료_2, _ := 임시_2.(uint32)
		자신.M지정좌표에정수32출력(자료_2, x, y)
	case uint64:
		자료_2, _ := 임시_2.(uint64)
		자신.M지정좌표에정수64출력(자료_2, x, y)
	default:
		자료_2, _ := 임시_2.([]byte)
		자신.M지정좌표에바이트출력(자료_2, x, y)
	}

}
func (자신 *T단말) M지정좌표에바이트출력(임시공간 []byte, x uint16, y uint16) {

	if x <= 999 {
		자신.x위치 = x
	}
	if y <= 999 {
		자신.y위치 = y
	}

	속성 := uint16(0x0F)
	제한 := len(임시공간)
	if 제한 > 4096 {
		제한 = 4096
	}
	for i := 0; i < 제한; i++ {
		직렬기록바이트(임시공간[i])
		switch 임시공간[i] {
		case '\n':
			자신.y위치++
			자신.x위치 = 0
		default:
			*(*uint16)(Pointer(화면물리주소 + uintptr((80*자신.y위치+자신.x위치)*2))) = 속성<<8 | uint16(임시공간[i])
			자신.x위치++
		}

		if 자신.x위치 >= 80 {
			자신.y위치++
			자신.x위치 = 0
		}

		if 자신.y위치 >= 25 {
			for 자신.y위치 = 0; 자신.y위치 < 25; 자신.y위치++ {
				for 자신.x위치 = 0; 자신.x위치 < 80; 자신.x위치++ {
					*(*uint16)(Pointer(화면물리주소 + uintptr((80*자신.y위치+자신.x위치)*2))) = 속성<<8 | ' '
				}
			}
			자신.x위치 = 0
			자신.y위치 = 0
		}

	}

}
func (자신 *T단말) M16진수출력(키 uint8) {
	임시공간 := []byte{'0', '0'}
	값16진수 := [16]byte{'0', '1', '2', '3',
		'4', '5', '6', '7',
		'8', '9', 'A', 'B',
		'C', 'D', 'E', 'F'}
	임시공간[0] = 값16진수[(키>>4)&0xF]
	임시공간[1] = 값16진수[키&0xF]
	자신.M출력(임시공간)
}
func (자신 *T단말) M지정좌표에16진수출력(키 uint8, x uint16, y uint16) {
	임시공간 := []byte{'0', '0', 0}
	값16진수 := [16]byte{'0', '1', '2', '3',
		'4', '5', '6', '7',
		'8', '9', 'A', 'B',
		'C', 'D', 'E', 'F'}
	임시공간[0] = 값16진수[(키>>4)&0xF]
	임시공간[1] = 값16진수[키&0xF]
	자신.M지정좌표에출력(임시공간, x, y)
}
func (자신 *T단말) M부호없음정수16출력(키 uint16) {
	자신.M16진수출력(uint8(키 >> 8))
	자신.M16진수출력(uint8(키))
}
func (자신 *T단말) M지정좌표에정수16출력(키 uint16, x uint16, y uint16) {
	자신.M지정좌표에16진수출력(uint8(키>>8), x, y)
	자신.M지정좌표에16진수출력(uint8(키), x, y)
}
func (자신 *T단말) M부호없음정수32출력(자료 uint32) {
	자신.M16진수출력(uint8(자료 >> 24))
	자신.M16진수출력(uint8(자료 >> 16))
	자신.M16진수출력(uint8(자료 >> 8))
	자신.M16진수출력(uint8(자료))
}
func (자신 *T단말) M지정좌표에정수32출력(자료 uint32, x uint16, y uint16) {

	자신.M지정좌표에16진수출력(uint8(자료>>24), x+0, y)
	자신.M지정좌표에16진수출력(uint8(자료>>16), x+2, y)
	자신.M지정좌표에16진수출력(uint8(자료>>8), x+4, y)
	자신.M지정좌표에16진수출력(uint8(자료), x+6, y)
}
func (자신 *T단말) M부호없음정수64출력(자료 uint64) {
	자신.M16진수출력(uint8(자료 >> 56))
	자신.M16진수출력(uint8(자료 >> 48))
	자신.M16진수출력(uint8(자료 >> 40))
	자신.M16진수출력(uint8(자료 >> 32))
	자신.M16진수출력(uint8(자료 >> 24))
	자신.M16진수출력(uint8(자료 >> 16))
	자신.M16진수출력(uint8(자료 >> 8))
	자신.M16진수출력(uint8(자료))
}
func (자신 *T단말) M지정좌표에정수64출력(자료 uint64, x uint16, y uint16) {
	자신.M지정좌표에16진수출력(uint8(자료>>56), x+0, y)
	자신.M지정좌표에16진수출력(uint8(자료>>48), x+2, y)
	자신.M지정좌표에16진수출력(uint8(자료>>40), x+4, y)
	자신.M지정좌표에16진수출력(uint8(자료>>32), x+6, y)
	자신.M지정좌표에16진수출력(uint8(자료>>24), x+8, y)
	자신.M지정좌표에16진수출력(uint8(자료>>16), x+10, y)
	자신.M지정좌표에16진수출력(uint8(자료>>8), x+12, y)
	자신.M지정좌표에16진수출력(uint8(자료), x+14, y)
}
func M출력(phyaddr uintptr, 자료 uint8, x uint32, y uint32)

func (자신 *T단말) M화면에16진수출력(자료 uint8, x uint32, y uint32) {
	임시공간 := []byte{'0', '0'}
	값16진수 := [16]byte{'0', '1', '2', '3',
		'4', '5', '6', '7',
		'8', '9', 'A', 'B',
		'C', 'D', 'E', 'F'}
	임시공간[0] = 값16진수[(자료>>4)&0xF]
	임시공간[1] = 값16진수[자료&0xF]

	M출력(uintptr(화면물리주소), 임시공간[0], x, y)
	M출력(uintptr(화면물리주소), 임시공간[1], x+2, y)
}

func (자신 *T단말) M출력부호없음정수16(자료 uint16, x uint32, y uint32) {
	자신.M화면에16진수출력(uint8(자료>>8), x+0*2, y)
	자신.M화면에16진수출력(uint8(자료), x+2*2, y)
}

func (자신 *T단말) M출력부호없음정수32(자료 uint32, x uint32, y uint32) {
	x = x * 2
	자신.M화면에16진수출력(uint8(자료>>24), x+0*2, y)
	자신.M화면에16진수출력(uint8(자료>>16), x+2*2, y)
	자신.M화면에16진수출력(uint8(자료>>8), x+4*2, y)
	자신.M화면에16진수출력(uint8(자료), x+6*2, y)
}

func (자신 *T단말) M시험() {
}
