// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
/** PC/AT PS/2 ПЕРЕВОД_источник 집합 1 폴링 входные_данные_ЗНАЧЕН. значение_по_умолчанию 미국식 자판, Shift, Backspace, Enter. */
public final class клавиатура {
    static boolean сдвигать_ЛЕВСИМВ = false;
    static boolean сдвигать_право = false;
    static boolean расширение_ЗНАЧЕН = false;
    static String значение_по_умолчанию = "\0\0" + "1234567890-=\b\tqwertyuiop[]\n\0asdfghjkl;'`\0\\zxcvbnm,./\0*\0 ";
    static String сдвигать_ЗНАЧЕН = "\0\0" + "!@#$%^&*()_+\b\tQWERTYUIOP{}\n\0ASDFGHJKL:\"~\0|ZXCVBNM<>?\0*\0 ";

    static int Чтение() {
        int Состояние_ЗНАЧЕН = устройство_ЗНАЧЕН.입출력바이트읽기(0x64);
        if ((Состояние_ЗНАЧЕН & 1) == 0) return -1;
        int ЗНАЧЕН = устройство_ЗНАЧЕН.입출력바이트읽기(0x60);
        if ((Состояние_ЗНАЧЕН & 0x20) != 0) return -1;
        if (ЗНАЧЕН == 0xe0 || ЗНАЧЕН == 0xe1) { расширение_ЗНАЧЕН = true; return -1; }
        if (расширение_ЗНАЧЕН) { расширение_ЗНАЧЕН = false; return -1; }
        if (ЗНАЧЕН == 42 || ЗНАЧЕН == 170) { сдвигать_ЛЕВСИМВ = ЗНАЧЕН == 42; return -1; }
        if (ЗНАЧЕН == 54 || ЗНАЧЕН == 182) { сдвигать_право = ЗНАЧЕН == 54; return -1; }
        if (ЗНАЧЕН >= значение_по_умолчанию.length()) return -1;
        int 문자 = (сдвигать_ЛЕВСИМВ || сдвигать_право) ? сдвигать_ЗНАЧЕН.charAt(ЗНАЧЕН) : значение_по_умолчанию.charAt(ЗНАЧЕН);
        return 문자 == 0 ? -1 : 문자;
    }
}
