#ifndef 자체사용자머리
#define 자체사용자머리
#include <stdint.h>
#include <stddef.h>
#define 사용자바탕 0x02000000ul
#define користувач_фото_завершити_виклик 0x02c00000ul
#define користувач_динамічна_пам_ять_завершити_виклик 0x02ed0000ul
#define користувач_Стіс_адреса 0x02f00000ul
#define користувач_завершити_виклик 0x03000000ul
#define 사용자쪽수 ((користувач_завершити_виклик - 사용자바탕) / 4096ul)
#define 사용자실행파일오류 (-8)
#define користувач_дані_помилка (-1001)
#define 사용자실행오류 (-1002)
#define 사용자잘못된명령 (-1003)
#define 사용자시간초과 (-1004)
#define 사용자중단됨 (-1005)
typedef struct { uint64_t реєстр_дані[31], команда_посада, Стан_код, Стіс_адреса; } користувач_кадр;
void 사용자체계준비(void);
int виняток_режиму_користувача(користувач_кадр *, unsigned);
int 사용자실행파일검사(const unsigned char *, size_t);
uintptr_t Дошка_користувач_запускати(uintptr_t);
uintptr_t Дошка_користувач_затвердити(void);
uintptr_t Дошка_користувацький_елемент_керування(uintptr_t);
uint32_t 사용자상태읽기(unsigned, unsigned);
#endif
