"""자체 ಕರ್ನಲ್_ಮೌಲ್ಯ MicroPython에서 사용하는 한글 ಕಾರ್ಯ_ಮೌಲ್ಯ ಹೆಸರು."""
import jkoros as ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ
ಔಟ್_ಪುಟ್ = print
파일읽기 = ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ.read
ಬರೆ_ಫೈಲ್ = ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ.write
ತೆಗೆ_ಫೈಲ್ = ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ.remove
입력읽기 = ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ.stdin
네모그리기 = ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ.rect
그림기다리기 = ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ.wait_key
밀리초 = ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ.ticks_ms
전문통신열기 = ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ.udp_open
전문보내기 = ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ.udp_send
바깥전문보내기 = ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ.udp_sendto
전문받기 = ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ.udp_recv
ಮುಚ್ಚು_ನೆಟ್_ವರ್ಕ್ = ಆಪರೇಟಿಂಗ್_ಸಿಸ್ಟಂ.udp_close

def 글해독(ಡೇಟಾ):
    return ಡೇಟಾ.decode("utf-8")
