"""자체 ҳаста_қимат MicroPython에서 사용하는 한글 функсия_қимат Ном."""
import jkoros as системаи_омил
출력 = print
파일읽기 = системаи_омил.read
навиштан_файл = системаи_омил.write
тоза_кардан_файл = системаи_омил.remove
입력읽기 = системаи_омил.stdin
네모그리기 = системаи_омил.rect
그림기다리기 = системаи_омил.wait_key
밀리초 = системаи_омил.ticks_ms
전문통신열기 = системаи_омил.udp_open
전문보내기 = системаи_омил.udp_send
바깥전문보내기 = системаи_омил.udp_sendto
전문받기 = системаи_омил.udp_recv
пӯшидан_Шабака = системаи_омил.udp_close

def 글해독(иттилоот):
    return иттилоот.decode("utf-8")
