#include "예제규약.h"
#include <통신규약.h>
int main(int 인수수,char **인수) {
    if(인수수!=2)return ନିର୍ଗମ("사용법: ./네트워크 UDP창구번호\n");
    unsigned ପୋର୍ଟ_ମୂଲ୍ୟ=0;for(int 수=0;인수[1][수];수++) {
        if(인수[1][수]<'0'||인수[1][수]>'9')return 2;
        ପୋର୍ଟ_ମୂଲ୍ୟ=ପୋର୍ଟ_ମୂଲ୍ୟ*10+인수[1][수]-'0';if(ପୋର୍ଟ_ମୂଲ୍ୟ>65535)return 2;
    }
    if(!ପୋର୍ଟ_ମୂଲ୍ୟ)return 2;
    int 종단=통신종단점만들기(କ୍ଲାଉଡ୍_ପରିବାର,전문통신,전문전송규약);if(종단<0)return 3;
    struct 인터넷통신주소 ଠିକଣା={0};ଠିକଣା.ଠିକଣା_ପରିବାର=କ୍ଲାଉଡ୍_ପରିବାର;
    if(ବନ୍ଧନ_ଠିକଣା(종단,(struct 통신주소 *)&ଠିକଣା,sizeof(ଠିକଣା))<0)return 4;
    ଠିକଣା.ପୋର୍ଟ୍_ନମ୍ଵର୍=망차례짧은수(ପୋର୍ଟ_ମୂଲ୍ୟ);ଠିକଣା.ଇଣ୍ଟର୍ନେଟ୍_ଠିକଣା.ଠିକଣା_ମୂଲ୍ୟ=ନେଟ୍_ୱାର୍କ୍_ଇଣ୍ଟିଜର(0x0a000202);
    const char 전문[]="C UDP or";
    if(자료전문보내기(종단,전문,sizeof(전문)-1,0,(struct 통신주소 *)&ଠିକଣା,sizeof(ଠିକଣା))!=sizeof(전문)-1)return 5;
    char ପ୍ରତ୍ୟୁତ୍ତର_କରନ୍ତୁ[512];unsigned ଚଳାନ୍ତୁ=밀리초();int 받은수;
    do {
        받은수=자료전문받기(종단,ପ୍ରତ୍ୟୁତ୍ତର_କରନ୍ତୁ,sizeof(ପ୍ରତ୍ୟୁତ୍ତର_କରନ୍ତୁ),0,0,0);
        if(받은수<0&&오류번호!=다시시도오류)return 6;
    } while(받은수<0&&(unsigned)(밀리초()-ଚଳାନ୍ତୁ)<700);
    ବନ୍ଦ_ଫାଇଲ୍(종단);if(받은수!=sizeof(전문)-1)return 7;
    for(int 수=0;수<받은수;수++)if(전문[수]!=ପ୍ରତ୍ୟୁତ୍ତର_କରନ୍ତୁ[수])return 8;
    return ନିର୍ଗମ("C 네트워크 ଯାଞ୍ଚ୍_କରିବା: UDP or\n");
}
