#include "예제규약.h"
int main(void) {
    const char ଡାଟା[]="C ଫାଇଲ: or 😀\n";
    int ଫାଇଲ=ଖୋଲିବା_ଫାଇଲ୍("c.txt",ପଢିବା_ଲେଖିବା|없으면만들기|내용비우기,0600);
    if(ଫାଇଲ<0)return 1;
    if(ଲିଖନ_ଫାଇଲ୍_ଡାଟା(ଫାଇଲ,ଡାଟା,sizeof(ଡାଟା)-1)!=sizeof(ଡାଟା)-1)return 2;
    if(ସୀକ୍_ଫାଇଲ୍(ଫାଇଲ,0,처음기준)!=0)return 3;
    char 읽은글[128]={0};int ଦୈର୍ଘ୍ୟ_ମୂଲ୍ୟ=파일자료읽기(ଫାଇଲ,읽은글,sizeof(읽은글)-1);
    ବନ୍ଦ_ଫାଇଲ୍(ଫାଇଲ);
    if(ଦୈର୍ଘ୍ୟ_ମୂଲ୍ୟ!=sizeof(ଡାଟା)-1)return 4;
    for(int 수=0;수<ଦୈର୍ଘ୍ୟ_ମୂଲ୍ୟ;수++)if(ଡାଟା[수]!=읽은글[수])return 5;
    return ନିର୍ଗମ(읽은글);
}
