"""עצמי ליבה_ערך MicroPython에서 사용하는 한글 פונקציה_ערך שם."""
import jkoros as מערכת_הפעלה
פלטטקסט = print
파일읽기 = מערכת_הפעלה.read
כתיבה_קובץ = מערכת_הפעלה.write
הסר_קובץ = מערכת_הפעלה.remove
입력읽기 = מערכת_הפעלה.stdin
ציור_מלבן = מערכת_הפעלה.rect
그림기다리기 = מערכת_הפעלה.wait_key
밀리초 = מערכת_הפעלה.ticks_ms
פתח_יחידת_נתונים = מערכת_הפעלה.udp_open
שלח_יחידת_נתונים = מערכת_הפעלה.udp_send
שלח_חיצוני_יחידת_נתונים = מערכת_הפעלה.udp_sendto
לקבל_יחידת_נתונים = מערכת_הפעלה.udp_recv
סגור_רשת = מערכת_הפעלה.udp_close

def 글해독(נתונים):
    return נתונים.decode("utf-8")
