from 한국어 import అవుట్పుట్, 전문통신열기, 바깥전문보내기, 전문받기, మూసివేయి_నెట్_వర్క్, 밀리초
from 한국어 import సిస్టం_దోషం, 다시시도오류, 글부호화, 명령인수, పూర్ణాంకం
종단 = 전문통신열기(0)
try:
    전문 = 글부호화("PYTHON UDP te")
    바깥전문보내기(종단, "10.0.2.2", పూర్ణాంకం(명령인수[1]), 전문)
    నడుపుము = 밀리초()
    while True:
        try:
            ప్రత్యుత్తరం_ఇవ్వు, పోర్టు_మూల్యం = 전문받기(종단)
            break
        except సిస్టం_దోషం as దోషం:
            if దోషం.సూచీ != 다시시도오류 or 밀리초() - నడుపుము >= 700:
                raise
    assert ప్రత్యుత్తరం_ఇవ్వు == 전문
    అవుట్పుట్("PYTHON 네트워크 సరిచూడు: UDP te")
finally:
    మూసివేయి_నెట్_వర్క్(종단)
