#include "예제규약.h"
int main(void) {
    const char податоци[]="C Датотека: Македонски 😀\n";
    int Датотека=отвори_датотека("c.txt",чита_пишува|없으면만들기|내용비우기,0600);
    if(Датотека<0)return 1;
    if(запиши_датотека_податоци(Датотека,податоци,sizeof(податоци)-1)!=sizeof(податоци)-1)return 2;
    if(пребарај_датотека(Датотека,0,처음기준)!=0)return 3;
    char 읽은글[128]={0};int должина_VALUE=파일자료읽기(Датотека,읽은글,sizeof(읽은글)-1);
    затвори_датотека(Датотека);
    if(должина_VALUE!=sizeof(податоци)-1)return 4;
    for(int 수=0;수<должина_VALUE;수++)if(податоци[수]!=읽은글[수])return 5;
    return 출력(읽은글);
}
