from தமிழ் import வெளியீட்டு_இடம், 전문통신열기, 바깥전문보내기, 전문받기, மூடு_பிணையம், 밀리초
from தமிழ் import முறைமை_பிழை, 다시시도오류, 글부호화, 명령인수, முழு_எண்
முடிவுப்_புள்ளி = 전문통신열기(0)
try:
    전문 = 글부호화("PYTHON UDP ta")
    바깥전문보내기(முடிவுப்_புள்ளி, "10.0.2.2", முழு_எண்(명령인수[1]), 전문)
    செயல்படுத்துக = 밀리초()
    while True:
        try:
            பதிலளி, முணையம்_மதிப்பு = 전문받기(முடிவுப்_புள்ளி)
            break
        except முறைமை_பிழை as பிழை:
            if பிழை.அடைவு != 다시시도오류 or 밀리초() - செயல்படுத்துக >= 700:
                raise
    assert பதிலளி == 전문
    வெளியீட்டு_இடம்("PYTHON 네트워크 சரிபார்: UDP ta")
finally:
    மூடு_பிணையம்(முடிவுப்_புள்ளி)
