// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int قدر) {
        if (قدر < 0x80) 보드.직렬쓰기(قدر);
        else if (قدر < 0x800) {
            보드.직렬쓰기(0xc0 | (قدر >> 6)); 보드.직렬쓰기(0x80 | (قدر & 63));
        } else if (قدر < 0x10000) {
            보드.직렬쓰기(0xe0 | (قدر >> 12)); 보드.직렬쓰기(0x80 | ((قدر >> 6) & 63)); 보드.직렬쓰기(0x80 | (قدر & 63));
        } else {
            보드.직렬쓰기(0xf0 | (قدر >> 18)); 보드.직렬쓰기(0x80 | ((قدر >> 12) & 63));
            보드.직렬쓰기(0x80 | ((قدر >> 6) & 63)); 보드.직렬쓰기(0x80 | (قدر & 63));
        }
    }
    static void لکھو(String متن) {
        for (int اشاریہ = 0; اشاریہ < متن.length(); اشاریہ++) {
            int قدر = متن.charAt(اشاریہ);
            if (قدر >= 0xd800 && قدر <= 0xdbff && اشاریہ + 1 < متن.length()) {
                int 아래 = متن.charAt(اشاریہ + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    قدر = 0x10000 + ((قدر - 0xd800) << 10) + 아래 - 0xdc00; اشاریہ++;
                }
            }
            if (قدر >= 0xd800 && قدر <= 0xdfff) قدر = 0xfffd;
            문자(قدر);
        }
    }
    static void 수(int قدر) {
        if (قدر < 0) 문자('-'); else قدر = -قدر;
        int 자리 = 1000000000;
        boolean چلاؤ = false;
        while (자리 > 0) {
            int عدد_قدر = -(قدر / 자리);
            if (عدد_قدر != 0 || چلاؤ || 자리 == 1) { 문자('0' + عدد_قدر); چلاؤ = true; }
            قدر %= 자리; 자리 /= 10;
        }
    }
}
