package 피시아이

import . "포트"
import . "인터럽트"
import . "콘솔"
import . "드라이버/드라이버"

type I아이피시아이시오엔티알오엘엘이알핸들러 interface {
	O온겟드라이버(디이브이 T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티디바이스디스크립터)
}

var 아이피시아이시오엔티알오엘엘이알핸들러 I아이피시아이시오엔티알오엘엘이알핸들러

type T디이에프에이유엘티피시아이시오엔티알오엘엘이알핸들러 struct {
}

func (셀프 T디이에프에이유엘티피시아이시오엔티알오엘엘이알핸들러) O온겟드라이버(디이브이 T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티디바이스디스크립터) {
}

type T비에이에스이어드레스레지스터 struct {
	피알이에프이티시에이치에이비엘이	bool
	어드레스			uint32
	알이지티와이피이		uint8
}
type T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티디바이스디스크립터 struct {
	P피오알티비에이에스이	uint32
	I인터럽트		uint32

	비유에스	uint16
	디바이스	uint16
	펑션	uint16

	V브이이엔디오알아이디	uint16
	D디바이스아이디	uint16

	시엘에이에스에스아이디	uint8
	에스유비시엘에이에스에스아이디	uint8
	아이엔티이알에프에이시이아이디	uint8

	알이브이아이에스아이오엔	uint8
}

func (셀프 *T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티디바이스디스크립터) I이닛() {
}

type T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티시오엔티알오엘엘이알 struct {
	아이피시아이시오엔티알오엘엘이알핸들러	I아이피시아이시오엔티알오엘엘이알핸들러
	데이터피오알티			uint16
	시오엠엠에이엔디피오알티		uint16
}

func (셀프 *T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티시오엔티알오엘엘이알) I이닛(아이피시아이시오엔티알오엘엘이알핸들러 I아이피시아이시오엔티알오엘엘이알핸들러) {
	셀프.데이터피오알티 = 0xCFC
	셀프.시오엠엠에이엔디피오알티 = 0xCF8

	셀프.아이피시아이시오엔티알오엘엘이알핸들러 = T디이에프에이유엘티피시아이시오엔티알오엘엘이알핸들러{}
	if 아이피시아이시오엔티알오엘엘이알핸들러 != nil {
		셀프.아이피시아이시오엔티알오엘엘이알핸들러 = 아이피시아이시오엔티알오엘엘이알핸들러
	}
}

var 아이카운트 int = 0

func (셀프 *T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티시오엔티알오엘엘이알) R리드(비유에스 uint16, 디바이스 uint16, 펑션 uint16, 알이지아이에스티이알오에프에프에스이티 uint32) uint32 {
	var 아이디 uint32 = 0
	아이디 = 0x1<<31 | (uint32(비유에스&0xFF) << 16) | (uint32(디바이스&0x1f) << 11) | (uint32(펑션&0x07) << 8) | uint32(알이지아이에스티이알오에프에프에스이티&0xFC)

	P피오알티라이트디더블유오알디(셀프.시오엠엠에이엔디피오알티, 아이디)

	알이에스유엘티1 := P피오알티리드디더블유오알디(셀프.데이터피오알티)
	알이에스유엘티2 := (알이에스유엘티1 >> (8 * (알이지아이에스티이알오에프에프에스이티 % 4)))

	return 알이에스유엘티2
}

func (셀프 *T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티시오엔티알오엘엘이알) W라이트(비유에스 uint16, 디바이스 uint16, 펑션 uint16, 알이지아이에스티이알오에프에프에스이티 uint32, 밸류 uint32) {
	var 아이디 uint32
	아이디 = 0x1<<31 | uint32((비유에스&0xFF)<<16) | uint32((디바이스&0x1f)<<11) | uint32((펑션&0x07)<<8) | uint32(알이지아이에스티이알오에프에프에스이티&0xFC)
	P피오알티라이트디더블유오알디(셀프.시오엠엠에이엔디피오알티, 아이디)
	P피오알티라이트디더블유오알디(셀프.데이터피오알티, 밸류)
}
func (셀프 *T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티시오엔티알오엘엘이알) D디바이스에이치에이에스에프유엔시티아이오엔에스(비유에스 uint16, 디바이스 uint16) bool {
	알이에스유엘티 := 셀프.R리드(비유에스, 디바이스, 0, 0x0E)
	if (알이에스유엘티 & (1 << 7)) != 0 {
		return true
	} else {
		return false
	}
}

var 콘솔 T콘솔 = T콘솔{}

func (셀프 *T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티시오엔티알오엘엘이알) S에스이엘이시티디알아이브이이알에스(드라이버매니저 *T드라이버매니저, 아이엔티이알알유피티에스 *T인터럽트매니저) {
	for 비유에스 := 0; 비유에스 < 8; 비유에스++ {
		for 디바이스 := 0; 디바이스 < 32; 디바이스++ {

			var 엔유엠에프유엔시티아이오엔에스 int = 1
			if 셀프.D디바이스에이치에이에스에프유엔시티아이오엔에스(uint16(비유에스), uint16(디바이스)) == true {
				엔유엠에프유엔시티아이오엔에스 = 8
			} else {
				엔유엠에프유엔시티아이오엔에스 = 1
			}

			for 펑션 := 0; 펑션 < 엔유엠에프유엔시티아이오엔에스; 펑션++ {
				var 디이브이 T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티디바이스디스크립터
				디이브이 = 셀프.G겟디바이스디스크립터(uint16(비유에스), uint16(디바이스), uint16(펑션))
				if 디이브이.V브이이엔디오알아이디 == 0x0000 || 디이브이.V브이이엔디오알아이디 == 0xFFFF {
					continue
				}

				for 비에이알엔유엠 := 0; 비에이알엔유엠 < 6; 비에이알엔유엠++ {
					var 비에이알 T비에이에스이어드레스레지스터 = 셀프.G겟비에이에스이어드레스레지스터(uint16(비유에스), uint16(디바이스), uint16(펑션), uint16(비에이알엔유엠))
					if 비에이알.어드레스 != 0 && (비에이알.알이지티와이피이 == 1) {
						디이브이.P피오알티비에이에스이 = 비에이알.어드레스
					}

					셀프.G겟드라이버(디이브이, 아이엔티이알알유피티에스)

				}

			}

		}
	}
}
func (셀프 *T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티시오엔티알오엘엘이알) G겟디바이스디스크립터(비유에스 uint16, 디바이스 uint16, 펑션 uint16) T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티디바이스디스크립터 {
	var 알이에스유엘티 T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티디바이스디스크립터
	알이에스유엘티 = T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티디바이스디스크립터{}
	알이에스유엘티.비유에스 = 비유에스
	알이에스유엘티.디바이스 = 디바이스
	알이에스유엘티.펑션 = 펑션

	알이에스유엘티.V브이이엔디오알아이디 = uint16(셀프.R리드(비유에스, 디바이스, 펑션, 0x00))
	알이에스유엘티.D디바이스아이디 = uint16(셀프.R리드(비유에스, 디바이스, 펑션, 0x02))

	알이에스유엘티.시엘에이에스에스아이디 = uint8(셀프.R리드(비유에스, 디바이스, 펑션, 0x0b))
	알이에스유엘티.에스유비시엘에이에스에스아이디 = uint8(셀프.R리드(비유에스, 디바이스, 펑션, 0x0a))
	알이에스유엘티.아이엔티이알에프에이시이아이디 = uint8(셀프.R리드(비유에스, 디바이스, 펑션, 0x09))

	알이에스유엘티.알이브이아이에스아이오엔 = uint8(셀프.R리드(비유에스, 디바이스, 펑션, 0x08))
	알이에스유엘티.I인터럽트 = uint32(셀프.R리드(비유에스, 디바이스, 펑션, 0x3C))

	return 알이에스유엘티
}
func (셀프 *T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티시오엔티알오엘엘이알) G겟비에이에스이어드레스레지스터(비유에스 uint16, 디바이스 uint16, 펑션 uint16, 비에이알 uint16) T비에이에스이어드레스레지스터 {
	var 알이에스유엘티 T비에이에스이어드레스레지스터

	에이치이에이디이알티와이피이 := 셀프.R리드(비유에스, 디바이스, 펑션, 0x0E) & 0x7F
	var 엠에이엑스비에이알에스 int = int(6 - (4 * 에이치이에이디이알티와이피이))
	if 비에이알 >= uint16(엠에이엑스비에이알에스) {
		return 알이에스유엘티
	}

	비에이알밸류 := 셀프.R리드(비유에스, 디바이스, 펑션, uint32(0x10+4*비에이알))

	if (비에이알밸류 & 0x1) != 0 {
		알이에스유엘티.알이지티와이피이 = 1
	} else {
		알이에스유엘티.알이지티와이피이 = 0
	}

	if 알이에스유엘티.알이지티와이피이 == 0 {
	} else {
		알이에스유엘티.어드레스 = 비에이알밸류 & ^uint32(0x3)
		알이에스유엘티.피알이에프이티시에이치에이비엘이 = false
	}

	return 알이에스유엘티
}
func (셀프 *T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티시오엔티알오엘엘이알) G겟드라이버(디이브이 T피이알아이피에이치이알에이엘시오엠피오엔이엔티아이엔티이알시오엔엔이시티디바이스디스크립터, 아이엔티이알알유피티에스 *T인터럽트매니저) {

	셀프.아이피시아이시오엔티알오엘엘이알핸들러.O온겟드라이버(디이브이)

}
