from українська import Вивід, відкрито_дейтаграма, надсилати_зовнішній_дейтаграма, отримувати_дейтаграма, Закрити_мережа, 밀리초
from українська import Система_помилка, 다시시도오류, кодувати_Текст, 명령인수, ціле_число
учасник = відкрито_дейтаграма(0)
try:
    дейтаграма = кодувати_Текст("PYTHON UDP українська")
    надсилати_зовнішній_дейтаграма(учасник, "10.0.2.2", ціле_число(명령인수[1]), дейтаграма)
    запустити = 밀리초()
    while True:
        try:
            відповідь, порт_значення = отримувати_дейтаграма(учасник)
            break
        except Система_помилка as ПОМИЛКА:
            if ПОМИЛКА.індекс != 다시시도오류 or 밀리초() - запустити >= 700:
                raise
    assert відповідь == дейтаграма
    Вивід("PYTHON 네트워크 перевіряти: UDP українська")
finally:
    Закрити_мережа(учасник)
