#ifndef _include_பிணையங்களிடை_முகவரி
#define _include_பிணையங்களிடை_முகவரி

#include <முழுஎண்_வகைகள்.h>
#include <அமைப்பு/socket.h>

typedef uint32_t பிணையங்களிடை_முகவரி_மதிப்பு_வகை;
typedef uint16_t தொடர்பு_வாயில்_எண்_வகை;

struct பிணையங்களிடை_முகவரி {
    பிணையங்களிடை_முகவரி_மதிப்பு_வகை முகவரி_மதிப்பு;
};

struct பிணையங்களிடை_முனை_முகவரி {
    முகவரிக்_குடும்ப_வகை பிணையங்களிடை_முகவரிக்_குடும்பம்;
    தொடர்பு_வாயில்_எண்_வகை தொடர்பு_வாயில்_எண்;
    struct பிணையங்களிடை_முகவரி பிணையங்களிடை_முகவரி_உள்ளடக்கம்;
    unsigned char முகவரி_நிரப்பு[8];
};

#define அடிப்படைப்_பிணையங்களிடை_நெறிமுறை 0
#define பயனர்_தரவுச்_செய்தி_நெறிமுறை 17
#define எந்த_உள்ளூர்_முகவரியும் ((பிணையங்களிடை_முகவரி_மதிப்பு_வகை)0x00000000U)
#define தன்னிடமே_திரும்பும்_முகவரி ((பிணையங்களிடை_முகவரி_மதிப்பு_வகை)0x7f000001U)

#endif
