/*
	Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
*/

#ifndef _せんげん_つうしんばんち_はちけたぐみじゅんじょ
#define _せんげん_つうしんばんち_はちけたぐみじゅんじょ

#include <そうごせつぞくもう/ばんち.h>

#ifdef __cplusplus
extern "C" {
#endif
ふごうなし16にしんけたせいすう つうしんもうじゅんに16けたをかえる(ふごうなし16にしんけたせいすう きかいじゅん16にしんけたち);
ふごうなし16にしんけたせいすう きかいじゅんに16けたをかえる(ふごうなし16にしんけたせいすう つうしんもうじゅん16にしんけたち);
ふごうなし32にしんけたせいすう つうしんもうじゅんに32けたをかえる(ふごうなし32にしんけたせいすう きかいじゅん32にしんけたち);
ふごうなし32にしんけたせいすう きかいじゅんに32けたをかえる(ふごうなし32にしんけたせいすう つうしんもうじゅん32にしんけたち);
#ifdef __cplusplus
}
#endif

#endif
