"""자체 കെര്_ണല്_മൂല്യം MicroPython에서 사용하는 한글 കാര്യപ്രവര്_ത്തനം_മൂല്യം പേരു്."""
import jkoros as ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം
ഫലം = print
파일읽기 = ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം.read
റൈറ്റ്_ചെയ്യുക_ഫയല് = ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം.write
നീക്കംചെയ്യുക_ഫയല് = ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം.remove
입력읽기 = ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം.stdin
네모그리기 = ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം.rect
그림기다리기 = ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം.wait_key
밀리초 = ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം.ticks_ms
전문통신열기 = ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം.udp_open
전문보내기 = ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം.udp_send
바깥전문보내기 = ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം.udp_sendto
전문받기 = ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം.udp_recv
അടയ്ക്കുക_നെറ്റ്_വർക്ക് = ഓപ്പറേറ്റിംഗ്_സിസ്റ്റം.udp_close

def 글해독(ഡാറ്റാ):
    return ഡാറ്റാ.decode("utf-8")
