// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public class 한글소스 {
    public static void main(String[] Аргументи) throws Македонски.자체.В_И_исклучок {
        Македонски.자체.출력.запиши_ред("자체 컴파일러와 Македонски библиотека");
        int знак_COUNT = Македонски.자체.문자.кодна_точка_COUNT("한글😀");
        Македонски.자체.출력.수쓰기(знак_COUNT);
        Македонски.자체.Датотека.Запиши("한글자료.txt", "자체 јадро_VALUE 안에서 저장한 한글😀");
        Македонски.자체.출력.запиши_ред(Македонски.자체.Датотека.Читај("한글자료.txt"));
    }
}
