#include "string.h"
size_t strlen(const char *சரம்_தரவு) { const char *தரவு_நிலை = சரம்_தரவு; while (*தரவு_நிலை) தரவு_நிலை++; return தரவு_நிலை - சரம்_தரவு; }
int memcmp(const void *첫째값, const void *둘째값, size_t 개수) { const unsigned char *x_ஒத்ததரமுள்ளது = 첫째값, *Y_பொத்தான்_அச்சுத்_தொகுப்பு = 둘째값; while (개수--) { if (*x_ஒத்ததரமுள்ளது != *Y_பொத்தான்_அச்சுத்_தொகுப்பு) return (int)*x_ஒத்ததரமுள்ளது - *Y_பொத்தான்_அச்சுத்_தொகுப்பு; x_ஒத்ததரமுள்ளது++; Y_பொத்தான்_அச்சுத்_தொகுப்பு++; } return 0; }
void *memmove(void *இலக்கு_தரவு, const void *சரம்_தரவு, size_t 개수) { unsigned char *x_ஒத்ததரமுள்ளது = இலக்கு_தரவு; const unsigned char *Y_பொத்தான்_அச்சுத்_தொகுப்பு = சரம்_தரவு; if (x_ஒத்ததரமுள்ளது < Y_பொத்தான்_அச்சுத்_தொகுப்பு) { for (size_t 순번 = 0; 순번 < 개수; 순번++) x_ஒத்ததரமுள்ளது[순번] = Y_பொத்தான்_அச்சுத்_தொகுப்பு[순번]; } else { while (개수) { 개수--; x_ஒத்ததரமுள்ளது[개수] = Y_பொத்தான்_அச்சுத்_தொகுப்பு[개수]; } } return இலக்கு_தரவு; }
int strncmp(const char *첫째값, const char *둘째값, size_t 개수) { while (개수--) { unsigned char x_ஒத்ததரமுள்ளது = *첫째값++, Y_பொத்தான்_அச்சுத்_தொகுப்பு = *둘째값++; if (x_ஒத்ததரமுள்ளது != Y_பொத்தான்_அச்சுத்_தொகுப்பு) return (int)x_ஒத்ததரமுள்ளது-Y_பொத்தான்_அச்சுத்_தொகுப்பு; if (!x_ஒத்ததரமுள்ளது) return 0; } return 0; }
/* lwIP only uses this for small decimal interface numbers. */
long strtol(const char *சரம்_தரவு, char **முடி_ஆஃப்செட், int பின்புல_மதிப்பு) {
    const char *தொடங்கு_ஆஃப்செட் = சரம்_தரவு; unsigned long மதிப்பு = 0; int குறியீட்டு_முறை_மதிப்பு = 1, 하나라도 = 0;
    while (*சரம்_தரவு == ' ' || (*சரம்_தரவு >= 9 && *சரம்_தரவு <= 13)) சரம்_தரவு++;
    if (*சரம்_தரவு == '-' || *சரம்_தரவு == '+') { if (*சரம்_தரவு == '-') குறியீட்டு_முறை_மதிப்பு = -1; சரம்_தரவு++; }
    if (பின்புல_மதிப்பு == 0) பின்புல_மதிப்பு = 10;
    while (*சரம்_தரவு >= '0' && *சரம்_தரவு <= '9' && *சரம்_தரவு - '0' < பின்புல_மதிப்பு) {
        unsigned இலக்கம்_மதிப்பு = *சரம்_தரவு++ - '0'; 하나라도 = 1;
        if (மதிப்பு > (0x7ffffffffffffffful - இலக்கம்_மதிப்பு) / (unsigned)பின்புல_மதிப்பு) மதிப்பு = 0x7ffffffffffffffful;
        else மதிப்பு = மதிப்பு * பின்புல_மதிப்பு + இலக்கம்_மதிப்பு;
    }
    if (முடி_ஆஃப்செட்) *முடி_ஆஃப்செட் = (char *)(하나라도 ? சரம்_தரவு : தொடங்கு_ஆஃப்செட்); return குறியீட்டு_முறை_மதிப்பு > 0 ? (long)மதிப்பு : -(long)மதிப்பு;
}
int atoi(const char *சரம்_தரவு) { return (int)strtol(சரம்_தரவு, 0, 10); }
