"""자체 ბირთვი_მნიშვნელობა MicroPython에서 사용하는 한글 ფუნქცია_მნიშვნელობა სახელი."""
import jkoros as ოპერაციული_სისტემა
출력 = print
파일읽기 = ოპერაციული_სისტემა.read
ჩაწერა_ფაილი = ოპერაციული_სისტემა.write
ამოშლა_ფაილი = ოპერაციული_სისტემა.remove
입력읽기 = ოპერაციული_სისტემა.stdin
네모그리기 = ოპერაციული_სისტემა.rect
그림기다리기 = ოპერაციული_სისტემა.wait_key
밀리초 = ოპერაციული_სისტემა.ticks_ms
전문통신열기 = ოპერაციული_სისტემა.udp_open
전문보내기 = ოპერაციული_სისტემა.udp_send
바깥전문보내기 = ოპერაციული_სისტემა.udp_sendto
전문받기 = ოპერაციული_სისტემა.udp_recv
დახურვა_ქსელი = ოპერაციული_სისტემა.udp_close

def 글해독(მონაცემები):
    return მონაცემები.decode("utf-8")
