from עברית import פלטטקסט, פתח_יחידת_נתונים, שלח_חיצוני_יחידת_נתונים, לקבל_יחידת_נתונים, סגור_רשת, 밀리초
from עברית import שגיאת_מערכת, 다시시도오류, לקדד_טקסט, 명령인수, מספר_שלם
משתתף = פתח_יחידת_נתונים(0)
try:
    יחידת_נתונים = לקדד_טקסט("PYTHON UDP he")
    שלח_חיצוני_יחידת_נתונים(משתתף, "10.0.2.2", מספר_שלם(명령인수[1]), יחידת_נתונים)
    הפעלה = 밀리초()
    while True:
        try:
            מענה, הסב_ערך = לקבל_יחידת_נתונים(משתתף)
            break
        except שגיאת_מערכת as שגיאה:
            if שגיאה.מדד != 다시시도오류 or 밀리초() - הפעלה >= 700:
                raise
    assert מענה == יחידת_נתונים
    פלטטקסט("PYTHON 네트워크 ודא_אמת: UDP he")
finally:
    סגור_רשת(משתתף)
