#ifndef εγγενής_χρήστης_κεφαλίδα
#define εγγενής_χρήστης_κεφαλίδα
#include <stdint.h>
#include <stddef.h>
#define 사용자바탕 0x02000000ul
#define χρήστης_εικόνα_Τελική_οντότητα 0x02c00000ul
#define χρήστης_σωρός_Τελική_οντότητα 0x02ed0000ul
#define χρήστης_δέσμη_διεύθυνση 0x02f00000ul
#define χρήστης_Τελική_οντότητα 0x03000000ul
#define 사용자쪽수 ((χρήστης_Τελική_οντότητα - 사용자바탕) / 4096ul)
#define χρήστης_εκτελέσιμο_σφάλμα (-8)
#define χρήστης_δεδομένα_σφάλμα (-1001)
#define χρήστης_εκτέλεση_σφάλμα (-1002)
#define 사용자잘못된명령 (-1003)
#define χρήστης_ΤΕΛΟΣ_ΧΡΟΝΟΥ (-1004)
#define 사용자중단됨 (-1005)
typedef struct { uint64_t δήλωση_δεδομένα[31], εντολή_θέση, Κατάσταση_κωδικός, δέσμη_διεύθυνση; } χρήστης_κάδρο;
void 사용자체계준비(void);
int εξαίρεση_χρήστη(χρήστης_κάδρο *, unsigned);
int 사용자실행파일검사(const unsigned char *, size_t);
uintptr_t Πίνακας_χρήστης_εκτελώ(uintptr_t);
uintptr_t Πίνακας_χρήστης_επικυρώνω(void);
uintptr_t Πίνακας_στοιχείο_ελέγχου_χρήστη(uintptr_t);
uint32_t 사용자상태읽기(unsigned, unsigned);
#endif
