"""자체 ແກນກາງ_ຄ່າ MicroPython에서 사용하는 한글 ຟັງ_ຄ໌_ຊັນ_ຄ່າ ຊື່."""
import jkoros as ລະບົບປະຕິບັດການ
출력 = print
파일읽기 = ລະບົບປະຕິບັດການ.read
ຂຽນ_ຟາຍ = ລະບົບປະຕິບັດການ.write
파일지우기 = ລະບົບປະຕິບັດການ.remove
입력읽기 = ລະບົບປະຕິບັດການ.stdin
네모그리기 = ລະບົບປະຕິບັດການ.rect
그림기다리기 = ລະບົບປະຕິບັດການ.wait_key
밀리초 = ລະບົບປະຕິບັດການ.ticks_ms
전문통신열기 = ລະບົບປະຕິບັດການ.udp_open
전문보내기 = ລະບົບປະຕິບັດການ.udp_send
바깥전문보내기 = ລະບົບປະຕິບັດການ.udp_sendto
전문받기 = ລະບົບປະຕິບັດການ.udp_recv
ປິດ_ເຄືອຂ່າຍ = ລະບົບປະຕິບັດການ.udp_close

def 글해독(ຂໍ້ມູນ):
    return ຂໍ້ມູນ.decode("utf-8")
