from 한국어 import 출력, 전문통신열기, 바깥전문보내기, 전문받기, пӯшидан_Шабака, 밀리초
from 한국어 import система_хато, 다시시도오류, 글부호화, 명령인수, адади_яклухт
종단 = 전문통신열기(0)
try:
    전문 = 글부호화("PYTHON UDP Tajik")
    바깥전문보내기(종단, "10.0.2.2", адади_яклухт(명령인수[1]), 전문)
    порча = 밀리초()
    while True:
        try:
            ҷавоб_додан, порт_қимат = 전문받기(종단)
            break
        except система_хато as Хато:
            if Хато.индекс != 다시시도오류 or 밀리초() - порча >= 700:
                raise
    assert ҷавоб_додан == 전문
    출력("PYTHON 네트워크 тасдиқ_кардан: UDP Tajik")
finally:
    пӯшидан_Шабака(종단)
