// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int ຄ່າ) {
        if (ຄ່າ < 0x80) ກະດານ.직렬쓰기(ຄ່າ);
        else if (ຄ່າ < 0x800) {
            ກະດານ.직렬쓰기(0xc0 | (ຄ່າ >> 6)); ກະດານ.직렬쓰기(0x80 | (ຄ່າ & 63));
        } else if (ຄ່າ < 0x10000) {
            ກະດານ.직렬쓰기(0xe0 | (ຄ່າ >> 12)); ກະດານ.직렬쓰기(0x80 | ((ຄ່າ >> 6) & 63)); ກະດານ.직렬쓰기(0x80 | (ຄ່າ & 63));
        } else {
            ກະດານ.직렬쓰기(0xf0 | (ຄ່າ >> 18)); ກະດານ.직렬쓰기(0x80 | ((ຄ່າ >> 12) & 63));
            ກະດານ.직렬쓰기(0x80 | ((ຄ່າ >> 6) & 63)); ກະດານ.직렬쓰기(0x80 | (ຄ່າ & 63));
        }
    }
    static void ຂຽນ(String ຂໍ້ຄວາມ) {
        for (int ດັດຊະນີ = 0; ດັດຊະນີ < ຂໍ້ຄວາມ.length(); ດັດຊະນີ++) {
            int ຄ່າ = ຂໍ້ຄວາມ.charAt(ດັດຊະນີ);
            if (ຄ່າ >= 0xd800 && ຄ່າ <= 0xdbff && ດັດຊະນີ + 1 < ຂໍ້ຄວາມ.length()) {
                int 아래 = ຂໍ້ຄວາມ.charAt(ດັດຊະນີ + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    ຄ່າ = 0x10000 + ((ຄ່າ - 0xd800) << 10) + 아래 - 0xdc00; ດັດຊະນີ++;
                }
            }
            if (ຄ່າ >= 0xd800 && ຄ່າ <= 0xdfff) ຄ່າ = 0xfffd;
            문자(ຄ່າ);
        }
    }
    static void 수(int ຄ່າ) {
        if (ຄ່າ < 0) 문자('-'); else ຄ່າ = -ຄ່າ;
        int ຈັດຕໍາແຫນ່ງ_ດັດຊະນີ = 1000000000;
        boolean ແລ່ນ = false;
        while (ຈັດຕໍາແຫນ່ງ_ດັດຊະນີ > 0) {
            int ຕົວເລກ_ຄ່າ = -(ຄ່າ / ຈັດຕໍາແຫນ່ງ_ດັດຊະນີ);
            if (ຕົວເລກ_ຄ່າ != 0 || ແລ່ນ || ຈັດຕໍາແຫນ່ງ_ດັດຊະນີ == 1) { 문자('0' + ຕົວເລກ_ຄ່າ); ແລ່ນ = true; }
            ຄ່າ %= ຈັດຕໍາແຫນ່ງ_ດັດຊະນີ; ຈັດຕໍາແຫນ່ງ_ດັດຊະນີ /= 10;
        }
    }
}
