// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int вриједност) {
        if (вриједност < 0x80) 보드.직렬쓰기(вриједност);
        else if (вриједност < 0x800) {
            보드.직렬쓰기(0xc0 | (вриједност >> 6)); 보드.직렬쓰기(0x80 | (вриједност & 63));
        } else if (вриједност < 0x10000) {
            보드.직렬쓰기(0xe0 | (вриједност >> 12)); 보드.직렬쓰기(0x80 | ((вриједност >> 6) & 63)); 보드.직렬쓰기(0x80 | (вриједност & 63));
        } else {
            보드.직렬쓰기(0xf0 | (вриједност >> 18)); 보드.직렬쓰기(0x80 | ((вриједност >> 12) & 63));
            보드.직렬쓰기(0x80 | ((вриједност >> 6) & 63)); 보드.직렬쓰기(0x80 | (вриједност & 63));
        }
    }
    static void писати(String текст) {
        for (int индекс = 0; индекс < текст.length(); индекс++) {
            int вриједност = текст.charAt(индекс);
            if (вриједност >= 0xd800 && вриједност <= 0xdbff && индекс + 1 < текст.length()) {
                int 아래 = текст.charAt(индекс + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    вриједност = 0x10000 + ((вриједност - 0xd800) << 10) + 아래 - 0xdc00; индекс++;
                }
            }
            if (вриједност >= 0xd800 && вриједност <= 0xdfff) вриједност = 0xfffd;
            문자(вриједност);
        }
    }
    static void 수(int вриједност) {
        if (вриједност < 0) 문자('-'); else вриједност = -вриједност;
        int 자리 = 1000000000;
        boolean 시작 = false;
        while (자리 > 0) {
            int 숫자 = -(вриједност / 자리);
            if (숫자 != 0 || 시작 || 자리 == 1) { 문자('0' + 숫자); 시작 = true; }
            вриједност %= 자리; 자리 /= 10;
        }
    }
}
