package ата

import . "порт"
import . "консоль"

const Байтpersector int = 512

type TДодатковоТехнологіяattachment struct {
	головний		bool
	dataПорт		TПорт16біт
	помилкаПорт		TПорт8біт
	sectorВідлікПорт	TПорт8біт
	lbaНизькаПорт		TПорт8біт
	lbamidПорт		TПорт8біт
	lbahiПорт		TПорт8біт
	пристрійПорт		TПорт8біт
	командаПорт		TПорт8біт
	контрольПорт		TПорт8біт
}

func (поточний *TДодатковоТехнологіяattachment) Init(головний bool, портbase uint16) {
	поточний.головний = головний
	поточний.dataПорт.Init(портbase)
	поточний.помилкаПорт.Init(портbase + 0x1)
	поточний.sectorВідлікПорт.Init(портbase + 0x2)
	поточний.lbaНизькаПорт.Init(портbase + 0x3)
	поточний.lbamidПорт.Init(портbase + 0x4)
	поточний.lbahiПорт.Init(портbase + 0x5)
	поточний.пристрійПорт.Init(портbase + 0x6)
	поточний.командаПорт.Init(портbase + 0x7)
	поточний.контрольПорт.Init(портbase + 0x8)

}

func (поточний *TДодатковоТехнологіяattachment) Identify() {

	var консоль_2 = TКонсоль{}

	if поточний.головний {
		поточний.пристрійПорт.Запис(0xA0)
	} else {
		поточний.пристрійПорт.Запис(0xB0)
	}
	поточний.контрольПорт.Запис(0)
	поточний.пристрійПорт.Запис(0xA0)

	var статус uint8 = поточний.командаПорт.Читання()
	if статус == 0xFF {
		консоль_2.MДрук(([]byte)("Invalid Status"))
		return
	}

	if поточний.головний {
		поточний.пристрійПорт.Запис(0xA0)
	} else {
		поточний.пристрійПорт.Запис(0xB0)
	}
	поточний.sectorВідлікПорт.Запис(0)
	поточний.lbaНизькаПорт.Запис(0)
	поточний.lbamidПорт.Запис(0)
	поточний.lbahiПорт.Запис(0)
	поточний.командаПорт.Запис(0xEC)

	статус = поточний.командаПорт.Читання()
	if статус == 0x00 {
		консоль_2.MДрук(([]byte)("HDD Does not exist, ignoreign "))
		return
	}
	for (статус&0x80) == 0x80 && (статус&0x01) != 0x01 {
		статус = поточний.командаПорт.Читання()
	}

	if (статус & 0x01) != 0 {
		консоль_2.MДрук(([]byte)("error reading ATA"))
		return
	}

	for i := 0; i < 256; i++ {
		var data = поточний.dataПорт.Читання()
		текст := []byte("  ")
		текст[0] = uint8((data >> 8) & 0xFF)
		текст[1] = uint8(data & 0xFF)

	}
	консоль_2.MДрукxy(([]byte)("ata ok"), 10, 22)

}
func (поточний *TДодатковоТехнологіяattachment) Читання28(sector uint32, data *[]byte, відлік int) {
	var консоль_2 = TКонсоль{}
	if (sector & 0xF0000000) != 0 {
		консоль_2.MДрук(([]byte)("ata read error "))
		return
	}
	if відлік > Байтpersector {
		консоль_2.MДрук(([]byte)("ata read error "))
		return
	}

	if поточний.головний {
		поточний.пристрійПорт.Запис(uint8(0xE0 | uint8((sector&0x0F000000)>>24)))
	} else {
		поточний.пристрійПорт.Запис(uint8(0xF0 | uint8((sector&0x0F000000)>>24)))
	}
	поточний.помилкаПорт.Запис(0)
	поточний.sectorВідлікПорт.Запис(1)

	поточний.lbaНизькаПорт.Запис(uint8(sector & 0x000000FF))
	поточний.lbamidПорт.Запис(uint8((sector & 0x0000FF00) >> 8))
	поточний.lbahiПорт.Запис(uint8((sector & 0x00FF0000) >> 16))
	поточний.командаПорт.Запис(0x20)

	var статус uint8 = поточний.командаПорт.Читання()
	for ((статус & 0x80) == 0x80) && ((статус & 0x01) != 0x01) {
		статус = поточний.командаПорт.Читання()
	}

	if (статус & 0x01) != 0 {
		консоль_2.MДрук(([]byte)("ata read error "))
		return
	}

	консоль_2.MДрукxy(([]byte)("Reading ATA Drive:"), 1, 24)

	var i int = 0
	for ; i < відлік; i += 2 {
		var wdata uint16 = поточний.dataПорт.Читання()

		(*data)[i] = uint8(wdata & 0x00FF)
		if i+1 < відлік {

			(*data)[i+1] = uint8((wdata >> 8) & 0x00FF)
		}
	}

	for i := (відлік + (відлік % 2)); i < Байтpersector; i += 2 {
		поточний.dataПорт.Читання()
	}
}
func (поточний *TДодатковоТехнологіяattachment) Запис28(sectorЧисло uint32, data []byte, відлік uint32) {

	if sectorЧисло > 0x0FFFFFFF {
		return
	}

	if відлік > 512 {
		return
	}

	if поточний.головний {
		поточний.пристрійПорт.Запис(uint8(0xE0 | uint8((sectorЧисло&0x0F000000)>>24)))
	} else {
		поточний.пристрійПорт.Запис(uint8(0xF0 | uint8((sectorЧисло&0x0F000000)>>24)))
	}

	поточний.помилкаПорт.Запис(0)
	поточний.sectorВідлікПорт.Запис(1)
	поточний.lbaНизькаПорт.Запис(uint8(sectorЧисло & 0x000000FF))
	поточний.lbamidПорт.Запис(uint8((sectorЧисло & 0x0000FF00) >> 8))
	поточний.lbahiПорт.Запис(uint8((sectorЧисло & 0x00FF0000) >> 16))
	поточний.командаПорт.Запис(0x30)

	var консоль_2 = TКонсоль{}
	консоль_2.MДрук(([]byte)("Writing to ATA Drive:"))

	for i := uint32(0); i < відлік; i += 2 {

		var wdata uint16 = uint16(data[i])

		if i+1 < відлік {
			wdata = wdata | (uint16(data[i+1]) << 8)
		}

		поточний.dataПорт.Запис(wdata)

		текст := []byte("  ")
		текст[0] = uint8((wdata >> 8) & 0xFF)
		текст[1] = uint8(wdata & 0xFF)

		консоль_2.MДрук(текст)
	}

	for i := (відлік + (відлік % 2)); i < 512; i += 2 {
		поточний.dataПорт.Запис(0x0000)
	}

}

func (поточний *TДодатковоТехнологіяattachment) Flush() {
	if поточний.головний {
		поточний.пристрійПорт.Запис(0xE0)
	} else {
		поточний.пристрійПорт.Запис(0xF0)
	}
	поточний.командаПорт.Запис(0xE7)

	var консоль_2 = TКонсоль{}

	var статус uint8 = поточний.командаПорт.Читання()
	if статус == 0x00 {
		return
	}

	for ((статус & 0x80) == 0x80) && ((статус & 0x01) != 0x01) {
		статус = поточний.командаПорт.Читання()
	}
	if (статус & 0x01) != 0 {
		консоль_2.MДрук(([]byte)(" ata flush error"))
		return
	}

}
