"""자체 يادرو_قىممىتى MicroPython에서 사용하는 한글 فۇنكسىيە_قىممىتى ئاتى."""
import jkoros as مەشغۇلات_سىستېمىسى
چىقار = print
파일읽기 = مەشغۇلات_سىستېمىسى.read
يازماق_ھۆججەت = مەشغۇلات_سىستېمىسى.write
چىقىرىۋەتمەك_ھۆججەت = مەشغۇلات_سىستېمىسى.remove
입력읽기 = مەشغۇلات_سىستېمىسى.stdin
네모그리기 = مەشغۇلات_سىستېمىسى.rect
그림기다리기 = مەشغۇلات_سىستېمىسى.wait_key
밀리초 = مەشغۇلات_سىستېمىسى.ticks_ms
전문통신열기 = مەشغۇلات_سىستېمىسى.udp_open
전문보내기 = مەشغۇلات_سىستېمىسى.udp_send
바깥전문보내기 = مەشغۇلات_سىستېمىسى.udp_sendto
전문받기 = مەشغۇلات_سىستېمىسى.udp_recv
ئاياغ_تور = مەشغۇلات_سىستېمىسى.udp_close

def 글해독(مەلۇمات):
    return مەلۇمات.decode("utf-8")
