#include "string.h"
size_t strlen(const char *სტრიქონი_მონაცემები) { const char *მონაცემები_პოზიცია = სტრიქონი_მონაცემები; while (*მონაცემები_პოზიცია) მონაცემები_პოზიცია++; return მონაცემები_პოზიცია - სტრიქონი_მონაცემები; }
int memcmp(const void *첫째값, const void *둘째값, size_t 개수) { const unsigned char *x_კოორდინატა = 첫째값, *Y_ღილაკი_კოორდინატი = 둘째값; while (개수--) { if (*x_კოორდინატა != *Y_ღილაკი_კოორდინატი) return (int)*x_კოორდინატა - *Y_ღილაკი_კოორდინატი; x_კოორდინატა++; Y_ღილაკი_კოორდინატი++; } return 0; }
void *memmove(void *მიმართულება_მონაცემები, const void *სტრიქონი_მონაცემები, size_t 개수) { unsigned char *x_კოორდინატა = მიმართულება_მონაცემები; const unsigned char *Y_ღილაკი_კოორდინატი = სტრიქონი_მონაცემები; if (x_კოორდინატა < Y_ღილაკი_კოორდინატი) { for (size_t 순번 = 0; 순번 < 개수; 순번++) x_კოორდინატა[순번] = Y_ღილაკი_კოორდინატი[순번]; } else { while (개수) { 개수--; x_კოორდინატა[개수] = Y_ღილაკი_კოორდინატი[개수]; } } return მიმართულება_მონაცემები; }
int strncmp(const char *첫째값, const char *둘째값, size_t 개수) { while (개수--) { unsigned char x_კოორდინატა = *첫째값++, Y_ღილაკი_კოორდინატი = *둘째값++; if (x_კოორდინატა != Y_ღილაკი_კოორდინატი) return (int)x_კოორდინატა-Y_ღილაკი_კოორდინატი; if (!x_კოორდინატა) return 0; } return 0; }
/* lwIP only uses this for small decimal interface numbers. */
long strtol(const char *სტრიქონი_მონაცემები, char **დასასრული_ოფსეტი, int ფონი_მნიშვნელობა) {
    const char *დაწყება_ოფსეტი = სტრიქონი_მონაცემები; unsigned long მნიშვნელობა = 0; int კოდირება_მნიშვნელობა = 1, 하나라도 = 0;
    while (*სტრიქონი_მონაცემები == ' ' || (*სტრიქონი_მონაცემები >= 9 && *სტრიქონი_მონაცემები <= 13)) სტრიქონი_მონაცემები++;
    if (*სტრიქონი_მონაცემები == '-' || *სტრიქონი_მონაცემები == '+') { if (*სტრიქონი_მონაცემები == '-') კოდირება_მნიშვნელობა = -1; სტრიქონი_მონაცემები++; }
    if (ფონი_მნიშვნელობა == 0) ფონი_მნიშვნელობა = 10;
    while (*სტრიქონი_მონაცემები >= '0' && *სტრიქონი_მონაცემები <= '9' && *სტრიქონი_მონაცემები - '0' < ფონი_მნიშვნელობა) {
        unsigned ციფრი_მნიშვნელობა = *სტრიქონი_მონაცემები++ - '0'; 하나라도 = 1;
        if (მნიშვნელობა > (0x7ffffffffffffffful - ციფრი_მნიშვნელობა) / (unsigned)ფონი_მნიშვნელობა) მნიშვნელობა = 0x7ffffffffffffffful;
        else მნიშვნელობა = მნიშვნელობა * ფონი_მნიშვნელობა + ციფრი_მნიშვნელობა;
    }
    if (დასასრული_ოფსეტი) *დასასრული_ოფსეტი = (char *)(하나라도 ? სტრიქონი_მონაცემები : დაწყება_ოფსეტი); return კოდირება_მნიშვნელობა > 0 ? (long)მნიშვნელობა : -(long)მნიშვნელობა;
}
int atoi(const char *სტრიქონი_მონაცემები) { return (int)strtol(სტრიქონი_მონაცემები, 0, 10); }
