/*
	Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
*/
package  상호통신망제어메시지규약

import . "unsafe"
//import . "단말기"
//import . "통신/신호통신망형태"
import . "통신/상호통신망규약V4"
import . "util"

//var 단말기 = T단말기{}
/////////////////////////////////////////////////////////////////////////////////////////////
//
//		상호통신망제어메시지규약 = InternetControlMessageProtocol = ICMP
//
/////////////////////////////////////////////////////////////////////////////////////////////
type T상호통신망제어메시지규약_메시지_임시저장공간 struct{
	유형 byte
	부호 byte
	
	검사합 [2]byte
	자료 [4] byte
}

var 상호통신망제어메시지규약_크기 int = 64

type T상호통신망제어메시지규약_메시지 struct{
	유형 uint8
	부호 uint8
	
	검사합 uint16
	자료 uint32
}
func (자신 *T상호통신망제어메시지규약_메시지) M초기화(임시저장공간 T상호통신망제어메시지규약_메시지_임시저장공간){
	자신.유형 = 임시저장공간.유형
	자신.부호 = 임시저장공간.부호
	
	자신.검사합 = Uint16_R(ArrayToUint16(임시저장공간.검사합))
	자신.자료 = Uint32_R(ArrayToUint32(임시저장공간.자료))
}

func (자신 *T상호통신망제어메시지규약_메시지) M임시저장공간_설정(임시저장공간 *T상호통신망제어메시지규약_메시지_임시저장공간){
	임시저장공간.유형 = 자신.유형
	임시저장공간.부호 = 자신.부호

	임시저장공간.검사합 = Uint16ToArray(자신.검사합)
	임시저장공간.자료 = Uint32ToArray(자신.자료)
}

/////////////////////////////////////////////////////////////////////////////////////////////
type T상호통신망제어메시지규약 struct{
	T상호통신망규약_처리기
}
func (자신 *T상호통신망제어메시지규약) M초기화(후단부 T상호통신망규약_제공자){
	자신.T상호통신망규약_처리기.M초기화(후단부, 자신, 0x01)
}
func (자신 *T상호통신망제어메시지규약) M상호통신망규약_받은동시(srcIP_BE uint32, dstIP_BE uint32, 자료주소 uintptr, 크기 uint32) bool{
	if 크기 < uint32(상호통신망제어메시지규약_크기) {
		return false
	}
	/*
	단말기.M출력XY("[len:", 10, 16)
	단말기.M출력(크기)
	단말기.M출력("]")
	*/

	var 임시저장공간 *T상호통신망제어메시지규약_메시지_임시저장공간 = (*T상호통신망제어메시지규약_메시지_임시저장공간)(Pointer(자료주소))
	var 메시지 T상호통신망제어메시지규약_메시지 = T상호통신망제어메시지규약_메시지{}
	메시지.M초기화(*임시저장공간)

	switch 메시지.유형 {
		case 0:
			break

		case 8:
			메시지.유형 = 0
			메시지.검사합 = 0
			메시지.M임시저장공간_설정(임시저장공간)
			메시지.검사합 = 자신.T상호통신망규약_처리기.M제공자_갖기().M검사합((*([4096]uint16))(Pointer(자료주소)), uint32(상호통신망제어메시지규약_크기))
			메시지.M임시저장공간_설정(임시저장공간)
			return true
			break
	}
	return false
}

func (자신 *T상호통신망제어메시지규약) M반향응답_요청(ip_be uint32) bool{

	var 메시지 T상호통신망제어메시지규약_메시지 = T상호통신망제어메시지규약_메시지{}
	var 임시저장공간 T상호통신망제어메시지규약_메시지_임시저장공간 = T상호통신망제어메시지규약_메시지_임시저장공간{}

	메시지.유형 = 8
	메시지.부호 = 0
	메시지.자료 = 0x3713
	메시지.검사합 = 0
	메시지.M임시저장공간_설정(&임시저장공간)
	메시지.검사합 = 자신.T상호통신망규약_처리기.M제공자_갖기().M검사합((*([4096]uint16))(Pointer(&임시저장공간)), uint32(상호통신망제어메시지규약_크기))
	메시지.M임시저장공간_설정(&임시저장공간)

	var 자료주소 uintptr = uintptr(Pointer(&임시저장공간))
	자신.T상호통신망규약_처리기.M패킷보내기(ip_be, 0x01, 자료주소, uint32(상호통신망제어메시지규약_크기))

	return false
	
}
