package 에이티에이

import . "포트"
import . "콘솔"

const B비와이티이에스피이알에스이시티오알 int = 512

type T에이디브이에이엔시이디티이시에이치엔오엘오지와이에이티티에이시에이치엠이엔티 struct {
	엠에이에스티이알	bool
	데이터피오알티		T피오알티16비아이티
	에러피오알티		T피오알티8비아이티
	에스이시티오알카운트피오알티	T피오알티8비아이티
	엘비에이엘오더블유피오알티	T피오알티8비아이티
	엘비에이엠아이디피오알티	T피오알티8비아이티
	엘비에이에이치아이피오알티	T피오알티8비아이티
	디바이스피오알티	T피오알티8비아이티
	시오엠엠에이엔디피오알티	T피오알티8비아이티
	시오엔티알오엘피오알티	T피오알티8비아이티
}

func (셀프 *T에이디브이에이엔시이디티이시에이치엔오엘오지와이에이티티에이시에이치엠이엔티) I이닛(엠에이에스티이알 bool, 피오알티비에이에스이 uint16) {
	셀프.엠에이에스티이알 = 엠에이에스티이알
	셀프.데이터피오알티.I이닛(피오알티비에이에스이)
	셀프.에러피오알티.I이닛(피오알티비에이에스이 + 0x1)
	셀프.에스이시티오알카운트피오알티.I이닛(피오알티비에이에스이 + 0x2)
	셀프.엘비에이엘오더블유피오알티.I이닛(피오알티비에이에스이 + 0x3)
	셀프.엘비에이엠아이디피오알티.I이닛(피오알티비에이에스이 + 0x4)
	셀프.엘비에이에이치아이피오알티.I이닛(피오알티비에이에스이 + 0x5)
	셀프.디바이스피오알티.I이닛(피오알티비에이에스이 + 0x6)
	셀프.시오엠엠에이엔디피오알티.I이닛(피오알티비에이에스이 + 0x7)
	셀프.시오엔티알오엘피오알티.I이닛(피오알티비에이에스이 + 0x8)

}

func (셀프 *T에이디브이에이엔시이디티이시에이치엔오엘오지와이에이티티에이시에이치엠이엔티) I아이디이엔티아이에프와이() {

	var 콘솔_이름 = T콘솔{}

	if 셀프.엠에이에스티이알 {
		셀프.디바이스피오알티.W라이트(0xA0)
	} else {
		셀프.디바이스피오알티.W라이트(0xB0)
	}
	셀프.시오엔티알오엘피오알티.W라이트(0)
	셀프.디바이스피오알티.W라이트(0xA0)

	var 스테이터스 uint8 = 셀프.시오엠엠에이엔디피오알티.R리드()
	if 스테이터스 == 0xFF {
		콘솔_이름.M출력(([]byte)("Invalid Status"))
		return
	}

	if 셀프.엠에이에스티이알 {
		셀프.디바이스피오알티.W라이트(0xA0)
	} else {
		셀프.디바이스피오알티.W라이트(0xB0)
	}
	셀프.에스이시티오알카운트피오알티.W라이트(0)
	셀프.엘비에이엘오더블유피오알티.W라이트(0)
	셀프.엘비에이엠아이디피오알티.W라이트(0)
	셀프.엘비에이에이치아이피오알티.W라이트(0)
	셀프.시오엠엠에이엔디피오알티.W라이트(0xEC)

	스테이터스 = 셀프.시오엠엠에이엔디피오알티.R리드()
	if 스테이터스 == 0x00 {
		콘솔_이름.M출력(([]byte)("HDD Does not exist, ignoreign "))
		return
	}
	for (스테이터스&0x80) == 0x80 && (스테이터스&0x01) != 0x01 {
		스테이터스 = 셀프.시오엠엠에이엔디피오알티.R리드()
	}

	if (스테이터스 & 0x01) != 0 {
		콘솔_이름.M출력(([]byte)("error reading ATA"))
		return
	}

	for 아이 := 0; 아이 < 256; 아이++ {
		var 데이터 = 셀프.데이터피오알티.R리드()
		티이엑스티 := []byte("  ")
		티이엑스티[0] = uint8((데이터 >> 8) & 0xFF)
		티이엑스티[1] = uint8(데이터 & 0xFF)

	}
	콘솔_이름.M출력XY(([]byte)("ata ok"), 10, 22)

}
func (셀프 *T에이디브이에이엔시이디티이시에이치엔오엘오지와이에이티티에이시에이치엠이엔티) R리드28(에스이시티오알 uint32, 데이터 *[]byte, 카운트 int) {
	var 콘솔_이름 = T콘솔{}
	if (에스이시티오알 & 0xF0000000) != 0 {
		콘솔_이름.M출력(([]byte)("ata read error "))
		return
	}
	if 카운트 > B비와이티이에스피이알에스이시티오알 {
		콘솔_이름.M출력(([]byte)("ata read error "))
		return
	}

	if 셀프.엠에이에스티이알 {
		셀프.디바이스피오알티.W라이트(uint8(0xE0 | uint8((에스이시티오알&0x0F000000)>>24)))
	} else {
		셀프.디바이스피오알티.W라이트(uint8(0xF0 | uint8((에스이시티오알&0x0F000000)>>24)))
	}
	셀프.에러피오알티.W라이트(0)
	셀프.에스이시티오알카운트피오알티.W라이트(1)

	셀프.엘비에이엘오더블유피오알티.W라이트(uint8(에스이시티오알 & 0x000000FF))
	셀프.엘비에이엠아이디피오알티.W라이트(uint8((에스이시티오알 & 0x0000FF00) >> 8))
	셀프.엘비에이에이치아이피오알티.W라이트(uint8((에스이시티오알 & 0x00FF0000) >> 16))
	셀프.시오엠엠에이엔디피오알티.W라이트(0x20)

	var 스테이터스 uint8 = 셀프.시오엠엠에이엔디피오알티.R리드()
	for ((스테이터스 & 0x80) == 0x80) && ((스테이터스 & 0x01) != 0x01) {
		스테이터스 = 셀프.시오엠엠에이엔디피오알티.R리드()
	}

	if (스테이터스 & 0x01) != 0 {
		콘솔_이름.M출력(([]byte)("ata read error "))
		return
	}

	콘솔_이름.M출력XY(([]byte)("Reading ATA Drive:"), 1, 24)

	var 아이 int = 0
	for ; 아이 < 카운트; 아이 += 2 {
		var 더블유디에이티에이 uint16 = 셀프.데이터피오알티.R리드()

		(*데이터)[아이] = uint8(더블유디에이티에이 & 0x00FF)
		if 아이+1 < 카운트 {

			(*데이터)[아이+1] = uint8((더블유디에이티에이 >> 8) & 0x00FF)
		}
	}

	for 아이 := (카운트 + (카운트 % 2)); 아이 < B비와이티이에스피이알에스이시티오알; 아이 += 2 {
		셀프.데이터피오알티.R리드()
	}
}
func (셀프 *T에이디브이에이엔시이디티이시에이치엔오엘오지와이에이티티에이시에이치엠이엔티) W라이트28(에스이시티오알엔유엠 uint32, 데이터 []byte, 카운트 uint32) {

	if 에스이시티오알엔유엠 > 0x0FFFFFFF {
		return
	}

	if 카운트 > 512 {
		return
	}

	if 셀프.엠에이에스티이알 {
		셀프.디바이스피오알티.W라이트(uint8(0xE0 | uint8((에스이시티오알엔유엠&0x0F000000)>>24)))
	} else {
		셀프.디바이스피오알티.W라이트(uint8(0xF0 | uint8((에스이시티오알엔유엠&0x0F000000)>>24)))
	}

	셀프.에러피오알티.W라이트(0)
	셀프.에스이시티오알카운트피오알티.W라이트(1)
	셀프.엘비에이엘오더블유피오알티.W라이트(uint8(에스이시티오알엔유엠 & 0x000000FF))
	셀프.엘비에이엠아이디피오알티.W라이트(uint8((에스이시티오알엔유엠 & 0x0000FF00) >> 8))
	셀프.엘비에이에이치아이피오알티.W라이트(uint8((에스이시티오알엔유엠 & 0x00FF0000) >> 16))
	셀프.시오엠엠에이엔디피오알티.W라이트(0x30)

	var 콘솔_이름 = T콘솔{}
	콘솔_이름.M출력(([]byte)("Writing to ATA Drive:"))

	for 아이 := uint32(0); 아이 < 카운트; 아이 += 2 {

		var 더블유디에이티에이 uint16 = uint16(데이터[아이])

		if 아이+1 < 카운트 {
			더블유디에이티에이 = 더블유디에이티에이 | (uint16(데이터[아이+1]) << 8)
		}

		셀프.데이터피오알티.W라이트(더블유디에이티에이)

		티이엑스티 := []byte("  ")
		티이엑스티[0] = uint8((더블유디에이티에이 >> 8) & 0xFF)
		티이엑스티[1] = uint8(더블유디에이티에이 & 0xFF)

		콘솔_이름.M출력(티이엑스티)
	}

	for 아이 := (카운트 + (카운트 % 2)); 아이 < 512; 아이 += 2 {
		셀프.데이터피오알티.W라이트(0x0000)
	}

}

func (셀프 *T에이디브이에이엔시이디티이시에이치엔오엘오지와이에이티티에이시에이치엠이엔티) F에프엘유에스에이치() {
	if 셀프.엠에이에스티이알 {
		셀프.디바이스피오알티.W라이트(0xE0)
	} else {
		셀프.디바이스피오알티.W라이트(0xF0)
	}
	셀프.시오엠엠에이엔디피오알티.W라이트(0xE7)

	var 콘솔_이름 = T콘솔{}

	var 스테이터스 uint8 = 셀프.시오엠엠에이엔디피오알티.R리드()
	if 스테이터스 == 0x00 {
		return
	}

	for ((스테이터스 & 0x80) == 0x80) && ((스테이터스 & 0x01) != 0x01) {
		스테이터스 = 셀프.시오엠엠에이엔디피오알티.R리드()
	}
	if (스테이터스 & 0x01) != 0 {
		콘솔_이름.M출력(([]byte)(" ata flush error"))
		return
	}

}
