#include "उदाहरणनियम.h"
int main(void) {
    const char डेटा[]="C फाइल: mr 😀\n";
    int फाइल=संचिका_उघडा("c.txt",वाचणे_लिहिणे|जर_अनुपस्थित_तयार_करा|छाटूनरिकामेकरा_सामुग्री,0600);
    if(फाइल<0)return 1;
    if(संचिका_डेटा_लिहा(फाइल,डेटा,sizeof(डेटा)-1)!=sizeof(डेटा)-1)return 2;
    if(शोधा_संचिका(फाइल,0,पासून_आरंभ)!=0)return 3;
    char मजकूर_मूल्य_वाचा[128]={0};int लांबी_मूल्य=संचिका_डेटा_वाचा(फाइल,मजकूर_मूल्य_वाचा,sizeof(मजकूर_मूल्य_वाचा)-1);
    संचिका_मिटवा(फाइल);
    if(लांबी_मूल्य!=sizeof(डेटा)-1)return 4;
    for(int संख्या=0;संख्या<लांबी_मूल्य;संख्या++)if(डेटा[संख्या]!=मजकूर_मूल्य_वाचा[संख्या])return 5;
    return आउटपुट(मजकूर_मूल्य_वाचा);
}
