// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public class 한글소스 {
    public static void main(String[] Параметри) throws Български.자체.В_И_изключение {
        Български.자체.Изход.записване_ред("자체 컴파일러와 Български библиотека");
        int 글자수 = Български.자체.문자.코드포인트수("한글😀");
        Български.자체.Изход.수쓰기(글자수);
        Български.자체.Файл.Писане("한글자료.txt", "자체 ядро_стойност 안에서 저장한 한글😀");
        Български.자체.Изход.записване_ред(Български.자체.Файл.Четене("한글자료.txt"));
    }
}
