"""ذاتي نواة_قيمة MicroPython에서 사용하는 한글 دالة_قيمة اسم."""
import jkoros as نظام_تشغيل
مخرجات = print
يقرأ_ملف = نظام_تشغيل.read
كتابة_ملف = نظام_تشغيل.write
يزيل_ملف = نظام_تشغيل.remove
يقرأ_إدخال = نظام_تشغيل.stdin
رسم_مستطيل = نظام_تشغيل.rect
그림기다리기 = نظام_تشغيل.wait_key
밀리초 = نظام_تشغيل.ticks_ms
فتح_مخطط_بيانات = نظام_تشغيل.udp_open
يرسل_مخطط_بيانات = نظام_تشغيل.udp_send
يرسل_خارجي_مخطط_بيانات = نظام_تشغيل.udp_sendto
يستلم_مخطط_بيانات = نظام_تشغيل.udp_recv
يغلق_شبكة = نظام_تشغيل.udp_close

def 글해독(بيانات):
    return بيانات.decode("utf-8")
