"""자체 କେନ୍ଦ୍ରିକ_ମୂଲ୍ୟ MicroPython에서 사용하는 한글 Excel_ଟେବଲ୍_ମୂଲ୍ୟ ନାମ."""
import jkoros as ଅପରେଟିଂ_ସିଷ୍ଟମ
ନିର୍ଗମ = print
파일읽기 = ଅପରେଟିଂ_ସିଷ୍ଟମ.read
ଲିଖନ_ଫାଇଲ୍ = ଅପରେଟିଂ_ସିଷ୍ଟମ.write
ଅପସାରଣ_କରିବା_ଫାଇଲ୍ = ଅପରେଟିଂ_ସିଷ୍ଟମ.remove
입력읽기 = ଅପରେଟିଂ_ସିଷ୍ଟମ.stdin
네모그리기 = ଅପରେଟିଂ_ସିଷ୍ଟମ.rect
그림기다리기 = ଅପରେଟିଂ_ସିଷ୍ଟମ.wait_key
밀리초 = ଅପରେଟିଂ_ସିଷ୍ଟମ.ticks_ms
전문통신열기 = ଅପରେଟିଂ_ସିଷ୍ଟମ.udp_open
전문보내기 = ଅପରେଟିଂ_ସିଷ୍ଟମ.udp_send
바깥전문보내기 = ଅପରେଟିଂ_ସିଷ୍ଟମ.udp_sendto
전문받기 = ଅପରେଟିଂ_ସିଷ୍ଟମ.udp_recv
ବନ୍ଦ_ନେଟ୍_ୱାର୍କ୍ = ଅପରେଟିଂ_ସିଷ୍ଟମ.udp_close

def 글해독(ଡାଟା):
    return ଡାଟା.decode("utf-8")
