from Татарча import 출력, 전문통신열기, 바깥전문보내기, 전문받기, чик_Челтәр, 밀리초
from Татарча import система_хата, 다시시도오류, 글부호화, 명령인수, бөтен_сан
종단 = 전문통신열기(0)
try:
    전문 = 글부호화("PYTHON UDP tt")
    바깥전문보내기(종단, "10.0.2.2", бөтен_сан(명령인수[1]), 전문)
    эшләтү = 밀리초()
    while True:
        try:
            җавап_бирү, порт_VALUE = 전문받기(종단)
            break
        except система_хата as Хата:
            if Хата.INDEX != 다시시도오류 or 밀리초() - эшләтү >= 700:
                raise
    assert җавап_бирү == 전문
    출력("PYTHON 네트워크 раслау: UDP tt")
finally:
    чик_Челтәр(종단)
