package 피에이치와이엠이엠

import (
	. "커먼"
	. "unsafe"
)

const (
	B블록사이즈		uint32	= 4 * 1024
	B비엘오시케이에스피이알바이트	uint32	= 8
)

type 엠유엘티아이비오오티메모리엠에이피 struct {
	사이즈			uint32
	비에이에스이에이디디알엘오더블유	uint64
	비에이에스이에이디디알에이치아이지에이치	uint64
	렝스엘오더블유			uint64
	렝스에이치아이지에이치		uint64
	T티와이피이			uint32
}

func P피에이치와이엠이엠티이에스티() {
}

var 메모리오피이알 M메모리오피이알 = M메모리오피이알{}

type P피지컬메모리매니저 struct {
	메모리사이즈			uint32
	유에스이디비엘오시케이에스		uint32
	엠에이엑스아이엠유엠비엘오시케이에스	uint32
	메모리어레이			[]uint32
}

var (
	엠에이엑스아이엠유엠비엘오시케이에스	uint32	= 0
	메모리어레이			[]uint32
	지알유비엠유엘티아이비오오티메모리엠에이피티	엠유엘티아이비오오티메모리엠에이피
)

func (셀프 *P피지컬메모리매니저) S셋비아이티(비아이티 uint32) uint32 {
	셀프.메모리어레이[비아이티/32] = 셀프.메모리어레이[비아이티/32] | (1 << (비아이티 % 32))
	return 셀프.메모리어레이[비아이티/32]
}
func (셀프 *P피지컬메모리매니저) U유엔에스이티비아이티(비아이티 uint32) uint32 {
	셀프.메모리어레이[비아이티/32] = 셀프.메모리어레이[비아이티/32] ^ (1 << (비아이티 % 32))
	return 셀프.메모리어레이[비아이티/32]
}
func (셀프 *P피지컬메모리매니저) T티이에스티비아이티(비아이티 uint32) uint32 {
	알이티 := 셀프.메모리어레이[비아이티/32] & (1 << (비아이티 % 32))
	return 알이티
}
func (셀프 *P피지컬메모리매니저) T티오티에이엘비엘오시케이에스() uint32 {
	return 셀프.엠에이엑스아이엠유엠비엘오시케이에스
}
func (셀프 *P피지컬메모리매니저) U유에스이디비엘오시케이에스() uint32 {
	return 셀프.유에스이디비엘오시케이에스
}
func (셀프 *P피지컬메모리매니저) A에이엠오유엔티오에프메모리() uint32 {
	return 셀프.메모리사이즈
}
func (셀프 *P피지컬메모리매니저) G겟비아이티엠에이에스피사이즈() uint32 {
	return 셀프.메모리사이즈 / B블록사이즈 / B비엘오시케이에스피이알바이트
}

func (셀프 *P피지컬메모리매니저) F에프아이알에스티프리() uint32 {
	for 아이 := uint32(0); 아이 < 셀프.T티오티에이엘비엘오시케이에스(); 아이++ {
		if 셀프.메모리어레이[아이] != 0xffffffff {
			for 제이 := uint32(0); 제이 < 32; 제이++ {
				비아이티 := uint32(1 << 제이)
				if (메모리어레이[아이] & 비아이티) == 0 {
					return 아이*4*8 + 제이
				}
			}
		}
	}
	return 0xffffffff
}
func (셀프 *P피지컬메모리매니저) F에프아이알에스티프리사이즈(사이즈 uint32) uint32 {
	if 사이즈 == 0 {
		return 0xffffffff
	}
	if 사이즈 == 1 {
		return 셀프.F에프아이알에스티프리()
	}

	for 아이 := uint32(0); 아이 < 셀프.T티오티에이엘비엘오시케이에스(); 아이++ {
		if 셀프.메모리어레이[아이] != 0xffffffff {
			for 제이 := uint32(0); 제이 < 32; 제이++ {
				var 비아이티 uint32 = 1 << 제이

				if 셀프.메모리어레이[제이]&비아이티 == 0 {
					var 에스티에이알티아이엔지비아이티 uint32 = 아이 * 32
					에스티에이알티아이엔지비아이티 += 제이

					var 프리 uint32 = 0
					for 카운트 := uint32(0); 카운트 <= 사이즈; 카운트++ {
						if 셀프.T티이에스티비아이티(에스티에이알티아이엔지비아이티+카운트) == 0 {
							프리++
						}

						if 프리 == 사이즈 {
							return 아이*4*8 + 제이
						}
					}
				}
			}
		}
	}

	return 0xffffffff
}

func (셀프 *P피지컬메모리매니저) I이닛(사이즈 uint32, 비아이티엠에이피 []uint32) {
	셀프.메모리사이즈 = 사이즈
	셀프.메모리어레이 = 비아이티엠에이피
	셀프.엠에이엑스아이엠유엠비엘오시케이에스 = 사이즈 / B블록사이즈
	셀프.유에스이디비엘오시케이에스 = 셀프.엠에이엑스아이엠유엠비엘오시케이에스
	메모리오피이알.M엠이엠셋(uintptr(Pointer(&셀프.메모리어레이)), 0xFF, 셀프.유에스이디비엘오시케이에스/B비엘오시케이에스피이알바이트)
}
func (셀프 *P피지컬메모리매니저) A앨로케이트블록() uintptr {
	if FreeBlocks() <= 0 {
		return 0
	}
	return 0
}
func (셀프 *P피지컬메모리매니저) P페이지알오유엔디업(어드레스 uint32) uint32 {
	if (어드레스 & 0xFFFFF000) != 어드레스 {
		어드레스 = 어드레스 & 0xFFFFF000
		어드레스 = 어드레스 + 0x1000
	}
	return 어드레스
}
func (셀프 *P피지컬메모리매니저) P페이지알오유엔디다운(어드레스 uint32) uint32 {
	return 어드레스 & 0xFFFFF000
}
