// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int മൂല്യം) {
        if (മൂല്യം < 0x80) ബോർഡ്.직렬쓰기(മൂല്യം);
        else if (മൂല്യം < 0x800) {
            ബോർഡ്.직렬쓰기(0xc0 | (മൂല്യം >> 6)); ബോർഡ്.직렬쓰기(0x80 | (മൂല്യം & 63));
        } else if (മൂല്യം < 0x10000) {
            ബോർഡ്.직렬쓰기(0xe0 | (മൂല്യം >> 12)); ബോർഡ്.직렬쓰기(0x80 | ((മൂല്യം >> 6) & 63)); ബോർഡ്.직렬쓰기(0x80 | (മൂല്യം & 63));
        } else {
            ബോർഡ്.직렬쓰기(0xf0 | (മൂല്യം >> 18)); ബോർഡ്.직렬쓰기(0x80 | ((മൂല്യം >> 12) & 63));
            ബോർഡ്.직렬쓰기(0x80 | ((മൂല്യം >> 6) & 63)); ബോർഡ്.직렬쓰기(0x80 | (മൂല്യം & 63));
        }
    }
    static void എഴുത്തു്(String പദാവലി) {
        for (int സൂചിക = 0; സൂചിക < പദാവലി.length(); സൂചിക++) {
            int മൂല്യം = പദാവലി.charAt(സൂചിക);
            if (മൂല്യം >= 0xd800 && മൂല്യം <= 0xdbff && സൂചിക + 1 < പദാവലി.length()) {
                int 아래 = പദാവലി.charAt(സൂചിക + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    മൂല്യം = 0x10000 + ((മൂല്യം - 0xd800) << 10) + 아래 - 0xdc00; സൂചിക++;
                }
            }
            if (മൂല്യം >= 0xd800 && മൂല്യം <= 0xdfff) മൂല്യം = 0xfffd;
            문자(മൂല്യം);
        }
    }
    static void 수(int മൂല്യം) {
        if (മൂല്യം < 0) 문자('-'); else മൂല്യം = -മൂല്യം;
        int പദവി_സൂചിക = 1000000000;
        boolean നടപ്പിലാക്കുക = false;
        while (പദവി_സൂചിക > 0) {
            int അക്കം_മൂല്യം = -(മൂല്യം / പദവി_സൂചിക);
            if (അക്കം_മൂല്യം != 0 || നടപ്പിലാക്കുക || പദവി_സൂചിക == 1) { 문자('0' + അക്കം_മൂല്യം); നടപ്പിലാക്കുക = true; }
            മൂല്യം %= പദവി_സൂചിക; പദവി_സൂചിക /= 10;
        }
    }
}
