from မြန်မာ import အထွက်, ဒေတာစာဖွင့်, ပြင်ပဒေတာစာပို့, ဒေတာစာလက်ခံရယူ, ကွန်ရက်ပိတ်, မီလီစက္ကန့်
from မြန်မာ import စနစ်အမှား, 다시시도오류, စာသားကုဒ်သွင်း, အမိန့်ပေးအချက်များ, ကိန်းပြည့်
ဆုံးမှတ် = ဒေတာစာဖွင့်(0)
try:
    ဒေတာစာ = စာသားကုဒ်သွင်း("PYTHON UDP Burmese")
    ပြင်ပဒေတာစာပို့(ဆုံးမှတ်, "10.0.2.2", ကိန်းပြည့်(အမိန့်ပေးအချက်များ[1]), ဒေတာစာ)
    လုပ်ဆောင် = မီလီစက္ကန့်()
    while True:
        try:
            အကြောင်းပြန်ချက်, ဆက်သွယ်ပေါက်တန်ဖိုး = ဒေတာစာလက်ခံရယူ(ဆုံးမှတ်)
            break
        except စနစ်အမှား as အမှား:
            if အမှား.နံပါတ် != 다시시도오류 or မီလီစက္ကန့်() - လုပ်ဆောင် >= 700:
                raise
    assert အကြောင်းပြန်ချက် == ဒေတာစာ
    အထွက်("PYTHON ကွန်ရက်ဆက် အတည်ပြု: UDP Burmese")
finally:
    ကွန်ရက်ပိတ်(ဆုံးမှတ်)
