// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public class ပုံဆွဲဥပမာ {
    public static void လုပ်ဆောင်() {
        // 640x480 မျက်နှာပြင် ညာဘက်တွင် အနီ၊ အစိမ်းနှင့် အပြာ စတုဂံများ ဆွဲသည်။
        မြန်မာ.ကိုယ်ပိုင်.မျက်နှာပြင်.စတုဂံ(600, 400, 28, 20, 0x0000ff);
        မြန်မာ.ကိုယ်ပိုင်.မျက်နှာပြင်.စတုဂံ(600, 425, 28, 20, 0x00ff00);
        မြန်မာ.ကိုယ်ပိုင်.မျက်နှာပြင်.စတုဂံ(600, 450, 28, 20, 0xff0000);
        မြန်မာ.ကိုယ်ပိုင်.အထွက်.စာကြောင်းထုတ်("JAVA 그래픽: RGB");
        မြန်မာ.ကိုယ်ပိုင်.အထွက်.စာကြောင်းထုတ်("Enter");
        မြန်မာ.ကိုယ်ပိုင်.မျက်နှာပြင်.စောင့်();
    }
}
