// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public class 빛 {
    public static void main(String[] Παράμετροι) throws Exception {
        int Διαχείριση_ενημερώσεων_λογισμικού_τιμή = 0;
        int 수 = 1;
        while (수 <= 10) {
            Διαχείριση_ενημερώσεων_λογισμικού_τιμή = Διαχείριση_ενημερώσεων_λογισμικού_τιμή + 수;
            수 = 수 + 1;
        }
        ελληνικά.ίδιο.Έξοδος.수쓰기(Διαχείριση_ενημερώσεων_λογισμικού_τιμή);
        ελληνικά.ίδιο.Αρχείο.Εγγραφή("aot.txt", "한글 AOT Αρχείο 😀");
        ελληνικά.ίδιο.Έξοδος.εγγράφω_γραμμή(ελληνικά.ίδιο.Αρχείο.Ανάγνωση("aot.txt"));
    }
}
