// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int արժեք) {
        if (արժեք < 0x80) տախտակ.직렬쓰기(արժեք);
        else if (արժեք < 0x800) {
            տախտակ.직렬쓰기(0xc0 | (արժեք >> 6)); տախտակ.직렬쓰기(0x80 | (արժեք & 63));
        } else if (արժեք < 0x10000) {
            տախտակ.직렬쓰기(0xe0 | (արժեք >> 12)); տախտակ.직렬쓰기(0x80 | ((արժեք >> 6) & 63)); տախտակ.직렬쓰기(0x80 | (արժեք & 63));
        } else {
            տախտակ.직렬쓰기(0xf0 | (արժեք >> 18)); տախտակ.직렬쓰기(0x80 | ((արժեք >> 12) & 63));
            տախտակ.직렬쓰기(0x80 | ((արժեք >> 6) & 63)); տախտակ.직렬쓰기(0x80 | (արժեք & 63));
        }
    }
    static void Գրել(String Տեքստ) {
        for (int դասիչ = 0; դասիչ < Տեքստ.length(); դասիչ++) {
            int արժեք = Տեքստ.charAt(դասիչ);
            if (արժեք >= 0xd800 && արժեք <= 0xdbff && դասիչ + 1 < Տեքստ.length()) {
                int 아래 = Տեքստ.charAt(դասիչ + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    արժեք = 0x10000 + ((արժեք - 0xd800) << 10) + 아래 - 0xdc00; դասիչ++;
                }
            }
            if (արժեք >= 0xd800 && արժեք <= 0xdfff) արժեք = 0xfffd;
            문자(արժեք);
        }
    }
    static void 수(int արժեք) {
        if (արժեք < 0) 문자('-'); else արժեք = -արժեք;
        int դիրք_դասիչ = 1000000000;
        boolean Գործարկել = false;
        while (դիրք_դասիչ > 0) {
            int թվանշան_արժեք = -(արժեք / դիրք_դասիչ);
            if (թվանշան_արժեք != 0 || Գործարկել || դիրք_դասիչ == 1) { 문자('0' + թվանշան_արժեք); Գործարկել = true; }
            արժեք %= դիրք_դասիչ; դիրք_դասիչ /= 10;
        }
    }
}
