// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int значэнне) {
        if (значэнне < 0x80) 보드.직렬쓰기(значэнне);
        else if (значэнне < 0x800) {
            보드.직렬쓰기(0xc0 | (значэнне >> 6)); 보드.직렬쓰기(0x80 | (значэнне & 63));
        } else if (значэнне < 0x10000) {
            보드.직렬쓰기(0xe0 | (значэнне >> 12)); 보드.직렬쓰기(0x80 | ((значэнне >> 6) & 63)); 보드.직렬쓰기(0x80 | (значэнне & 63));
        } else {
            보드.직렬쓰기(0xf0 | (значэнне >> 18)); 보드.직렬쓰기(0x80 | ((значэнне >> 12) & 63));
            보드.직렬쓰기(0x80 | ((значэнне >> 6) & 63)); 보드.직렬쓰기(0x80 | (значэнне & 63));
        }
    }
    static void Запіс(String Тэкст) {
        for (int індэкс = 0; індэкс < Тэкст.length(); індэкс++) {
            int значэнне = Тэкст.charAt(індэкс);
            if (значэнне >= 0xd800 && значэнне <= 0xdbff && індэкс + 1 < Тэкст.length()) {
                int 아래 = Тэкст.charAt(індэкс + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    значэнне = 0x10000 + ((значэнне - 0xd800) << 10) + 아래 - 0xdc00; індэкс++;
                }
            }
            if (значэнне >= 0xd800 && значэнне <= 0xdfff) значэнне = 0xfffd;
            문자(значэнне);
        }
    }
    static void 수(int значэнне) {
        if (значэнне < 0) 문자('-'); else значэнне = -значэнне;
        int 자리 = 1000000000;
        boolean Выканаць = false;
        while (자리 > 0) {
            int лічба_значэнне = -(значэнне / 자리);
            if (лічба_значэнне != 0 || Выканаць || 자리 == 1) { 문자('0' + лічба_значэнне); Выканаць = true; }
            значэнне %= 자리; 자리 /= 10;
        }
    }
}
