// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
/** COM1 串列輸出與 VGA 80×25 字元畫面；Unicode 文字以 UTF-8 傳送至串列終端機。 */
public final class 字元終端 {
    static int 槽條目 = 0;
    static int 顏色值 = 7;

    static void 準備() {
        設備.寫入輸入輸出位元組(0x3f9, 0);
        設備.寫入輸入輸出位元組(0x3fb, 0x80);
        設備.寫入輸入輸出位元組(0x3f8, 1);
        設備.寫入輸入輸出位元組(0x3f9, 0);
        設備.寫入輸入輸出位元組(0x3fb, 3);
        設備.寫入輸入輸出位元組(0x3fa, 0xc7);
        設備.寫入輸入輸出位元組(0x3fc, 0x0b);
        擦除條目();
    }

    static void 串行位元組(int 值) {
        int 重複狀態個數 = 100000;
        while ((設備.讀取輸入輸出位元組(0x3fd) & 0x20) == 0 && 重複狀態個數 > 0) 重複狀態個數--;
        if (重複狀態個數 > 0) 設備.寫入輸入輸出位元組(0x3f8, 值);
    }

    static void 擦除條目() {
        for (int 編號 = 0; 編號 < 2000; 編號++) {
            設備.寫入記憶體(0xb8000 + 編號 * 2, 32);
            設備.寫入記憶體(0xb8001 + 編號 * 2, 顏色值);
        }
        槽條目 = 0;
        光標值();
    }

    static void 光標值() {
        設備.寫入輸入輸出位元組(0x3d4, 14);
        設備.寫入輸入輸出位元組(0x3d5, 槽條目 >> 8);
        設備.寫入輸入輸出位元組(0x3d4, 15);
        設備.寫入輸入輸出位元組(0x3d5, 槽條目 & 255);
    }

    static void 屏幕字元(int 值) {
        if (值 == 13) return;
        if (值 == 10) {
            槽條目 = (槽條目 / 80 + 1) * 80;
        } else if (值 == 8) {
            if (槽條目 > 0) {
                槽條目--;
                設備.寫入記憶體(0xb8000 + 槽條目 * 2, 32);
            }
        } else {
            設備.寫入記憶體(0xb8000 + 槽條目 * 2, 值 < 128 ? 值 : '?');
            設備.寫入記憶體(0xb8001 + 槽條目 * 2, 顏色值);
            槽條目++;
        }
        if (槽條目 >= 2000) {
            for (int 編號 = 0; 編號 < 3840; 編號++)
                設備.寫入記憶體(0xb8000 + 編號, 設備.讀取記憶體(0xb80a0 + 編號));
            for (int 編號 = 1920; 編號 < 2000; 編號++) {
                設備.寫入記憶體(0xb8000 + 編號 * 2, 32);
                設備.寫入記憶體(0xb8001 + 編號 * 2, 顏色值);
            }
            槽條目 = 1920;
        }
        光標值();
    }

    static void 字元(int 值) {
        if (值 < 128) {
            if (值 == 10) 串行位元組(13);
            串行位元組(值);
        } else if (值 < 2048) {
            串行位元組(0xc0 | (值 >> 6));
            串行位元組(0x80 | (值 & 63));
        } else {
            串行位元組(0xe0 | (值 >> 12));
            串行位元組(0x80 | ((值 >> 6) & 63));
            串行位元組(0x80 | (值 & 63));
        }
        屏幕字元(值);
    }

    static void 寫入(String 內容值) {
        for (int 編號 = 0; 編號 < 內容值.length(); 編號++) 字元(內容值.charAt(編號));
    }

    static void 寫入編號(int 值) {
        // 不轉成正數，因此 Integer.MIN_VALUE 也安全。
        if (值 < 0) 字元('-');
        else 值 = -值;
        int 位置索引 = 1000000000;
        boolean 運行 = false;
        while (位置索引 > 0) {
            int 數字值 = -(值 / 位置索引);
            if (數字值 != 0 || 運行 || 位置索引 == 1) {
                字元('0' + 數字值);
                運行 = true;
            }
            值 %= 位置索引;
            位置索引 /= 10;
        }
    }

    static int 讀取串行() {
        if ((設備.讀取輸入輸出位元組(0x3fd) & 1) != 0) return 設備.讀取輸入輸出位元組(0x3f8);
        return -1;
    }
}
