"""자체 језгро_вриједност MicroPython에서 사용하는 한글 функција_вриједност назив."""
import jkoros as оперативни_систем
출력 = print
파일읽기 = оперативни_систем.read
писати_фајл = оперативни_систем.write
уклонити_фајл = оперативни_систем.remove
입력읽기 = оперативни_систем.stdin
네모그리기 = оперативни_систем.rect
그림기다리기 = оперативни_систем.wait_key
밀리초 = оперативни_систем.ticks_ms
전문통신열기 = оперативни_систем.udp_open
전문보내기 = оперативни_систем.udp_send
바깥전문보내기 = оперативни_систем.udp_sendto
전문받기 = оперативни_систем.udp_recv
затворити_Мрежа = оперативни_систем.udp_close

def 글해독(подаци):
    return подаци.decode("utf-8")
