// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public class အလင်း {
    public static void main(String[] အချက်များ) throws Exception {
        int စုစုပေါင်းတန်ဖိုး = 0;
        int ကိန်းတန်ဖိုး = 1;
        while (ကိန်းတန်ဖိုး <= 10) {
            စုစုပေါင်းတန်ဖိုး = စုစုပေါင်းတန်ဖိုး + ကိန်းတန်ဖိုး;
            ကိန်းတန်ဖိုး = ကိန်းတန်ဖိုး + 1;
        }
        မြန်မာ.ကိုယ်ပိုင်.အထွက်.ကိန်းထုတ်(စုစုပေါင်းတန်ဖိုး);
        မြန်မာ.ကိုယ်ပိုင်.ဖိုင်.ရေး("aot.txt", "한글 AOT ဖိုင် 😀");
        မြန်မာ.ကိုယ်ပိုင်.အထွက်.စာကြောင်းထုတ်(မြန်မာ.ကိုယ်ပိုင်.ဖိုင်.ဖတ်("aot.txt"));
    }
}
