"""자체 ядро_стойност MicroPython에서 사용하는 한글 функция_стойност Име."""
import jkoros as операционна_система
Изход = print
파일읽기 = операционна_система.read
записване_Файл = операционна_система.write
премахвам_Файл = операционна_система.remove
입력읽기 = операционна_система.stdin
рисувам_правоъгълник = операционна_система.rect
그림기다리기 = операционна_система.wait_key
밀리초 = операционна_система.ticks_ms
отварям_дейтаграма = операционна_система.udp_open
изпращам_дейтаграма = операционна_система.udp_send
изпращам_външен_дейтаграма = операционна_система.udp_sendto
получавам_дейтаграма = операционна_система.udp_recv
затварям_мрежа = операционна_система.udp_close

def 글해독(данни):
    return данни.decode("utf-8")
