#ifndef _センゲン_セイスウゲンカイ
#define _センゲン_セイスウゲンカイ
/* This package's compiler ABI is i386 ILP32 with signed plain char. */
#define ハチケタグミノニシンケタスウ 8
#define フゴウツキモジセイスウサイショウチ (-128)
#define フゴウツキモジセイスウサイダイチ 127
#define フゴウナシモジセイスウサイダイチ 255
#define モジセイスウサイショウチ フゴウツキモジセイスウサイショウチ
#define モジセイスウサイダイチ フゴウツキモジセイスウサイダイチ
#define タンセイスウサイショウチ (-32767-1)
#define タンセイスウサイダイチ 32767
#define フゴウナシタンセイスウサイダイチ 65535
#define セイスウサイショウチ (-2147483647-1)
#define セイスウサイダイチ 2147483647
#define フゴウナシセイスウサイダイチ 4294967295U
#define チョウセイスウサイショウチ (-2147483647L-1L)
#define チョウセイスウサイダイチ 2147483647L
#define フゴウナシチョウセイスウサイダイチ 4294967295UL
#define チョウチョウセイスウサイショウチ (-9223372036854775807LL-1LL)
#define チョウチョウセイスウサイダイチ 9223372036854775807LL
#define フゴウナシチョウチョウセイスウサイダイチ 18446744073709551615ULL
#endif
