#ifndef 자체사용자머리
#define 자체사용자머리
#include <stdint.h>
#include <stddef.h>
#define 사용자바탕 0x02000000ul
#define ഉപയോക്താവ്_ഇമേജ്_അവസാനിപ്പിക്കുക 0x02c00000ul
#define ഉപയോക്താവ്_സമൂഹം_അവസാനിപ്പിക്കുക 0x02ed0000ul
#define ഉപയോക്താവ്_സ്റ്റാക്ക്_ചെയ്യുക_ഇമെയിൽ 0x02f00000ul
#define ഉപയോക്താവ്_അവസാനിപ്പിക്കുക 0x03000000ul
#define 사용자쪽수 ((ഉപയോക്താവ്_അവസാനിപ്പിക്കുക - 사용자바탕) / 4096ul)
#define ഉപയോക്താവ്_നിര്_വ്വഹണക്ഷമമായ_ഫയല്_തെറ്റ് (-8)
#define ഉപയോക്താവ്_ഡാറ്റാ_തെറ്റ് (-1001)
#define 사용자실행오류 (-1002)
#define ഉപയോക്താവ്_അസാധുവായ_നിര്_ദേശം (-1003)
#define ഉപയോക്താവ്_ടൈംഔട്ട് (-1004)
#define 사용자중단됨 (-1005)
typedef struct { uint64_t രജിസ്_റ്റർ_ചെയ്യുക_ഡാറ്റാ[31], കമാന്_ഡ്_പദവി, അവസ്ഥ_കോഡ്, സ്റ്റാക്ക്_ചെയ്യുക_ഇമെയിൽ; } ഉപയോക്താവ്_ఫ్రేమ్;
void 사용자체계준비(void);
int ഉപയോക്താവ്_ഒഴിവാക്കൽ(ഉപയോക്താവ്_ఫ్రేమ్ *, unsigned);
int 사용자실행파일검사(const unsigned char *, size_t);
uintptr_t ബോർഡ്_ഉപയോക്താവ്_റണ്(uintptr_t);
uintptr_t ബോർഡ്_ഉപയോക്താവ്_സാധൂകരിക്കുക(void);
uintptr_t ബോർഡ്_ഉപയോക്തൃ_നിയന്ത്രണം(uintptr_t);
uint32_t 사용자상태읽기(unsigned, unsigned);
#endif
