"""자체 төш_VALUE MicroPython에서 사용하는 한글 ФУНКЦИЯ_VALUE исем."""
import jkoros as операцион_система
출력 = print
파일읽기 = операцион_система.read
язу_файл = операцион_система.write
бетерү_файл = операцион_система.remove
입력읽기 = операцион_система.stdin
네모그리기 = операцион_система.rect
그림기다리기 = операцион_система.wait_key
밀리초 = операцион_система.ticks_ms
전문통신열기 = операцион_система.udp_open
전문보내기 = операцион_система.udp_send
바깥전문보내기 = операцион_система.udp_sendto
전문받기 = операцион_система.udp_recv
чик_Челтәр = операцион_система.udp_close

def 글해독(мәгълүмат):
    return мәгълүмат.decode("utf-8")
