/*
	Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
*/
package 자판

import . "unsafe"

import . "port"
import . "interrupt"

type I자판사건처리기 interface{
	M키누른동시(값 byte)
	M키떼는동시(값 byte)
}

type T자판_장치제어기_자료 struct{
	함수포인터 func(*T자판_장치제어기, uint32) uint32

	자료입출력단자 		T바이트입출력단자
	명령어입출력단자 	T바이트입출력단자

	i자판사건처리기 I자판사건처리기
}
var 자료 T자판_장치제어기_자료

type T자판_장치제어기 struct{
	*T개입중단_처리기
}

func (자신 *T자판_장치제어기) M초기화(개입중단_관리자  *T개입중단_관리자, 자판사건처리기 I자판사건처리기) {


	자료.i자판사건처리기 = &T기본자판사건처리기{}
	if 자판사건처리기 != nil {
		자료.i자판사건처리기 = 자판사건처리기
	}
	
	자료.함수포인터 = (*T자판_장치제어기).M개입중단처리
	var 주소 uintptr
	주소 = uintptr(Pointer(&자료.함수포인터))


	자신.T개입중단_처리기.M초기화(0x21, uintptr(Pointer(개입중단_관리자)), 주소)

	for(자료.명령어입출력단자.M읽기() & 0x01) != 0 {
		자료.자료입출력단자.M읽기()
	}

	자료.자료입출력단자.M초기화(0x60)
	자료.명령어입출력단자.M초기화(0x64)


	자료.명령어입출력단자.M쓰기(0xAE)
	자료.명령어입출력단자.M쓰기(0x20)

	자료.명령어입출력단자.M쓰기(0x60)

	var 상태 uint8
	상태 = uint8(자료.자료입출력단자.M읽기()) | 1 & (^0x10)
	자료.자료입출력단자.M쓰기(상태)

	자료.자료입출력단자.M쓰기(0xF4) 

}
func (자신 *T자판_장치제어기) M개입중단처리(확장스택포인터 uint32) uint32{


	자판값 := 자료.자료입출력단자.M읽기()

        if 자판값 < 0x80 {

                switch 자판값 {
                        case 0x02: 자료.i자판사건처리기.M키누른동시('1')
                        case 0x03: 자료.i자판사건처리기.M키누른동시('2')
                        case 0x04: 자료.i자판사건처리기.M키누른동시('3')
                        case 0x05: 자료.i자판사건처리기.M키누른동시('4')
                        case 0x06: 자료.i자판사건처리기.M키누른동시('5')
                        case 0x07: 자료.i자판사건처리기.M키누른동시('6')
                        case 0x08: 자료.i자판사건처리기.M키누른동시('7')
                        case 0x09: 자료.i자판사건처리기.M키누른동시('8')
                        case 0x0A: 자료.i자판사건처리기.M키누른동시('9')
                        case 0x0B: 자료.i자판사건처리기.M키누른동시('0')

                        case 0x10: 자료.i자판사건처리기.M키누른동시('q')
                        case 0x11: 자료.i자판사건처리기.M키누른동시('w')
                        case 0x12: 자료.i자판사건처리기.M키누른동시('e')
                        case 0x13: 자료.i자판사건처리기.M키누른동시('r')
                        case 0x14: 자료.i자판사건처리기.M키누른동시('t')
                        case 0x15: 자료.i자판사건처리기.M키누른동시('y')
                        case 0x16: 자료.i자판사건처리기.M키누른동시('u')
                        case 0x17: 자료.i자판사건처리기.M키누른동시('i')
                        case 0x18: 자료.i자판사건처리기.M키누른동시('o')
                        case 0x19: 자료.i자판사건처리기.M키누른동시('p')

                        case 0x1E: 자료.i자판사건처리기.M키누른동시('a')
                        case 0x1F: 자료.i자판사건처리기.M키누른동시('s')
                        case 0x20: 자료.i자판사건처리기.M키누른동시('d')
                        case 0x21: 자료.i자판사건처리기.M키누른동시('f')
                        case 0x22: 자료.i자판사건처리기.M키누른동시('g')
                        case 0x23: 자료.i자판사건처리기.M키누른동시('h')
                        case 0x24: 자료.i자판사건처리기.M키누른동시('j')
                        case 0x25: 자료.i자판사건처리기.M키누른동시('k')
                        case 0x26: 자료.i자판사건처리기.M키누른동시('l')

                        case 0x2C: 자료.i자판사건처리기.M키누른동시('y')
                        case 0x2D: 자료.i자판사건처리기.M키누른동시('x')
                        case 0x2E: 자료.i자판사건처리기.M키누른동시('c')
                        case 0x2F: 자료.i자판사건처리기.M키누른동시('v')
                        case 0x30: 자료.i자판사건처리기.M키누른동시('b')
                        case 0x31: 자료.i자판사건처리기.M키누른동시('n')
                        case 0x32: 자료.i자판사건처리기.M키누른동시('m')
                        case 0x33: 자료.i자판사건처리기.M키누른동시(',')
                        case 0x34: 자료.i자판사건처리기.M키누른동시('.')
                        case 0x35: 자료.i자판사건처리기.M키누른동시('-')

                      	case 0x1C: 자료.i자판사건처리기.M키누른동시('\n')
                        case 0x39: 자료.i자판사건처리기.M키누른동시(' ')

                        case 0xFA:
                        case 0x45:
                        case 0xC5:

                        default: 자료.i자판사건처리기.M키누른동시(' ')
                }

        }

	return 확장스택포인터

}

