/*
	Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
*/

package списък

import . "unsafe"
import . "console"
import mem "паметmanager"

type Възловаточка struct {
	показалци	uintptr
	previous	*Възловаточка
	следващо	*Възловаточка
}

type LinkedСписък struct {
	head		*Възловаточка
	tail		*Възловаточка
	Размер_2	int

	mem	*mem.TПаметmanager
}

func (себеси *LinkedСписък) Init(mem *mem.TПаметmanager) {
	себеси.head = nil
	себеси.tail = nil
	себеси.Размер_2 = 0

	себеси.mem = mem
}
func (себеси *LinkedСписък) Prepend_to_list(показалци uintptr) {
	новВъзловаточка := (*Възловаточка)(себеси.mem.Malloc(uint32(Sizeof(Възловаточка{}))))
	if новВъзловаточка == nil {
		return
	}
	новВъзловаточка.показалци = показалци
	новВъзловаточка.previous = nil
	новВъзловаточка.следващо = себеси.head
	if себеси.head != nil {
		себеси.head.previous = новВъзловаточка
	}
	себеси.head = новВъзловаточка
	себеси.Размер_2++

	if себеси.head.следващо == nil {
		себеси.tail = себеси.head
	}

}
func (себеси *LinkedСписък) Append_to_list(показалци uintptr) {
	if себеси.Размер_2 == 0 {
		себеси.Prepend_to_list(показалци)
	} else {
		новВъзловаточка := (*Възловаточка)(себеси.mem.Malloc(uint32(Sizeof(Възловаточка{}))))
		if новВъзловаточка == nil {
			return
		}
		новВъзловаточка.показалци = показалци
		новВъзловаточка.previous = себеси.tail
		новВъзловаточка.следващо = nil
		себеси.tail.следващо = новВъзловаточка
		себеси.tail = новВъзловаточка
		себеси.Размер_2++
	}
}
func (себеси *LinkedСписък) Insert_at_index(съдържание int, показалци uintptr) {
	if съдържание == 0 {
		себеси.Prepend_to_list(показалци)
	} else {
		previousВъзловаточка := себеси.GetВъзловаточкаat(съдържание - 1)
		следващоВъзловаточка := previousВъзловаточка.следващо
		новВъзловаточка := (*Възловаточка)(себеси.mem.Malloc(uint32(Sizeof(Възловаточка{}))))
		if новВъзловаточка == nil {
			return
		}
		новВъзловаточка.показалци = показалци

		previousВъзловаточка.следващо = новВъзловаточка
		новВъзловаточка.previous = previousВъзловаточка
		новВъзловаточка.следващо = следващоВъзловаточка
		if следващоВъзловаточка != nil {
			следващоВъзловаточка.previous = новВъзловаточка
		}

		себеси.Размер_2++

		if новВъзловаточка.следващо == nil {
			себеси.tail = новВъзловаточка
		}
	}
}
func (себеси *LinkedСписък) GetВъзловаточкаat(съдържание int) *Възловаточка {
	if съдържание < 0 || съдържание >= себеси.Размер_2 {
		return nil
	}
	var x *Възловаточка = себеси.head
	for i := 0; i < съдържание; i++ {
		x = x.следващо
	}
	return x
}

func (себеси *LinkedСписък) ЗадайВъзловаточкаat(съдържание int, показалци uintptr) {
	var x *Възловаточка = себеси.head
	for i := 0; i < съдържание; i++ {
		x = x.следващо
	}
	if x != nil {
		x.показалци = показалци
	}
}
func (себеси *LinkedСписък) Getat(съдържание int) Pointer {
	възловаточка := себеси.GetВъзловаточкаat(съдържание)
	if възловаточка == nil {
		return nil
	}
	var показалци uintptr = възловаточка.показалци
	return Pointer(показалци)
}
func (себеси *LinkedСписък) Съдържаниеот(показалци uintptr) int {
	var n *Възловаточка = себеси.head
	i := 0
	for ; i < себеси.Размер_2; i++ {
		if показалци == n.показалци {
			return i
		}
		n = n.следващо
	}
	return -1
}
func (себеси *LinkedСписък) Премахване(показалци uintptr) {
	съдържание := себеси.Съдържаниеот(показалци)
	if съдържание < 0 {
		return
	}
	себеси.Премахванеat(съдържание)
}
func (себеси *LinkedСписък) Премахванеat(съдържание int) {
	if съдържание < 0 || съдържание >= себеси.Размер_2 {
		return
	}
	възловаточка := себеси.GetВъзловаточкаat(съдържание)
	if възловаточка == nil {
		return
	}
	if възловаточка.previous != nil {
		възловаточка.previous.следващо = възловаточка.следващо
	} else {
		себеси.head = възловаточка.следващо
	}
	if възловаточка.следващо != nil {
		възловаточка.следващо.previous = възловаточка.previous
	} else {
		себеси.tail = възловаточка.previous
	}
	себеси.Размер_2 = себеси.Размер_2 - 1

	if себеси.mem != nil {
		себеси.mem.Свободно(Pointer(възловаточка))
	}
}

var console_2 = TConsole{}

func (себеси *LinkedСписък) Печат() {
	console_2.MПечатxy("LinkedList:", 1, 1)
	console_2.MUnsignedinteger32Печат(uint32(uintptr(Pointer(себеси))))
	for i := 0; i < себеси.Размер_2; i++ {
		възловаточка := (*Възловаточка)(себеси.Getat(i))
		console_2.MUnsignedinteger32Печат(uint32(възловаточка.показалци))
		console_2.MПечат(":")
	}
}
