package 이티에이치이알에프알에이엠이

import . "콘솔"

import . "amd_am79c973"
import . "unsafe"
import . "util"

var 이더넷콘솔 T콘솔 = T콘솔{}

type T이티에이치이알프레임에이치이에이디이알버퍼 struct {
	디에스티엠에이시비이	[6]byte
	에스알시엠에이시비이	[6]byte
	이티에이치이알티와이피이비이	[2]byte
}

var 프레임에이치이에이디이알사이즈 int = 14

type T이티에이치이알프레임에이치이에이디이알 struct {
	디에스티엠에이시비이	uint64
	에스알시엠에이시비이	uint64
	이티에이치이알티와이피이비이	uint16
}

func (셀프 *T이티에이치이알프레임에이치이에이디이알) I이닛(버퍼 T이티에이치이알프레임에이치이에이디이알버퍼) {
	셀프.디에스티엠에이시비이 = (A어레이티오유아이엔티48(버퍼.디에스티엠에이시비이))
	셀프.에스알시엠에이시비이 = (A어레이티오유아이엔티48(버퍼.에스알시엠에이시비이))
	셀프.이티에이치이알티와이피이비이 = (A어레이티오유아이엔티16(버퍼.이티에이치이알티와이피이비이))

}
func (셀프 *T이티에이치이알프레임에이치이에이디이알) S셋버퍼(버퍼 *T이티에이치이알프레임에이치이에이디이알버퍼) {
	버퍼.디에스티엠에이시비이 = U유아이엔티48티오어레이(U유아이엔티48알(셀프.디에스티엠에이시비이))
	버퍼.에스알시엠에이시비이 = U유아이엔티48티오어레이(U유아이엔티48알(셀프.에스알시엠에이시비이))
	버퍼.이티에이치이알티와이피이비이 = U유아이엔티16티오어레이(U유아이엔티16알(셀프.이티에이치이알티와이피이비이))
}

type I이티에이치이알프레임핸들러 interface {
	I이닛(비에이시케이이엔디 T이티에이치이알프레임피알오브이아이디이알)
	S셋핸들러(핸들러 I이티에이치이알프레임핸들러, 이티에이치이알티와이피이 uint16)
	O온이티에이치이알프레임알이시이아이브이이디(데이터포인터 uintptr, 사이즈 int) bool
	S에스이엔디(디에스티엠에이시비이 uint64, 데이터포인터 uintptr, 사이즈 uint32)
	S에스이엔디프레임(디에스티엠에이시비이 uint64, 이티에이치이알티와이피이비이 uint16, 데이터포인터 uintptr, 사이즈 uint32)
	G겟피알오브이아이디이알() T이티에이치이알프레임피알오브이아이디이알
	G겟엠에이시어드레스() uint64
	G겟아이피어드레스() uint64
}

type T이티에이치이알프레임핸들러 struct {
}

var 프레임 T이티에이치이알프레임에이치이에이디이알
var B비에이시케이이엔디 T이티에이치이알프레임피알오브이아이디이알
var 에이치에이엔디엘이알에스 [65535]I이티에이치이알프레임핸들러
var 이에프핸들러 *T이티에이치이알프레임핸들러 = nil

func (셀프 *T이티에이치이알프레임핸들러) I이닛(비에이시케이이엔디 T이티에이치이알프레임피알오브이아이디이알) {
	B비에이시케이이엔디 = 비에이시케이이엔디
}

func (셀프 *T이티에이치이알프레임핸들러) S셋핸들러(핸들러 I이티에이치이알프레임핸들러, 피이티에이치이알티와이피이 uint16) {
	에이치에이엔디엘이알에스[피이티에이치이알티와이피이] = 핸들러
}
func (셀프 *T이티에이치이알프레임핸들러) S셋비에이시케이이엔디(비에이시케이이엔디 T이티에이치이알프레임피알오브이아이디이알) {
	B비에이시케이이엔디 = 비에이시케이이엔디
}
func (셀프 *T이티에이치이알프레임핸들러) G겟비에이시케이이엔디() T이티에이치이알프레임피알오브이아이디이알 {
	return B비에이시케이이엔디
}
func (셀프 *T이티에이치이알프레임핸들러) O온이티에이치이알프레임알이시이아이브이이디(데이터포인터 uintptr, 사이즈 int) bool {
	이더넷콘솔.M출력(([]byte)("OnEtherFrameReceived"))
	return false
}
func (셀프 *T이티에이치이알프레임핸들러) S에스이엔디(디에스티엠에이시비이 uint64, 데이터포인터 uintptr, 사이즈 uint32) {
	B비에이시케이이엔디.S에스이엔디프레임(디에스티엠에이시비이, 프레임.이티에이치이알티와이피이비이, 데이터포인터, 사이즈)
}
func (셀프 *T이티에이치이알프레임핸들러) S에스이엔디프레임(디에스티엠에이시비이 uint64, 이티에이치이알티와이피이비이 uint16, 데이터포인터 uintptr, 사이즈 uint32) {
	B비에이시케이이엔디.S에스이엔디프레임(디에스티엠에이시비이, 이티에이치이알티와이피이비이, 데이터포인터, 사이즈)
}
func (셀프 *T이티에이치이알프레임핸들러) G겟엠에이시어드레스() uint64 {
	return B비에이시케이이엔디.G겟엠에이시어드레스()
}
func (셀프 *T이티에이치이알프레임핸들러) G겟아이피어드레스() uint64 {
	return B비에이시케이이엔디.G겟아이피어드레스()
}
func (셀프 *T이티에이치이알프레임핸들러) G겟피알오브이아이디이알() T이티에이치이알프레임피알오브이아이디이알 {
	return B비에이시케이이엔디
}

type T이티에이치이알프레임알에이더블유데이터핸들러 struct {
	T알에이더블유데이터핸들러
}

var 피알오브이아이디이알 T이티에이치이알프레임피알오브이아이디이알

func (셀프 *T이티에이치이알프레임알에이더블유데이터핸들러) I이닛(피피알오브이아이디이알 T이티에이치이알프레임피알오브이아이디이알, 피비에이시케이이엔디 T티에이엠디에이엠79시973) {
	피알오브이아이디이알 = 피피알오브이아이디이알
	피알오브이아이디이알.I이닛(피비에이시케이이엔디)
}
func (셀프 *T이티에이치이알프레임알에이더블유데이터핸들러) O온알에이더블유데이터알이시이아이브이이디(데이터포인터 uintptr, 사이즈 int) bool {
	return 피알오브이아이디이알.O온알에이더블유데이터알이시이아이브이이디(데이터포인터, 사이즈)
}
func (셀프 *T이티에이치이알프레임알에이더블유데이터핸들러) S에스이엔디(데이터포인터 uintptr, 사이즈 uint32) {
	피알오브이아이디이알.S에스이엔디(데이터포인터, 사이즈)
}
func (셀프 *T이티에이치이알프레임알에이더블유데이터핸들러) G겟엠에이시어드레스() uint64 {
	return 피알오브이아이디이알.G겟엠에이시어드레스()
}
func (셀프 *T이티에이치이알프레임알에이더블유데이터핸들러) G겟아이피어드레스() uint64 {
	return 피알오브이아이디이알.G겟아이피어드레스()
}
func (셀프 *T이티에이치이알프레임알에이더블유데이터핸들러) G겟피알오브이아이디이알() T이티에이치이알프레임피알오브이아이디이알 {
	return 피알오브이아이디이알
}

type T이티에이치이알프레임피알오브이아이디이알 struct {
	엔이티시에이알디	T티에이엠디에이엠79시973
	에이치에이엔디엘이알에스	[65565]I이티에이치이알프레임핸들러
}

func (셀프 *T이티에이치이알프레임피알오브이아이디이알) I이닛(비에이시케이이엔디 T티에이엠디에이엠79시973) {

	셀프.엔이티시에이알디 = 비에이시케이이엔디
	for 아이 := 0; 아이 < 65535; 아이++ {
		에이치에이엔디엘이알에스[아이] = nil
		셀프.에이치에이엔디엘이알에스[아이] = nil
	}
}

var 카운트 uint16 = 0

func (셀프 *T이티에이치이알프레임피알오브이아이디이알) O온알에이더블유데이터알이시이아이브이이디(데이터포인터 uintptr, 사이즈 int) bool {

	var 버퍼 *T이티에이치이알프레임에이치이에이디이알버퍼 = (*T이티에이치이알프레임에이치이에이디이알버퍼)(Pointer(데이터포인터))
	var 프레임 T이티에이치이알프레임에이치이에이디이알 = T이티에이치이알프레임에이치이에이디이알{}
	프레임.I이닛(*버퍼)
	var 에스이엔디비에이시케이 bool = false

	if 프레임.디에스티엠에이시비이 == 0x0000FFFFFFFFFFFF || U유아이엔티48알(프레임.디에스티엠에이시비이) == 셀프.G겟엠에이시어드레스() {
		if 에이치에이엔디엘이알에스[프레임.이티에이치이알티와이피이비이] != nil {
			이더넷콘솔.M출력(([]byte)("provider\n"))

			var 포인터 uintptr = uintptr(Pointer(데이터포인터)) + uintptr(프레임에이치이에이디이알사이즈)
			에스이엔디비에이시케이 = 에이치에이엔디엘이알에스[프레임.이티에이치이알티와이피이비이].O온이티에이치이알프레임알이시이아이브이이디(포인터, 사이즈-프레임에이치이에이디이알사이즈)

		}
	}

	if 에스이엔디비에이시케이 {
		프레임.디에스티엠에이시비이 = 프레임.에스알시엠에이시비이
		프레임.에스알시엠에이시비이 = U유아이엔티48알(셀프.G겟엠에이시어드레스())
		프레임.S셋버퍼(버퍼)

	}

	이더넷콘솔.M출력XY(([]byte)("spro["), 0, 1)
	이더넷콘솔.MUint64출력(프레임.에스알시엠에이시비이)
	이더넷콘솔.M출력(([]byte)(":"))
	이더넷콘솔.MUint64출력(프레임.디에스티엠에이시비이)
	이더넷콘솔.M출력(([]byte)(":]["))
	이더넷콘솔.MUint64출력(셀프.G겟엠에이시어드레스())
	이더넷콘솔.M출력(([]byte)(":"))
	이더넷콘솔.MUint16출력(프레임.이티에이치이알티와이피이비이)
	이더넷콘솔.M출력(([]byte)("]"))

	return 에스이엔디비에이시케이

}
func (셀프 *T이티에이치이알프레임피알오브이아이디이알) S에스이엔디(데이터포인터 uintptr, 사이즈 uint32) {
	셀프.엔이티시에이알디.S에스이엔디(데이터포인터, 사이즈)
}
func (셀프 *T이티에이치이알프레임피알오브이아이디이알) S에스이엔디프레임(디에스티엠에이시비이 uint64, 이티에이치이알티와이피이비이 uint16, 데이터포인터 uintptr, 사이즈 uint32) {

	var 버퍼2 [4096]byte
	var 버퍼 *T이티에이치이알프레임에이치이에이디이알버퍼 = (*T이티에이치이알프레임에이치이에이디이알버퍼)(Pointer(&버퍼2))

	var 프레임 T이티에이치이알프레임에이치이에이디이알 = T이티에이치이알프레임에이치이에이디이알{}
	프레임.I이닛(*버퍼)

	프레임.디에스티엠에이시비이 = U유아이엔티48알(디에스티엠에이시비이)
	프레임.에스알시엠에이시비이 = U유아이엔티48알(셀프.엔이티시에이알디.G겟엠에이시어드레스())
	프레임.이티에이치이알티와이피이비이 = U유아이엔티16알(이티에이치이알티와이피이비이)

	프레임.S셋버퍼(버퍼)
	var 에스알시 [4096]byte = *(*([4096]byte))(Pointer(데이터포인터))

	var 아이 uint32 = 0
	for 아이 = 0; 아이 < 사이즈; 아이++ {
		버퍼2[uint32(프레임에이치이에이디이알사이즈)+아이] = 에스알시[아이]

	}

	var 포인터 uintptr = uintptr(Pointer(&버퍼2))

	셀프.엔이티시에이알디.S에스이엔디(포인터, 사이즈+uint32(프레임에이치이에이디이알사이즈))

}
func (셀프 *T이티에이치이알프레임피알오브이아이디이알) G겟엠에이시어드레스() uint64 {
	return 셀프.엔이티시에이알디.G겟엠에이시어드레스()
}
func (셀프 *T이티에이치이알프레임피알오브이아이디이알) G겟아이피어드레스() uint64 {
	return 셀프.엔이티시에이알디.G겟아이피어드레스()
}
