from 한국어 import Шығысы, 전문통신열기, 바깥전문보내기, 전문받기, Жабу_желі, 밀리초
from 한국어 import жүйе_қате, 다시시도오류, 글부호화, 명령인수, бүтін_сан
қатысушы = 전문통신열기(0)
try:
    전문 = 글부호화("PYTHON UDP kk")
    바깥전문보내기(қатысушы, "10.0.2.2", бүтін_сан(명령인수[1]), 전문)
    Орындау_2 = 밀리초()
    while True:
        try:
            жауап, порт_мән = 전문받기(қатысушы)
            break
        except жүйе_қате as Қате:
            if Қате.индекс != 다시시도오류 or 밀리초() - Орындау_2 >= 700:
                raise
    assert жауап == 전문
    Шығысы("PYTHON 네트워크 тексеру: UDP kk")
finally:
    Жабу_желі(қатысушы)
