// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public class चित्रउदाहरण {
    public static void सुरू_करा() {
        // 640x480 पडद्याच्या उजवीकडे लाल, हिरवे आणि निळे आयत काढावेत.
        मराठी.स्वकीय.पडदा.आयत(600, 400, 28, 20, 0x0000ff);
        मराठी.स्वकीय.पडदा.आयत(600, 425, 28, 20, 0x00ff00);
        मराठी.स्वकीय.पडदा.आयत(600, 450, 28, 20, 0xff0000);
        मराठी.स्वकीय.आउटपुट.ओळ_लिहा("JAVA 그래픽: RGB");
        मराठी.स्वकीय.आउटपुट.ओळ_लिहा("Enter");
        मराठी.स्वकीय.पडदा.प्रतीक्षाकरा();
    }
}
