#ifndef 자체사용자머리
#define 자체사용자머리
#include <stdint.h>
#include <stddef.h>
#define 사용자바탕 0x02000000ul
#define მომხმარებელი_ნახატი_დასასრული 0x02c00000ul
#define 사용자동적기억끝 0x02ed0000ul
#define მომხმარებელი_დასტა_მისამართი 0x02f00000ul
#define მომხმარებელი_დასასრული 0x03000000ul
#define 사용자쪽수 ((მომხმარებელი_დასასრული - 사용자바탕) / 4096ul)
#define 사용자실행파일오류 (-8)
#define მომხმარებელი_მონაცემები_შეცდომა (-1001)
#define 사용자실행오류 (-1002)
#define მომხმარებელი_არასწორი_ინსტრუქცია (-1003)
#define მომხმარებელი_დრო_ამოიწურა (-1004)
#define 사용자중단됨 (-1005)
typedef struct { uint64_t დარეგისტრირება_მონაცემები[31], ბრძანება_პოზიცია, სტატუსი_კოდექსი, დასტა_მისამართი; } მომხმარებელი_ჩარჩო;
void 사용자체계준비(void);
int 사용자예외(მომხმარებელი_ჩარჩო *, unsigned);
int 사용자실행파일검사(const unsigned char *, size_t);
uintptr_t დაფა_მომხმარებელი_სერია(uintptr_t);
uintptr_t დაფა_მომხმარებელი_შემოწმება(void);
uintptr_t დაფა_სამომხმარებლო_მართვა(uintptr_t);
uint32_t 사용자상태읽기(unsigned, unsigned);
#endif
