package елемент_екрана

import . "vga"

type IЕлемент_екрана interface {
	Init(батько IЕлемент_екрана, x uint32, y uint32, w uint32, h uint32, r uint32, g uint32, b uint32)
	GetФокусвікна(елемент_екрана IЕлемент_екрана)
	Задати_локальні_координати(x int32, y int32)
	МножинаКолір(r uint32, g uint32, b uint32)
	Draw(vga *TВідеоГрафікаМасив)
	Containscoordinate(x uint32, y uint32) bool
}

type TЕлемент_екрана struct {
	батько	IЕлемент_екрана
	x	uint32
	y	uint32
	w	uint32
	h	uint32

	r	uint32
	g	uint32
	b	uint32

	Focussable	bool
}

func (поточний *TЕлемент_екрана) Init(батько IЕлемент_екрана, x uint32, y uint32, w uint32, h uint32, r uint32, g uint32, b uint32) {

	поточний.батько = батько

	поточний.x = x
	поточний.y = y
	поточний.w = w
	поточний.h = h

	поточний.r = r
	поточний.g = g
	поточний.b = b

	поточний.Focussable = true

}
func (поточний *TЕлемент_екрана) GetФокусвікна(елемент_екрана IЕлемент_екрана) {
	if поточний.батько != nil {
		поточний.батько.GetФокусвікна(елемент_екрана)
	}
}
func (поточний *TЕлемент_екрана) Задати_локальні_координати(x uint32, y uint32) {
	if поточний.батько != nil {

	}
	поточний.x = x
	поточний.y = y

}
func (поточний *TЕлемент_екрана) МножинаКолір(r uint32, g uint32, b uint32) {
	поточний.r = r
	поточний.g = g
	поточний.b = b
}

func (поточний *TЕлемент_екрана) Draw(vga *TВідеоГрафікаМасив) {
	vga.FillПрямокутник(поточний.x, поточний.y, поточний.w, поточний.h, uint8(поточний.r), uint8(поточний.g), uint8(поточний.b))
}

func (поточний *TЕлемент_екрана) Containscoordinate(x uint32, y uint32) bool {
	return поточний.x <= x && x < (поточний.x+поточний.w) && поточний.y <= y && y < (поточний.y+поточний.h)
}

type TВіджетМишаПодіяhandler struct {
}

var мишаВіджет TЕлемент_екрана
var мишаvga TВідеоГрафікаМасив
var previousx int16 = 0
var previousy int16 = 0
var xПозиція int16 = 0
var yПозиція int16 = 0

func (поточний *TВіджетМишаПодіяhandler) Init(елемент_екрана TЕлемент_екрана, vga TВідеоГрафікаМасив) {
	мишаВіджет = елемент_екрана
	мишаvga = vga
}
func (поточний *TВіджетМишаПодіяhandler) УвімкненоМишаВниз(кнопка int8) {

	мишаВіджет.Задати_локальні_координати(uint32(previousx), uint32(previousy))
	мишаВіджет.МножинаКолір(0xA8, 0x00, 0x00)
	мишаВіджет.Draw(&мишаvga)

	мишаВіджет.Draw(&мишаvga)

}

func (поточний *TВіджетМишаПодіяhandler) УвімкненоМишаВгору(кнопка int8) {
}

func (поточний *TВіджетМишаПодіяhandler) УвімкненоМишаПеремістити(x int8, y int8) {
	xПозиція += int16(x)
	if xПозиція < 0 {
		xПозиція = 0
	}
	if xПозиція >= 320 {
		xПозиція = 320
	}

	yПозиція -= int16(y)

	if yПозиція < 0 {
		yПозиція = 0
	}
	if yПозиція >= 200 {
		yПозиція = 200
	}

	мишаВіджет.Задати_локальні_координати(uint32(previousx), uint32(previousy))
	мишаВіджет.МножинаКолір(0x00, 0x00, 0x00)
	мишаВіджет.Draw(&мишаvga)

	мишаВіджет.Задати_локальні_координати(uint32(xПозиція), uint32(yПозиція))
	мишаВіджет.МножинаКолір(0x00, 0x00, 0xA8)
	мишаВіджет.Draw(&мишаvga)

	previousx = xПозиція
	previousy = yПозиція

}
