// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public class 한글소스 {
    public static void main(String[] செயலுருபுகள்) throws தமிழ்.자체.உள்ளீடு_வெளியீடு_விதிவிலக்கு {
        தமிழ்.자체.வெளியீட்டு_இடம்.எழுது_வரி("자체 컴파일러와 தமிழ் நூலகம்");
        int 글자수 = தமிழ்.자체.문자.코드포인트수("한글😀");
        தமிழ்.자체.வெளியீட்டு_இடம்.수쓰기(글자수);
        தமிழ்.자체.கோப்பின்_பெயர்.எழுது("한글자료.txt", "자체 கரு_மதிப்பு 안에서 저장한 한글😀");
        தமிழ்.자체.வெளியீட்டு_இடம்.எழுது_வரி(தமிழ்.자체.கோப்பின்_பெயர்.படி("한글자료.txt"));
    }
}
