#include <அமைப்பு/stat.h>
#include <அமைப்பு/அமைப்பு_அடையாளம்.h>
#include <அமைப்பு/syscall.h>

enum { SYS_கோப்பு_நிலை = 106, SYS_இணைப்பின்_சொந்த_நிலையைப்_பெறு = 107, SYS_திறந்த_கோப்பின்_நிலையைப்_பெறு = 108, SYS_அமைப்புத்_தகவலைப்_பெறு = 122 };

int கோப்பு_நிலை(const char *பாதை, struct கோப்பு_நிலை *பரிமாற்ற_இடையகம்)
{
    return (int)__syscall_result(
        __syscall6(SYS_கோப்பு_நிலை, (long)பாதை, (long)பரிமாற்ற_இடையகம், 0, 0, 0, 0));
}

int இணைப்பின்_சொந்த_நிலையைப்_பெறு(const char *பாதை, struct கோப்பு_நிலை *பரிமாற்ற_இடையகம்)
{
    return (int)__syscall_result(
        __syscall6(SYS_இணைப்பின்_சொந்த_நிலையைப்_பெறு, (long)பாதை, (long)பரிமாற்ற_இடையகம், 0, 0, 0, 0));
}

int திறந்த_கோப்பின்_நிலையைப்_பெறு(int கோப்பு_விவரிப்பி, struct கோப்பு_நிலை *பரிமாற்ற_இடையகம்)
{
    return (int)__syscall_result(
        __syscall6(SYS_திறந்த_கோப்பின்_நிலையைப்_பெறு, கோப்பு_விவரிப்பி, (long)பரிமாற்ற_இடையகம், 0, 0, 0, 0));
}

int அமைப்புத்_தகவலைப்_பெறு(struct utsname *அமைப்பின்_அடையாளம்)
{
    return (int)__syscall_result(
        __syscall6(SYS_அமைப்புத்_தகவலைப்_பெறு, (long)அமைப்பின்_அடையாளம், 0, 0, 0, 0, 0));
}
