// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int ਕੀਮਤ) {
        if (ਕੀਮਤ < 0x80) ਬੋਰਡ.직렬쓰기(ਕੀਮਤ);
        else if (ਕੀਮਤ < 0x800) {
            ਬੋਰਡ.직렬쓰기(0xc0 | (ਕੀਮਤ >> 6)); ਬੋਰਡ.직렬쓰기(0x80 | (ਕੀਮਤ & 63));
        } else if (ਕੀਮਤ < 0x10000) {
            ਬੋਰਡ.직렬쓰기(0xe0 | (ਕੀਮਤ >> 12)); ਬੋਰਡ.직렬쓰기(0x80 | ((ਕੀਮਤ >> 6) & 63)); ਬੋਰਡ.직렬쓰기(0x80 | (ਕੀਮਤ & 63));
        } else {
            ਬੋਰਡ.직렬쓰기(0xf0 | (ਕੀਮਤ >> 18)); ਬੋਰਡ.직렬쓰기(0x80 | ((ਕੀਮਤ >> 12) & 63));
            ਬੋਰਡ.직렬쓰기(0x80 | ((ਕੀਮਤ >> 6) & 63)); ਬੋਰਡ.직렬쓰기(0x80 | (ਕੀਮਤ & 63));
        }
    }
    static void ਲਿਖਣ(String ਟੈਕਸਟ) {
        for (int ਅਨੁਕ੍ਰਮਣਿਕਾ = 0; ਅਨੁਕ੍ਰਮਣਿਕਾ < ਟੈਕਸਟ.length(); ਅਨੁਕ੍ਰਮਣਿਕਾ++) {
            int ਕੀਮਤ = ਟੈਕਸਟ.charAt(ਅਨੁਕ੍ਰਮਣਿਕਾ);
            if (ਕੀਮਤ >= 0xd800 && ਕੀਮਤ <= 0xdbff && ਅਨੁਕ੍ਰਮਣਿਕਾ + 1 < ਟੈਕਸਟ.length()) {
                int 아래 = ਟੈਕਸਟ.charAt(ਅਨੁਕ੍ਰਮਣਿਕਾ + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    ਕੀਮਤ = 0x10000 + ((ਕੀਮਤ - 0xd800) << 10) + 아래 - 0xdc00; ਅਨੁਕ੍ਰਮਣਿਕਾ++;
                }
            }
            if (ਕੀਮਤ >= 0xd800 && ਕੀਮਤ <= 0xdfff) ਕੀਮਤ = 0xfffd;
            문자(ਕੀਮਤ);
        }
    }
    static void 수(int ਕੀਮਤ) {
        if (ਕੀਮਤ < 0) 문자('-'); else ਕੀਮਤ = -ਕੀਮਤ;
        int ਸਥਿਤੀ_ਬਦਲੋ_ਅਨੁਕ੍ਰਮਣਿਕਾ = 1000000000;
        boolean ਚਲਾਓ_2 = false;
        while (ਸਥਿਤੀ_ਬਦਲੋ_ਅਨੁਕ੍ਰਮਣਿਕਾ > 0) {
            int ਅੰਕ_ਕੀਮਤ = -(ਕੀਮਤ / ਸਥਿਤੀ_ਬਦਲੋ_ਅਨੁਕ੍ਰਮਣਿਕਾ);
            if (ਅੰਕ_ਕੀਮਤ != 0 || ਚਲਾਓ_2 || ਸਥਿਤੀ_ਬਦਲੋ_ਅਨੁਕ੍ਰਮਣਿਕਾ == 1) { 문자('0' + ਅੰਕ_ਕੀਮਤ); ਚਲਾਓ_2 = true; }
            ਕੀਮਤ %= ਸਥਿਤੀ_ਬਦਲੋ_ਅਨੁਕ੍ਰਮਣਿਕਾ; ਸਥਿਤੀ_ਬਦਲੋ_ਅਨੁਕ੍ਰਮਣਿਕਾ /= 10;
        }
    }
}
