from 한국어 import 출력, 전문통신열기, 바깥전문보내기, 전문받기, хаах_Сүлжээ, 밀리초
from 한국어 import систем_алдаа, 다시시도오류, 글부호화, 명령인수, бүхэл_тоо
종단 = 전문통신열기(0)
try:
    전문 = 글부호화("PYTHON UDP Монгол")
    바깥전문보내기(종단, "10.0.2.2", бүхэл_тоо(명령인수[1]), 전문)
    Ажиллуулах = 밀리초()
    while True:
        try:
            хариулах, порт_утга = 전문받기(종단)
            break
        except систем_алдаа as Алдаа:
            if Алдаа.индекс != 다시시도오류 or 밀리초() - Ажиллуулах >= 700:
                raise
    assert хариулах == 전문
    출력("PYTHON 네트워크 шалгах: UDP Монгол")
finally:
    хаах_Сүлжээ(종단)
