// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int قيمة) {
        if (قيمة < 0x80) لوحة.직렬쓰기(قيمة);
        else if (قيمة < 0x800) {
            لوحة.직렬쓰기(0xc0 | (قيمة >> 6)); لوحة.직렬쓰기(0x80 | (قيمة & 63));
        } else if (قيمة < 0x10000) {
            لوحة.직렬쓰기(0xe0 | (قيمة >> 12)); لوحة.직렬쓰기(0x80 | ((قيمة >> 6) & 63)); لوحة.직렬쓰기(0x80 | (قيمة & 63));
        } else {
            لوحة.직렬쓰기(0xf0 | (قيمة >> 18)); لوحة.직렬쓰기(0x80 | ((قيمة >> 12) & 63));
            لوحة.직렬쓰기(0x80 | ((قيمة >> 6) & 63)); لوحة.직렬쓰기(0x80 | (قيمة & 63));
        }
    }
    static void كتابة(String نص) {
        for (int فهرس = 0; فهرس < نص.length(); فهرس++) {
            int قيمة = نص.charAt(فهرس);
            if (قيمة >= 0xd800 && قيمة <= 0xdbff && فهرس + 1 < نص.length()) {
                int 아래 = نص.charAt(فهرس + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    قيمة = 0x10000 + ((قيمة - 0xd800) << 10) + 아래 - 0xdc00; فهرس++;
                }
            }
            if (قيمة >= 0xd800 && قيمة <= 0xdfff) قيمة = 0xfffd;
            문자(قيمة);
        }
    }
    static void رقم(int قيمة) {
        if (قيمة < 0) 문자('-'); else قيمة = -قيمة;
        int منصب_فهرس = 1000000000;
        boolean تشغيل = false;
        while (منصب_فهرس > 0) {
            int رقم_قيمة = -(قيمة / منصب_فهرس);
            if (رقم_قيمة != 0 || تشغيل || منصب_فهرس == 1) { 문자('0' + رقم_قيمة); تشغيل = true; }
            قيمة %= منصب_فهرس; منصب_فهرس /= 10;
        }
    }
}
