package 지디티

import . "unsafe"
import "reflect"
import . "콘솔"

const (
	S에스이지커널시오디이	uint32	= 0x08
	S에스이지커널데이터	uint32	= 0x10
	S에스이지커널지에스	uint32	= 0x18

	S에스이지유저시오디이	uint32	= 0x23
	S에스이지유저데이터	uint32	= 0x2B
	S에스이지유저지에스	uint32	= 0x33
	S에스이지태스크에스티에이티이	uint32	= 0x3B
)

func 지디티에프유엔시(엑스 uintptr)
func 겟지디티() *G지디티디스크립터

var 겟디스크립터 G지디티디스크립터

type T조각설명자 struct {
	한도_낮은		uint16
	기준_낮은		uint16
	기준_높은		uint8
	유형		uint8
	표시들_한도_높은	uint8
	기준_매우높은		uint8
}

func (자신 *T조각설명자) I이닛(기준 uint32, 한도 uint32, 유형 uint8, 표시들 uint8) {

	자신.기준_낮은 = uint16(기준 & 0xFFFF)
	자신.기준_높은 = uint8((기준 >> 16) & 0xFF)
	자신.기준_매우높은 = uint8((기준 >> 24) & 0xFF)

	자신.한도_낮은 = uint16(한도 & 0xFFFF)
	자신.표시들_한도_높은 = uint8((한도 >> 24) & 0x0F)
	자신.표시들_한도_높은 |= (표시들 & 0xF0)

	자신.유형 = 유형

}

type T공용서술자테이블_자료 struct {
	조각설명자 [255]T조각설명자
}

var 자료 T공용서술자테이블_자료

type T공용서술자테이블 struct {
}

func (자신 *T공용서술자테이블) I이닛() {

	var 지디티엔트리 T조각설명자

	지디티디스크립터 = *겟지디티()
	오엘디지디티에이디디알 := uintptr(uint32(지디티디스크립터.G지디티어드레스엘오더블유) |
		uint32(지디티디스크립터.G지디티어드레스에이치아이지에이치)<<16)
	오엘디지디티렌 := int(uintptr(지디티디스크립터.G지디티사이즈+1) / Sizeof(지디티엔트리))
	오엘디지디티 := *(*[]T조각설명자)(Pointer(&reflect.SliceHeader{
		Len:	오엘디지디티렌,
		Cap:	오엘디지디티렌,
		Data:	오엘디지디티에이디디알,
	}))
	copy(자료.조각설명자[:], 오엘디지디티)

	자료.조각설명자[4].I이닛(0, 64*1024*1024, 0xFA, 0xCF)
	자료.조각설명자[5].I이닛(0, 64*1024*1024, 0xF2, 0xCF)
	자료.조각설명자[6].I이닛(0x61f004, 0xffffff, 0xF2, 0x4F)

	목적 := [6]uint8{0, 0, 0, 0, 0, 0}
	기준주소 := (*uint32)(Pointer(&목적[2]))
	(*기준주소) = uint32(uintptr(Pointer(&자료)))

	크기 := (*uint16)(Pointer(&목적[0]))
	(*크기) = (uint16)((Sizeof(자료)))

	지디티에프유엔시(uintptr(Pointer(&목적)))

	단말기 := new(T콘솔)
	단말기.M출력XY("gdt:", 1, 4)
	단말기.MUint32출력(uint32(uintptr(Pointer(&자료.조각설명자[3]))))

}
func (자신 *T공용서술자테이블) S셋디스크립터(아이디엑스 int, 기준 uint32, 한도 uint32, 유형 uint8, 표시들 uint8) {
	자료.조각설명자[아이디엑스].I이닛(기준, 한도, 유형, 표시들)
}

const (
	K케이시에스인덱스	= 1
	K케이디에스인덱스	= 2
	K케이지에스인덱스	= 3

	K케이시에스에스이엘이시티오알	= K케이시에스인덱스 * 8
	K케이디에스에스이엘이시티오알	= K케이디에스인덱스 * 8
	K케이지에스에스이엘이시티오알	= K케이지에스인덱스 * 8

	S에스이지지알에이엔바이트		= 0 << 7
	S에스이지지알에이엔4케이페이지	= 1 << 7

	S에스이지엔오알더블유	= 0 << 1
	S에스이지알		= 1 << 1
	S에스이지더블유	= 1 << 1

	S에스이지시스템	= 0 << 4
	S에스이지엔오알엠에이엘	= 1 << 4

	S에스이지엔오이엑스이시	= 0 << 3
	S에스이지이그젝	= 1 << 3

	P피알아이브이커널	= 0 << 5
	P피알아이브이유저	= 3 << 5

	S에스이지비아이지모드	= 1 << 6

	P피알이에스이엔티	= 1 << 7

	U유디이에스시32에스이지			= 1 << 0
	U유디이에스시시오엔티이엔티에스		= 3 << 1
	U유디이에스시알엑스오엔엘와이			= 1 << 3
	U유디이에스시엘아이엠아이티아이엔피에이지이에스	= 1 << 4
	U유디이에스시에스이지엔오티피알이에스이엔티		= 1 << 5
	U유디이에스시유에스에이비엘이			= 1 << 6

	G지디티이엔티알아이이에스	= 256
	T티엘에스에스티에이알티	= 16
)

var (
	지디티테이블		= [G지디티이엔티알아이이에스]G지디티엔트리{}
	지디티디스크립터	G지디티디스크립터
	지디티테이블렌		= 0
)

type G지디티엔트리 struct {
	엘아이엠아이티엘오더블유			uint16
	비에이에스이엘오더블유			uint16
	비에이에스이엠아이디			uint8
	에이시시이에스에스			uint8
	엘아이엠아이티에이치아이지에이치에이엔디에프엘에이지에스	uint8
	비에이에스이에이치아이지에이치			uint8
}

func (이 *G지디티엔트리) I아이에스피알이에스이엔티() bool {
	return 이.에이시시이에스에스&P피알이에스이엔티 != 0
}

func (이 *G지디티엔트리) F에프아이엘엘(비에이에스이 uint32, 엘아이엠아이티 uint32, 에이시시이에스에스 uint8, 에프엘에이지에스 uint8) {
	이.엘아이엠아이티에이치아이지에이치에이엔디에프엘에이지에스 = uint8((엘아이엠아이티 >> 16) & 0x000F)
	이.엘아이엠아이티에이치아이지에이치에이엔디에프엘에이지에스 |= 에프엘에이지에스
	이.에이시시이에스에스 = 에이시시이에스에스
	이.비에이에스이엠아이디 = uint8(비에이에스이 >> 16)
	이.비에이에스이에이치아이지에이치 = uint8(비에이에스이 >> 24)
	이.비에이에스이엘오더블유 = uint16(비에이에스이 & 0xFFFF)
	이.엘아이엠아이티엘오더블유 = uint16(엘아이엠아이티 & 0x0000FFFF)
}

func (이 *G지디티엔트리) C시엘이에이알() {
	이.엘아이엠아이티에이치아이지에이치에이엔디에프엘에이지에스 = 0
	이.에이시시이에스에스 = 0
	이.비에이에스이엠아이디 = 0
	이.비에이에스이에이치아이지에이치 = 0
	이.비에이에스이엘오더블유 = 0
	이.엘아이엠아이티엘오더블유 = 0

}

type G지디티디스크립터 struct {
	G지디티사이즈			uint16
	G지디티어드레스엘오더블유		uint16
	G지디티어드레스에이치아이지에이치	uint16
}
type U유저디이에스시 struct {
	E엔트리엔유엠비이알	uint32
	B비에이에스이에이디디알	uint32
	L엘아이엠아이티	uint32
	F에프엘에이지에스	uint8
}

func S셋티엘에스에스이지엠이엔티(인덱스 uint32, 디이에스시 *U유저디이에스시, 테이블 []G지디티엔트리) bool {
	if 인덱스 < T티엘에스에스티에이알티 || 인덱스 > uint32(len(지디티테이블)) {
		return false
	}

	if 디이에스시.F에프엘에이지에스 == U유디이에스시알엑스오엔엘와이|U유디이에스시에스이지엔오티피알이에스이엔티 {

		테이블[인덱스].C시엘이에이알()
		return true
	}

	에프엘에이지에스 := uint8(S에스이지지알에이엔바이트)
	if 디이에스시.F에프엘에이지에스&U유디이에스시엘아이엠아이티아이엔피에이지이에스 != 0 {
		에프엘에이지에스 = S에스이지지알에이엔4케이페이지
	}
	에이시시이에스에스 := uint8(P피알아이브이유저 | S에스이지엔오알엠에이엘 | P피알이에스이엔티)
	if 디이에스시.F에프엘에이지에스&U유디이에스시알엑스오엔엘와이 != 0 {
		에이시시이에스에스 |= S에스이지이그젝
	} else {
		에이시시이에스에스 |= S에스이지더블유
	}
	if 에이시시이에스에스&S에스이지엔오알엠에이엘 != 0 {
		에프엘에이지에스 |= S에스이지비아이지모드
	}

	테이블[인덱스].F에프아이엘엘(디이에스시.B비에이에스이에이디디알, 디이에스시.L엘아이엠아이티, 에이시시이에스에스, 에프엘에이지에스)
	에프엘유에스에이치티엘에스테이블(테이블)

	return true
}

func 에프엘유에스에이치티엘에스테이블(테이블 []G지디티엔트리) {
	copy(지디티테이블[T티엘에스에스티에이알티:], 테이블[T티엘에스에스티에이알티:])
}
func F에프엘유에스에이치티엘에스테이블(테이블 []T조각설명자) {
	copy(자료.조각설명자[T티엘에스에스티에이알티:], 테이블[T티엘에스에스티에이알티:])
}
