"""자체 કર્નેલ_મૂલ્ય MicroPython에서 사용하는 한글 ફંક્શંસ_મૂલ્ય નામ."""
import jkoros as ઑપરેટિંગ_સિસ્ટમ
આઉટપુટ = print
파일읽기 = ઑપરેટિંગ_સિસ્ટમ.read
લખો_ફાઇલ = ઑપરેટિંગ_સિસ્ટમ.write
કાઢી_નાંખો_ફાઇલ = ઑપરેટિંગ_સિસ્ટમ.remove
입력읽기 = ઑપરેટિંગ_સિસ્ટમ.stdin
네모그리기 = ઑપરેટિંગ_સિસ્ટમ.rect
그림기다리기 = ઑપરેટિંગ_સિસ્ટમ.wait_key
밀리초 = ઑપરેટિંગ_સિસ્ટમ.ticks_ms
전문통신열기 = ઑપરેટિંગ_સિસ્ટમ.udp_open
전문보내기 = ઑપરેટિંગ_સિસ્ટમ.udp_send
바깥전문보내기 = ઑપરેટિંગ_સિસ્ટમ.udp_sendto
전문받기 = ઑપરેટિંગ_સિસ્ટમ.udp_recv
બંધ_કરો_નેટવર્ક = ઑપરેટિંગ_સિસ્ટમ.udp_close

def 글해독(ડેટા):
    return ડેટા.decode("utf-8")
