"""자체 కెర్నల్_మూల్యం MicroPython에서 사용하는 한글 కార్యం_మూల్యం పేరు."""
import jkoros as నిర్వహణా_వ్యవస్థ
అవుట్పుట్ = print
파일읽기 = నిర్వహణా_వ్యవస్థ.read
వ్రాయి_ఫైలు = నిర్వహణా_వ్యవస్థ.write
తీసివెయ్యి_ఫైలు = నిర్వహణా_వ్యవస్థ.remove
입력읽기 = నిర్వహణా_వ్యవస్థ.stdin
네모그리기 = నిర్వహణా_వ్యవస్థ.rect
그림기다리기 = నిర్వహణా_వ్యవస్థ.wait_key
밀리초 = నిర్వహణా_వ్యవస్థ.ticks_ms
전문통신열기 = నిర్వహణా_వ్యవస్థ.udp_open
전문보내기 = నిర్వహణా_వ్యవస్థ.udp_send
바깥전문보내기 = నిర్వహణా_వ్యవస్థ.udp_sendto
전문받기 = నిర్వహణా_వ్యవస్థ.udp_recv
మూసివేయి_నెట్_వర్క్ = నిర్వహణా_వ్యవస్థ.udp_close

def 글해독(డేటా):
    return డేటా.decode("utf-8")
