from 한국어 import Ելք, 전문통신열기, 바깥전문보내기, 전문받기, փակել_Ցանց, 밀리초
from 한국어 import համակարգ_սխալ, 다시시도오류, 글부호화, 명령인수, ամբողջ_թիվ
종단 = 전문통신열기(0)
try:
    전문 = 글부호화("PYTHON UDP Armenian")
    바깥전문보내기(종단, "10.0.2.2", ամբողջ_թիվ(명령인수[1]), 전문)
    Գործարկել = 밀리초()
    while True:
        try:
            պատասխանել, միացք_արժեք = 전문받기(종단)
            break
        except համակարգ_սխալ as Սխալ:
            if Սխալ.դասիչ != 다시시도오류 or 밀리초() - Գործարկել >= 700:
                raise
    assert պատասխանել == 전문
    Ելք("PYTHON 네트워크 հաստատել: UDP Armenian")
finally:
    փակել_Ցանց(종단)
