// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class приветствие_ae353e94 {
    public static int запустить() {
        пространство_пользователя.Запись("Hello from a separate Java ELF!\n");
        пространство_пользователя.Запись(пространство_пользователя.выполнение_Полномочие() == 3 ? "USER MODE ring 3\n" : "WRONG PRIVILEGE\n");
        for (int ИНДЕКС = 0; ИНДЕКС < пространство_пользователя.인수개수(); ИНДЕКС++) {
            пространство_пользователя.Запись("arg: "); пространство_пользователя.Запись(пространство_пользователя.аргументы(ИНДЕКС)); пространство_пользователя.Запись("\n");
        }
        return пространство_пользователя.выполнение_Полномочие() == 3 ? 0 : 1;
    }
}
