#include "예제규약.h"
int main(void) {
    const char подаци[]="C Датотека: српски 😀\n";
    int Датотека=креирати_фајл("c.txt",за_читање_писање|없으면만들기|내용비우기,0600);
    if(Датотека<0)return 1;
    if(писати_фајл_подаци(Датотека,подаци,sizeof(подаци)-1)!=sizeof(подаци)-1)return 2;
    if(тражити_фајл(Датотека,0,처음기준)!=0)return 3;
    char 읽은글[128]={0};int дужина_вриједност=파일자료읽기(Датотека,읽은글,sizeof(읽은글)-1);
    затварање_фајл(Датотека);
    if(дужина_вриједност!=sizeof(подаци)-1)return 4;
    for(int 수=0;수<дужина_вриједност;수++)if(подаци[수]!=읽은글[수])return 5;
    return Излаз(읽은글);
}
