// Copyright 2020. (노성철, nsch78@nate.com, nsch@naver.com) All right reserved
public final class 단말 {
    static void 문자(int стойност) {
        if (стойност < 0x80) Табло.직렬쓰기(стойност);
        else if (стойност < 0x800) {
            Табло.직렬쓰기(0xc0 | (стойност >> 6)); Табло.직렬쓰기(0x80 | (стойност & 63));
        } else if (стойност < 0x10000) {
            Табло.직렬쓰기(0xe0 | (стойност >> 12)); Табло.직렬쓰기(0x80 | ((стойност >> 6) & 63)); Табло.직렬쓰기(0x80 | (стойност & 63));
        } else {
            Табло.직렬쓰기(0xf0 | (стойност >> 18)); Табло.직렬쓰기(0x80 | ((стойност >> 12) & 63));
            Табло.직렬쓰기(0x80 | ((стойност >> 6) & 63)); Табло.직렬쓰기(0x80 | (стойност & 63));
        }
    }
    static void Писане(String Текст) {
        for (int индекс = 0; индекс < Текст.length(); индекс++) {
            int стойност = Текст.charAt(индекс);
            if (стойност >= 0xd800 && стойност <= 0xdbff && индекс + 1 < Текст.length()) {
                int 아래 = Текст.charAt(индекс + 1);
                if (아래 >= 0xdc00 && 아래 <= 0xdfff) {
                    стойност = 0x10000 + ((стойност - 0xd800) << 10) + 아래 - 0xdc00; индекс++;
                }
            }
            if (стойност >= 0xd800 && стойност <= 0xdfff) стойност = 0xfffd;
            문자(стойност);
        }
    }
    static void 수(int стойност) {
        if (стойност < 0) 문자('-'); else стойност = -стойност;
        int позиционен_указател = 1000000000;
        boolean Стартиране = false;
        while (позиционен_указател > 0) {
            int цифра_стойност = -(стойност / позиционен_указател);
            if (цифра_стойност != 0 || Стартиране || позиционен_указател == 1) { 문자('0' + цифра_стойност); Стартиране = true; }
            стойност %= позиционен_указател; позиционен_указател /= 10;
        }
    }
}
