#include "예제규약.h"
int main(void) {
    const char данни[]="C Файл: bg 😀\n";
    int Файл=отварям_Файл("c.txt",읽고쓰기|없으면만들기|съкращавам_Съдържание,0600);
    if(Файл<0)return 1;
    if(записване_Файл_данни(Файл,данни,sizeof(данни)-1)!=sizeof(данни)-1)return 2;
    if(търся_Файл(Файл,0,처음기준)!=0)return 3;
    char 읽은글[128]={0};int 길이=파일자료읽기(Файл,읽은글,sizeof(읽은글)-1);
    затварям_Файл(Файл);
    if(길이!=sizeof(данни)-1)return 4;
    for(int 수=0;수<길이;수++)if(данни[수]!=읽은글[수])return 5;
    return Изход(읽은글);
}
