"""자체 јадро_VALUE MicroPython에서 사용하는 한글 ФУНКЦИЈА_VALUE Име."""
import jkoros as оперативен_систем
출력 = print
파일읽기 = оперативен_систем.read
запиши_датотека = оперативен_систем.write
отстрани_датотека = оперативен_систем.remove
입력읽기 = оперативен_систем.stdin
네모그리기 = оперативен_систем.rect
그림기다리기 = оперативен_систем.wait_key
밀리초 = оперативен_систем.ticks_ms
전문통신열기 = оперативен_систем.udp_open
전문보내기 = оперативен_систем.udp_send
바깥전문보내기 = оперативен_систем.udp_sendto
전문받기 = оперативен_систем.udp_recv
затвори_Мрежа = оперативен_систем.udp_close

def 글해독(податоци):
    return податоци.decode("utf-8")
