#ifndef _include_الشبكات_المترابطة_العنوان
#define _include_الشبكات_المترابطة_العنوان

#include <أنواع_الأعداد_الصحيحة.h>
#include <النظام/socket.h>

typedef uint32_t نوع_قيمة_عنوان_الشبكات_المترابطة;
typedef uint16_t نوع_رقم_منفذ_الاتصال;

struct عنوان_الشبكات_المترابطة {
    نوع_قيمة_عنوان_الشبكات_المترابطة قيمة_العنوان;
};

struct عنوان_نقطة_اتصال_الشبكات_المترابطة {
    نوع_عائلة_العناوين عائلة_عناوين_الشبكات_المترابطة;
    نوع_رقم_منفذ_الاتصال رقم_منفذ_الاتصال;
    struct عنوان_الشبكات_المترابطة محتوى_عنوان_الشبكات_المترابطة;
    unsigned char حشو_العنوان[8];
};

#define بروتوكول_الشبكات_المترابطة_الأساسي 0
#define بروتوكول_رزم_المستخدم 17
#define أي_عنوان_محلي ((نوع_قيمة_عنوان_الشبكات_المترابطة)0x00000000U)
#define عنوان_الحلقة_المحلية ((نوع_قيمة_عنوان_الشبكات_المترابطة)0x7f000001U)

#endif
